[
  {
    "id": 1,
    "m_commerce_developments": [1, 2, 3, 4],
    "name": "Waverun City",
    "desc": "A seaside port city abundant in various seafood, ravaged by war, and in need of extensive reconstruction, where sailors pray for luck more frequently before setting sail due to frequent maritime disasters. The Advance Order stationed here has a large demand for Luxites.",
    "faction_id": 3,
    "editor_name": "浪涌城",
    "icon": "commerce_city_waveruncity"
  },
  {
    "id": 2,
    "m_commerce_developments": [5, 6, 7, 8],
    "name": "Windyvale Town",
    "desc": "A small town near the Town of Convallaria, situated at the entrance to the Great Sand Sea. Recently, the town has been filled with the sounds of steel clashing and the pungent smell of explosives. Due to the heavy physical labor and frequent accidents, there is a demand for both salt and medicine.",
    "faction_id": 0,
    "editor_name": "风谷镇",
    "icon": "commerce_city_windyvaletown"
  },
  {
    "id": 3,
    "m_commerce_developments": [9, 10, 11, 12],
    "name": "Mine Pit",
    "desc": "A once-abandoned mining town now undergoing rejuvenation. It is abundant in various ores and rock salt, while in need of grain, medicine, and explosives used in mining.",
    "faction_id": 0,
    "editor_name": "矿坑城",
    "icon": "commerce_city_minepit"
  },
  {
    "id": 4,
    "m_commerce_developments": [13, 14, 15, 16],
    "name": "Rabi'a Oasis",
    "desc": "The final gateway linking Iria to the Elaman Empire, selling spices and Elaman's specialty health products. Merchants often change their wagon wheels here before loading crates of salt, gems, pearls, fur, and Luxites for transport to Elaman.",
    "faction_id": 8,
    "editor_name": "拉比亚绿洲",
    "icon": "commerce_city_rabiaoasis"
  },
  {
    "id": 5,
    "m_commerce_developments": [17, 18, 19, 20],
    "name": "Mornrays Castle",
    "desc": "The capital city of the Kingdom of Iria, where artisans of all kinds gather to process the nearby minerals and timber. The city requires grain from the surrounding areas to feed its numerous residents, and the nobles here have a particular fondness for decorations from other regions.",
    "faction_id": 1,
    "editor_name": "晨曦堡",
    "icon": "commerce_city_mornrayscastle"
  },
  {
    "id": 6,
    "m_commerce_developments": [21, 22, 23, 24],
    "name": "Lightgloam City",
    "desc": "The former capital of Iria, now within the realm of the Papal States, holds significant purchasing power. The affluent elites here are passionate about wellness practices and animal products, and often compete to flaunt the number of Irian gems they possess.",
    "faction_id": 2,
    "editor_name": "暮光城",
    "icon": "commerce_city_lightgloamcity"
  },
  {
    "id": 7,
    "m_commerce_developments": [25, 26, 27, 28],
    "name": "Vlder Tribes",
    "desc": "The home of the Vlderians, who are skilled in hunting and crafting medicines from various exotic materials, as well as making handmade items in their leisure time. Before venturing out of the mountains, they need to fortify their defense facilities and replenish their weaponry.",
    "faction_id": 4,
    "editor_name": "薇尔德部族",
    "icon": "commerce_city_vldertribes"
  }
]