[
  {
    "id": 4,
    "name": "沙漠中的秘宝",
    "editor_name": "沙漠宝藏",
    "manifest_content": "传言可能并不真实，但越来越多的证据让人无法忽视，不如去试试看？沙漠深处的宝藏，谁会不喜欢呢？",
    "bg_texture": "",
    "idintelligence_group": 1,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 1
  },
  {
    "id": 13,
    "name": "Kingdom of Iria",
    "editor_name": "0001-百科-伊利亚王国",
    "manifest_content": "The Kingdom of Iria has a long history. Located on the western part of the continent, it borders multiple large countries to the east and south and is near the sea to the west and north, which makes it a transportation hub. Several years ago, the king fell ill and began to convalesce. Since then, Prince Dantalion has been the actual ruler. Due to the discovery of large Luxite deposits, various countries started attempting to interfere with Iria's internal affairs, turning it into the center of a maelstrom.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 20,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 14,
    "name": "Iria's History",
    "editor_name": "0002.百科-伊利亚的历史",
    "manifest_content": "Iria's history is divided into three periods. Ancient Iria once was a prosperous kingdom ruled by the \"Thirteen Sages\" system, but then it was destroyed by the conquest of the Elaman Empire. After the Radiant War II, Iria separated from Elaman and became a vassal state of the Papal States of Rodinia, known as the \"State of Iria\". After the discovery of Luxite lodes, the current King Faris overthrew the ruthless rule of the State of Iria and established the present-day Kingdom of Iria.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 19,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 15,
    "name": "Rawiyah",
    "editor_name": "0003.百科-拉维耶",
    "manifest_content": "She is the Leader and Chief Instructor of the Mercenary Group in the town, who usually appears carefree and is addicted to drinking. However, she is actually very righteous and warm-hearted. She is not a native of the town. Many years ago, she settled down here and formed a mercenary group to protect the town. She is beloved and supported by both the townspeople and the mercenaries. She is a powerful warrior skilled in various weapons and squad tactics. With a broad range of knowledge, she is not an ordinary wanderer. However, she remains tight-lipped about her experiences.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 3,
    "group_priority": 18,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 16,
    "name": "The Town of Convallaria",
    "editor_name": "0004.百科-铃兰小镇",
    "manifest_content": "It is a crucial transportation hub of the kingdom. Located to the west of the \"Crossroads,\" the town was initially a flat land for caravans to rest. With the development of trade, it gradually evolved into a multifunctional town with various amenities. The town was named after the \"Hill of Convallaria\" to the south, which is covered with blooming Convallaria. It once attracted a mass of travelling merchants and became increasingly prosperous. After the king fell ill and Prince Dantalion took over the kingdom, the situation in Iria gradually became unstable, leading to a slight decline in the town's prosperity. Before the outbreak of the civil war, the town had a population of around a thousand and even established a mercenary group, the \"Sword of Convallaria\", to combat against beasts and bandits.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 3,
    "group_priority": 17,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 17,
    "name": "The Hill of Convallaria",
    "editor_name": "0005.百科-铃兰之丘",
    "manifest_content": "It is a small hill to the south of the town which overlooks the entire area. It is covered with Convallaria, earning it the name of the \"Hill of Convallaria.\" As the hill provides a panoramic view of the surrounding area, people can see their loved ones departing or returning along the trade route. Thus, the townspeople have formed a tradition of \"praying for the safety of their loved ones on the Hill of Convallaria whenever they depart on a journey.\" There is an abandoned sanctuary, the Light of Sanctuary, on the hill that has been unused for years.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 3,
    "group_priority": 16,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 18,
    "name": "Sword of Convallaria Mercenary Group",
    "editor_name": "0006.百科-铃兰之剑佣兵团",
    "manifest_content": "It is a mercenary group which was formed under the leadership of Rawiyah in recent years as entrusted by the townspeople and was named after the \"Sword of Convallaria.\" \nIn earlier times, as the trade route was prosperous, the escorts of the caravans ensured the stability of the town. However, as the trade route gradually declined and bandits proliferated, the defense of the town became an urgent need. \nTherefore, the \"Sword of Convallaria\" became the greatest reliance for the peace and stability of the town.",
    "bg_texture": "event_letter",
    "idintelligence_group": 3,
    "group_priority": 15,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 19,
    "name": "Waverun City",
    "editor_name": "0007.百科-港都",
    "manifest_content": "It is a seaport located in the northwest of the kingdom and at the estuary of the Iria River and the most important harbor of the Kingdom of Iria. Furthermore, it has rapidly developed due to the Luxite maritime trade route in the past decade and is the wealthiest city in Iria. The Luxite trade has given rise to a large number of merchants and emerging social classes, but it has also resulted in a significant wealth gap.",
    "bg_texture": "event_vendor",
    "idintelligence_group": 3,
    "group_priority": 14,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 20,
    "name": "Waverun City Tragedy",
    "editor_name": "0008.事件-港都惨案",
    "manifest_content": "It is a riot that originated from a parade in Waverun City and resulted in the casualties of thousands of people, including women and children. This disaster then was in the world's spotlight. Different parties held different views on the cause of the incident, blaming each other. The Papal States of Rodinia and the Union of Knight States were suspected to be involved, but there were also voices claiming that the King's Army staged the incident themselves. During the conflict, Princess Inanna, who went to mediate, was imprisoned and subjected to a cruel execution. However, there were also rumors claiming that the one who was sacrificed was only a body double.",
    "bg_texture": "event_ruins",
    "idintelligence_group": 4,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 21,
    "name": "Sanctuary Day",
    "editor_name": "0009.百科-圣祈日",
    "manifest_content": "It is a traditional festival of the \"Light of Sanctuary\" which was brought to Iria during the reign of the Papal States of Rodinia. It has become the biggest festival celebration in Iria. During the festival, the townspeople used to take to the streets for singing and dancing, while intricately decorated floats paraded through the town. Many folk customs, snacks, and goods were only available during the festival. However, this year, due to the tense situation, the atmosphere of the Sanctuary Day has gradually become delicate and sensitive.",
    "bg_texture": "event_portcity",
    "idintelligence_group": 3,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 22,
    "name": "Wave of Refugees",
    "editor_name": "0010.事件-难民潮",
    "manifest_content": "With the conflict escalating in scale, many civilians have become refugees fleeing their homes in search of safety. Most of them are now heading towards the Mornrays Castle for refuge.",
    "bg_texture": "event_refugees",
    "idintelligence_group": 4,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 24,
    "name": "Faycal",
    "editor_name": "0012.伊利亚王国-法卡尔",
    "manifest_content": "He is a mercenary boy who is gloomy and stubborn and lacks a sense of security. \nHe is an orphan who fled from another place and has received help from the townspeople and Rawiyah. However, the experience of fleeing has left an indelible pain in his heart, \nmaking him full of mistrust towards people and unable to easily trust others. He is willing to pay any price as long as he can survive and protect everyone. He has a difficult personality and is not very talkative.",
    "bg_texture": "event_letter",
    "idintelligence_group": 5,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 25,
    "name": "Maitha",
    "editor_name": "0013.伊利亚王国-麦莎",
    "manifest_content": "She is a kind and lively mercenary girl who is carefree and easygoing. \nShe is an orphan who fled from another place and grew up healthily with the help of the townspeople and Rawiyah. \nShe is optimistic and strong-willed and never gives up. \nFull of justice and compassion, she desires to protect her family, the town, and everyone around her.",
    "bg_texture": "event_letter",
    "idintelligence_group": 5,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 26,
    "name": "Outbreak of the Civil War",
    "editor_name": "0014.百科-内战的爆发",
    "manifest_content": "After the Waverun City tragedy in March of the year 999 of the Radiant Calendar, some merchants and nobles declared that they no longer recognized the legitimacy of the royal family of the Kingdom of Iria and formed the \"Waverun Legion\" with the intention of overthrowing the ruling authority. \nA few weeks after the Waverun City incident, the actual ruler of Iria — Prince Dantalion — delivered a public speech at the funeral of Princess Inanna, stating that the Iria's royal family would never compromise with the cruel rebels and would send troops to quell the rebellion, seeking revenge for the victims and the Princess. \nFrom that moment on, the civil war in Iria broke out completely.",
    "bg_texture": "event_war",
    "idintelligence_group": 3,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 27,
    "name": "Conflicts in Iria",
    "editor_name": "0015.伊利亚王国-伊利亚的矛盾",
    "manifest_content": "Iria is home to different cultures, ethnicities, and races. Its long history has given birth to a multitude of conflicts based on different backgrounds, classes, and cultures. In recent years, the main conflicts have focused on the distribution of Luxite resources and cultural clashes. The Luxite trade has generated a vast amount of wealth, creating new aristocrats and merchants. However, due to unequal distribution, the lives of the common people have not improved. In addition, there is also a significant conflict between the lower-class citizens who embrace the orthodox Light of Sanctuary and the believers of the Light of Protection brought from the Luxite trade.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 5,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 28,
    "name": "Safe Zone Established by the Order",
    "editor_name": "0016.事件-骑士团建立安全区",
    "manifest_content": "Recently, the Union of Knight States, a mighty foreign force, has intervened in the situation of Iria as a mediator and dispatched the Advance Order to uphold the interests of the Council of Knights in Iria. The Council of Knights called for a ceasefire and established a non-combat zone in the north to protect the refugees. A group of powerful knights also became active in Iria under the pretext of investigating the truth behind the Waverun City incident. The northern King's Army had to stop their progress to suppress the rebellion because the safe zone refused to let them pass through.",
    "bg_texture": "event_knights",
    "idintelligence_group": 4,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 29,
    "name": "Interference of the Papal States of Rodinia",
    "editor_name": "0017.事件-教皇国的干涉",
    "manifest_content": "Iria was a vassal state of the Papal States of Rodinia before its autonomy. Faris, the current King of Iria, overthrew the \"State of Iria\" controlled by the Papal States of Rodinia and won autonomy for Iria. However, the Papal States of Rodinia has always held a grudge over this matter and provided refuge for the former puppet royal family. Apparently, their current invasion of Lightgloam City is a retaliation against the Kingdom of Iria, and their retaliation is unlikely to end there.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 4,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 30,
    "name": "Counterattack of the King's Army",
    "editor_name": "0018.事件-政府军反攻",
    "manifest_content": "Under the leadership of Prince Dantalion, the King's Army is marching towards Waverun City from multiple directions. \nThe hastily organized Waverun Legion seems to be no match for the King's Army, neither in morale nor in equipment. However, the long supply line of the King's Army may be a vulnerability. If their supply is frequently attacked, they may suffer a major setback.",
    "bg_texture": "event_war",
    "idintelligence_group": 4,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 31,
    "name": "King's Army in Trouble",
    "editor_name": "0019.事件-泥潭中的政府军",
    "manifest_content": "Due to the frequent devastating attacks on their supply line, the King's Army has run out of food and is now stuck in a quagmire, which is precisely the strategy of the Order. Some witnesses reported that the well-trained and powerful Advance Order broke through the camp and destroyed the entire supply station with ease. It appears that the Order have not been \"neutral\" as they claimed, as they have semi-publicly intervened in the civil war. \nAt the same time, the Restoration Army organized by the Papal States of Rodinia in Lightgloam City also poses a serious threat to the flank of the King's Army. \nThe King's Army is in such trouble that it is unable to make any progress.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 4,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 32,
    "name": "Mercenary Guild",
    "editor_name": "0020.百科-佣兵行会",
    "manifest_content": "Its full name is the \"Council of Mercenary Group Industrial Alliance\", and the mercenary group ranks it evaluates have a high level of effectiveness across all continents. Essentially, it is a platform for mercenary quests that operates by taking a commission. However, there are rumors that valuable information about mercenary groups can be obtained from the Mercenary Guild by paying a large sum of money, but it has consistently denied these claims. It has a strong intelligence-gathering ability, and even slightly prominent mercenary groups are invited by it to be evaluated and included in the platform.",
    "bg_texture": "event_letter",
    "idintelligence_group": 3,
    "group_priority": 11,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 33,
    "name": "Crossroads",
    "editor_name": "0021.百科-十字路口",
    "manifest_content": "There are two important main roads in the Kingdom of Iria that run from north to south and from east to west respectively across the entire country. The intersection of these two roads in the central region of Iria is known as the \"Crossroads\" and is a vital transportation hub. The two main roads connect to the desert trade route leading to the Elaman Empire in the east and to the port city of Waverun City in the west. The roads go south through Lightgloam City to the Papal States of Rodinia and go north to the Mornrays Castle. The Crossroads also houses important military fortresses that ensure the smooth flow of trade routes, and it has been a contested area in numerous regional conflicts in Iria.",
    "bg_texture": "event_fort",
    "idintelligence_group": 3,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 34,
    "name": "Union of Knight States",
    "editor_name": "0022.百科-骑士评议会",
    "manifest_content": "The history of the Union of Knight States can be traced back to the Radiant War I, where the Order, who contributed greatly to the Papal States of Rodinia, formed many states on the occupied lands. These states eventually had a falling out with the Papal States of Rodinia after the Radiant War II, leading to a complete rupture and the formation of an independent political entity, which is now known as the Union of Knight States. In consideration of geographical politics, as well as the desire to obtain Luxite, the Council of Knights has been actively engaging in trade with Iria. As a result, many new aristocrats and merchants have benefited greatly. The Light of Protection is a new religious sect founded by the Union based on the orthodox Light of Sanctuary.",
    "bg_texture": "event_knights",
    "idintelligence_group": 3,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 35,
    "name": "Papal States of Rodinia",
    "editor_name": "0023.百科-教皇国",
    "manifest_content": "The Papal States of Rodinia is one of the oldest political powers on the continent and is a vassal state based on the Light of Sanctuary. Through the Radiant War I, the Papal States of Rodinia acquired vast territories and resources. Despite setbacks in the Radiant War II and the subsequent independence of the Union of Knight States, the Papal States of Rodinia remains one of the foremost powers on the continent. The Papal States of Rodinia claims that it is the owner to all Luxite, leading to a strained relation with Iria, which possesses Luxite lodes. The Papal States of Rodinia resorted to puppet rule first and then signed the Treaty of Iria to force Iria into ceding one-third of its territory and Luxite lodes.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 3,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 36,
    "name": "Lightgloam City",
    "editor_name": "0024.百科-旧都",
    "manifest_content": "Lightgloam City, located in the southern region of Iria, was the capital of the Papal States of Rodinia during its reign. It was largely destroyed during Iria's War of Independence. The trade route leading to the Papal States of Rodinia passes through this city, but due to trade sanctions imposed by the Papal States of Rodinia after Iria's independence, the trade route has become largely abandoned. Despite this, many pro-Papal States residents still reside in this city, making it a major hub for the Papal States's espionage activities against Iria.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 37,
    "name": "Darklight",
    "editor_name": "0025.黑暗之光-黑暗之光",
    "manifest_content": "Darklight is an extremist organization entrenched in Iria that uses various tactics, such as manipulation, deception, and even kidnapping, to expand its power. The organization advocates for a twisted belief that \"only destruction can give birth to new life.\" In the past, Darklight faced severe crackdowns from the Iria's royal family. However, due to the outbreak of the civil war, a mass of refugees were deceived into joining the organization, leading to unprecedented expansion and plundering of resources.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 8,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 8
  },
  {
    "id": 38,
    "name": "Mine Pit",
    "editor_name": "0026.百科-矿坑市",
    "manifest_content": "It is a vast slum centered around the low-quality Luxite mines located to the south of the Iria River on the Central Tableland. Since the state period, countless peasants have been forced to gather in this area for mining and related industries to make a living. Over the years, the Mine Pit has become a massive slum. The area is a mix of different groups, sheltering a great many refugees and homeless peoples. The headquarters of Darklight is located in the complex network of mines and slums in the Mine Pit.",
    "bg_texture": "event_minecity",
    "idintelligence_group": 3,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 39,
    "name": "Three Heirs",
    "editor_name": "0027.伊利亚王国-三位继承人",
    "manifest_content": "Iria's King Faris has three heirs: Prince Dantalion, Prince Lutfi, and Princess Inanna. Currently, the affairs of Iria are solely managed by Prince Dantalion. The agent organization, the Hanged Men, is also under his control. However, his radical reinforcement of central rule has led to discontent among the moderates within the kingdom, as well as among the new aristocrats and merchants. By contrast, Prince Lutfi, as a representative of new aristocrats and merchants, advocates for a more moderate, inclusive, and open Iria. Princess Inanna, although lacking tangible royal resources, is widely beloved by the people and has garnered support for her ascension to the throne among the common folk.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 5,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 40,
    "name": "Mornrays Castle",
    "editor_name": "0028.百科-王都",
    "manifest_content": "The Mornrays Castle was formerly a large garrison fortress built during the period of the State of Iria. It is located at the northern end of the Crossroads on a mountainous terrain where the Vltar Mountain and the Central Tableland meet. The Mornrays Castle has a population of around 30,000, much smaller than that of Waverun City. The population is mainly composed of garrisons, powerful families, and civilians who serve the former two groups, so its function as a city is not complete. The Mornrays Castle is the political and military center of the Kingdom of Iria, with underdeveloped business, industry, and agriculture, heavily reliant on supplies transported by the Crossroads.",
    "bg_texture": "event_fort",
    "idintelligence_group": 3,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 41,
    "name": "Expansion of Darklight",
    "editor_name": "0029.黑暗之光-黑暗之光的扩张",
    "manifest_content": "Recent intelligence reports that Darklight is rapidly expanding at a terrifying pace. This is because the King's Army is preoccupied with the front lines and has little time to focus on local governance, allowing Darklight to gain access to a large amount of land and resources. Furthermore, a mass of homeless and unassisted refugees have fallen under the influence of Darklight, becoming a continuous source of troops for the organization. If not contained, Darklight will inevitably pose a threat to the town sooner or later.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 8,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 8
  },
  {
    "id": 42,
    "name": "Prince Lutfi",
    "editor_name": "0030.伊利亚王国-二皇子鲁特菲",
    "manifest_content": "He is the second prince of the Kingdom of Iria who, \nknown for being approachable and down-to-earth, often disguises himself and mingles with people from all walks of life. \nHe has a remarkable eloquence and unique vision for the future of Iria, which he strives to achieve. \nHe greatly admires the capabilities and aspirations of the Mercenary Group and often provides assistance to it. \nFurthermore, he also seems to have a thing for Convallaria.",
    "bg_texture": "event_news",
    "idintelligence_group": 5,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 43,
    "name": "Long-Term Mercenary Contract",
    "editor_name": "0031.其他-佣兵长期契约",
    "manifest_content": "A mercenary group can sign long-term contracts with political entities, organizations or individuals, transforming their simple employment relationship into a subordinate one. Although the mercenary group cannot \"join\" a faction through a long-term contract, issuing such contracts is itself a manifestation of trust towards the mercenary group by the faction. These long-term contracts can be terminated at any time, but the party initiating the termination will bear a certain cost and face the anger of betrayal from the other party.",
    "bg_texture": "event_letter",
    "idintelligence_group": 9,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 9
  },
  {
    "id": 44,
    "name": "Crossroads Keep",
    "editor_name": "0032.百科-十字路口堡",
    "manifest_content": "The Crossroad Keep is one of the three major fortresses in Iria. It is an important military stronghold on par with the Mornrays Castle and the former capital of Lightgloam City before its destruction. It has long been garrisoned by elite troops of the King's Army. It controls two major trade routes and the Iria River, with a continuous supply of water and stockpiled supplies sufficient to keep the defenders under siege for several years. In addition, it is strategically positioned to complement the defenses of the Mornrays Castle, supporting each other. Any hasty attack on the Crossroad Keep would be futile.",
    "bg_texture": "event_fort",
    "idintelligence_group": 3,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 45,
    "name": "The Advance Order",
    "editor_name": "0033.骑士评议会-先遣骑士团",
    "manifest_content": "When the Union of Knight States needs to intervene in a region quickly, it will deploy an elite force called the \"Advance Order\", which possesses strong combat and guerrilla capabilities. The knights of the Advance Order are capable of determining the outcome of a medium-sized battle in the field, but they are even more adept at destroying supply lines through sabotage, ambushes, and raids, thereby achieving greater military success.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 46,
    "name": "Waverun Legion",
    "editor_name": "0034.伊利亚王国-自由军",
    "manifest_content": "It is an army organized by the new aristocrats and merchants of Waverun City, with the aim of overthrowing the rule of the Kingdom of Iria. Members of the Waverun Legion are mostly people dissatisfied with the government and victims of the agent organization of \"the Hanged Men\", as well as some opportunistic individuals and conscripts.\nDue to its diverse membership, lack of training, and inadequate equipment, the Waverun Legion's attack is significantly lower than that of the King's Army. However, they are skilled at using the tactic of overwhelming numbers and various tricks to destroy the King's Army's defenses. Additionally, they can rapidly expand their military success with the leadership of a few elites.",
    "bg_texture": "event_war",
    "idintelligence_group": 5,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 47,
    "name": "Gloria",
    "editor_name": "0035.骑士评议会-歌洛莉亚",
    "manifest_content": "She is the Special Knight from the Advance Order of the Union of Knight States. \nShe is a noble and beautiful knight, known for her integrity, strength, and compassion. \nShe has a strong commitment to justice and vows to destroy all evil and punish all wrongdoings and injustice. \nAlthough she is a member of the Advance Order, she seems to have significant autonomy, \nand her goals may differ from those of other knights.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 48,
    "name": "Battles at the West of the Crossroads",
    "editor_name": "0036.事件-十字路口西端的战斗",
    "manifest_content": "Due to the destruction of its supply lines, the King's Army, who planed to suppress the rebellion within three months, was completely failed. After paying a series of costs, the King's Army successfully retreated to the east of the Crossroads Keep. As a large area of land to the west was occupied by the Waverun Legion, both parties were temporarily deadlocked with the Crossroad Keep as the boundary. The leader of the Waverun Legion publicly announced their intention to attack the Crossroad Keep, and the Waverun Legion was indeed making preparations.",
    "bg_texture": "event_news",
    "idintelligence_group": 4,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 51,
    "name": "The Papal States of Rodinia and the Union of Knight States",
    "editor_name": "0039.百科-教皇国与骑士团",
    "manifest_content": "In the Radiant War I, the Order believing in the Light of Sanctuary played a crucial role in establishing the Papal States of Rodinia. However, to restrict the power of the newly established states of the Order, the Papal States of Rodinia began to incite wars between the Knights' States. After multiple Knight States were destroyed and countless knights, including one of the four Knight Kings, died in the wars, the knights finally sat down to negotiate and established the Union of Knight States. \nAfter the Radiant War II, as the Papal States of Rodinia with a Pyrrhic victory was unable to control the Union, the latter successfully gained independence. Over the next few decades, due to geographical, trade, and religious differences, the relationship between the two parties worsened, and now they are on the brink of conflict.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 3,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 52,
    "name": "Mixed Bag",
    "editor_name": "0040.其他-鱼龙混杂",
    "manifest_content": "As the war intensifies, the situation in Iria is deteriorating rapidly. At this time, the Town of Convallaria, as a rare haven of peace, has attracted many people with different purposes, including refugees, merchants, and intelligence personnel from various factions. Fortunately, it seems that no one intends to disrupt the town, and instead, they are happy to have a relatively stable place to gather intelligence.",
    "bg_texture": "event_vendor",
    "idintelligence_group": 9,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 9
  },
  {
    "id": 53,
    "name": "Safiyyah",
    "editor_name": "0041.伊利亚王国-索菲亚",
    "manifest_content": "She is the supreme commander of the \"Hanged Men\", an agent organization of the Kingdom of Iria. \nShe is elegant, cold-hearted, and deadly. \nWith unknown background and resume, she seems more like a machine that is determined to uphold the will of the Iria than a person. \nShe never compromises, never gives up, and never shows mercy.",
    "bg_texture": "event_fort",
    "idintelligence_group": 5,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 54,
    "name": "The Hanged Men",
    "editor_name": "0042.伊利亚王国-倒吊人",
    "manifest_content": "It is a secret police force of the Kingdom of Iria created by Prince Dantalion, which uses illegal means to handle difficult problems for the kingdom. Many people hold hostility towards it and call it the \"Bat\" for its terrible image showed over the years.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 55,
    "name": "Beloved Princess",
    "editor_name": "0043.伊利亚王国-受人爱戴的三王女",
    "manifest_content": "Among the three heirs of Iria, the most beloved is Princess Inanna. Although she lacks favorable political allies in the court, she often proposes moderate political programs that benefit the lower class, which has earned her a significant amount of support from the people at the grassroots level. Some of her programs may seem like wishful thinking, but they are not baseless claims. Perhaps what she lacks is just a powerful force that can help her implement her strategies.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 5,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 56,
    "name": "Oath of Knights",
    "editor_name": "0044.骑士评议会-骑士誓言",
    "manifest_content": "They are the pure and irrevocable oath made by knights in certain occasions. From then on, the knights will spare no effort to fulfill the oath with their life and honor until it is completed. Any doubts about the oath are considered an insult to all knights, and whoever abandons the oath midway will permanently lose the honor of being a knight.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 58,
    "name": "Confrontation of Two Hegemonies",
    "editor_name": "0046.百科-两个霸权的对抗",
    "manifest_content": "The tension between the Papal States of Rodinia and the Union of Knight States has lasted for a long time, dating back to the Radiant War I. After the Radiant War, in order to control the Knights' States, the Papal States of Rodinia has been inciting wars within the Order. After multiple Knights' States were destroyed and countless knights, including one of the four Knight Kings, died in the wars, the knights finally sat down to negotiate and established the current Union of the Knights’ States. \nAfter the Radiant War II, the Union, realizing the decline of the Papal States of Rodinia, resolutely sought political independence. Since then, the hidden conflicts between the two sides have never stopped. \nWith espionage, spying, and subversion, they reached their peak and started a proxy war on the land of Iria.",
    "bg_texture": "event_war",
    "idintelligence_group": 3,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 59,
    "name": "Auguste",
    "editor_name": "0047.骑士评议会-奥古斯特",
    "manifest_content": "He is the Leader of the Advance Order of the Union of Knight States. \nHe is a powerful knight who is serious, aloof, and high and mighty. \nOn the surface, he is just a military man who follows orders, but his broken and repaired greatsword and lost eye imply that he may have a different past. He is tasked to lead the entire Order to carry out a mission in Iria, but it seems that he has another purpose.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 60,
    "name": "Restoration Army",
    "editor_name": "0048.教皇国-护教军",
    "manifest_content": "Taking Lightgloam City as the base, the Papal States of Rodinia has bought a mass of mercenaries, civilians, and even bandits, as its army. The mercenary group consists of devout and capable local believers as the backbone of the army. They continuously carry out operations on the land of Iria, seeking to gain benefits for the Papal States of Rodinia. This is also a common tactic used by the Papal States of Rodinia. They rarely send troops to intervene directly, but instead send Radiant Servant to organize local mercenaries on the spot. The strength of the mercenary group is stronger than that of the Waverun Legion, but its personnel composition is more complicated, leading to a huge disparity in combat effectiveness among different mercenary units.",
    "bg_texture": "event_news",
    "idintelligence_group": 7,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 7
  },
  {
    "id": 61,
    "name": "Iria's Government Factions",
    "editor_name": "0049.伊利亚王国-伊利亚的政府派系",
    "manifest_content": "Iria is mainly controlled by three factions: Irian aristocrats, merchants, and the military.\nIrian aristocrats refer to the pre-revolutionary nobles. In order to avoid further conflicts, the old King Faris retained these nobles in the government when the new country was formed. Due to historical reasons, they generally have a pro-Papal States of Rodinia stance and are most dissatisfied with the policies of Prince Dantalion.\nMerchants are the new aristocrats who have risen with the emergence of Luxite trade. They are the main supporters of the doves, advocating for openness and opposing any form of war.\nThe military is the faction consisting of the old King Faris's loyalists and currently the most supportive of Prince Dantalion's unifying actions.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 62,
    "name": "Fall of the Knights",
    "editor_name": "0050.骑士评议会-骑士们的堕落",
    "manifest_content": "Like that in any other country, the prolonged peace after the Radiant War II, along with the rise of the Union of Knight States, has made the knights more arrogant, stubborn, and out of touch with reality. Many knights only pay lip service to the virtues they uphold, and they value dueling over practical combat. They also tend to look down on other countries. Also, the accumulation of wealth has led the knights to pursue a luxurious and decadent noble lifestyle, with increasingly frequent banquets, more armors that look more like works of art, and an endless pursuit of art collections. Even the title of Paladin, the highest honor, has become a gift that can be given away.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 63,
    "name": "Gloria and Auguste",
    "editor_name": "0051.骑士评议会-歌洛莉亚与奥古斯特",
    "manifest_content": "Recently, a rumor is spreading within the Order that the Advance Order did not originally include Gloria. \nShe appeared in Iria out of indignation towards the massacre in Waverun City and her pursuit of justice. For this reason, she forcibly joined the Advance Order, seeking the truth behind the tragic event. \nBut what about Leader Auguste? Is he really trying to bring peace to Iria as he claims?",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 6,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 65,
    "name": "Iria Bridge",
    "editor_name": "0052.百科-伊利亚大桥",
    "manifest_content": "The Iria River flows from east to west through Iria and is the main source of agricultural and domestic water in Iria. However, the turbulent Iria River also divides Iria into north and south, causing transportation inconvenience. To solve this problem, the people of Iria have been trying to build various bridges over the Iria River for hundreds of years. The most frequently used bridge was built during the period of the Republic of Iria. \nIt seems that when the bridge was designed, the Iria River was taken into consideration as a strategic barrier, for only a few troops can complete the blockade and cut off the way to the Mornrays Castle.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 22,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 66,
    "name": "Luxite",
    "editor_name": "0053.百科-晶石",
    "manifest_content": "Luxite is a mysterious mineral that contains powerful energy and typically exists in crystal form. Each Luxite contains the energy of different intensities and properties. Currently, the development of Luxite usage mainly focuses on using mental power to stimulate the energy within the Luxite, releasing various Luxite Blessings. Luxite can also stimulate human potential. Furthermore, Luxite also have various industrial, material, and weapon applications. With many unclear functions, Luxite has become a strategic resource that is being fought over worldwide.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 3,
    "group_priority": 21,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 67,
    "name": "Teadon",
    "editor_name": "0054.骑士团评议会-泰登",
    "manifest_content": "He is a retired knight of the Union of Knight States and the adjutant of Gloria's division of the Advance Order. The Teadon family has been serving the Roland Family for generations. Teadon and Gloria's father have known each other since they were young. After Gloria's father passed away, Teadon took care of her and raised her for his close friend. Teadon is kind and dignified, and compared to Gloria's strictness, Teadon's approach is more diplomatic. He often assists Gloria in handling difficult affairs.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 68,
    "name": "Xavier",
    "editor_name": "0055.伊利亚王国-泽维尔",
    "manifest_content": "Xavier is a young commander in the King's Army of Iria. Coming from a poor background, he caught the eye of Marshal Magnus with his outstanding performance and proactive attitude after joining the army, and then was given an important position. Xavier idolizes Prince Dantalion and sees him as the last hope of the Kingdom of Iria. In his mind, Dantalion is someone worth following for his entire life.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 69,
    "name": "Aid Work of the Order",
    "editor_name": "0056.骑士团评议会-骑士团的援助工作",
    "manifest_content": "The Order has been providing various forms of aid work in Iria. At first, the knights from the Council of Knights mobilized a large amount of supplies, providing necessary food and daily necessities for the refugees in Iria. But gradually, there were rumors claiming that these knights always demanded that the refugees \"cooperate with their propaganda work\", as a result of which, many journalists who came to the war zone wrote some articles criticizing the Kingdom of Iria.",
    "bg_texture": "event_news",
    "idintelligence_group": 5,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 70,
    "name": "Magnus",
    "editor_name": "0057.伊利亚王国-马格努斯",
    "manifest_content": "He is a calm and hard-line solider who acts swiftly and decisively. Over his 30-year military career, Magnus honed his excellent military skills and made great contributions during the Iria's War of Independence. After the Kingdom of Iria gained independence, Magnus became the supreme commander of the King's Army, enjoying great popularity among the people. Magnus is a loyal follower and defender of King Faris. After King Faris retired, Magnus became the representative of King Faris' will, holding military power and observing the situation. He currently supports Prince Dantalion as an important pillar.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 14,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 71,
    "name": "Waverun City Incident",
    "editor_name": "人文-0001-浪涌城事件",
    "manifest_content": "On the Sanctuary Day of the year 999 of the Radiant Calendar, a riot happened in Waverun City, a seaport of Iria. Rioters burned, killed, and pillaged while shouting the slogan of overthrowing the royal family, and finally initiated a bloody conflict with the King's Army. Many innocent civilians were involved.",
    "bg_texture": "event_ruins",
    "idintelligence_group": 10,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 72,
    "name": "Kingdom of Iria",
    "editor_name": "势力-0001-伊利亚王国",
    "manifest_content": "The Kingdom of Iria is a small kingdom with a long history coveted by the great powers because of its rich Luxite resources. Currently, its actual ruler is the eldest son of King Faris, Prince Dantalion.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 11,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 73,
    "name": "The Town of Convallaria",
    "editor_name": "地理-0001-铃兰小镇",
    "manifest_content": "It is a small town located in the central part of the Kingdom of Iria and named after the blooming convallaria. The Town of Convallaria, adjacent to the Crossroads, is the main foothold for caravans. However, as the situation in Iria has gradually become unstable with rampant banditry and hindered trade, the Town of Convallaria has also become increasingly sluggish. The Sword of Convallaria Mercenary Group is stationed here to protect the town in turbulent days.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 12,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 74,
    "name": "Sword of Convallaria Mercenary Group",
    "editor_name": "势力-0002-铃兰之剑佣兵团",
    "manifest_content": "It is a mercenary group established by Rawiyah a few years ago and named after the \"Sword of Convallaria\". Its members are mainly residents of the town because they must protect their homeland on their own in this increasingly chaotic situation. The Sword of Convallaria Mercenary Group completes quests like real mercenaries when they have the time, gradually gaining a considerable reputation in nearby villages and towns.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 11,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 75,
    "name": "Training Ground",
    "editor_name": "教学-0002-训练场",
    "manifest_content": "It is a place for the mercenaries of the Sword of Convallariato train and improve themselves. Mercenaries can practice with others to gain some battle experience or make breakthroughs and learn new tactics here. In case of obtaining special programs, you can assign targeted tailored training to mercenaries. In any case, it is a place for the finest mercenaries to surpass themselves and become stronger.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 77,
    "name": "Haven",
    "editor_name": "教学-0001-佣兵之家",
    "manifest_content": "It is a warm and comfortable house for mercenaries who have been fighting for days to rest and refresh. There is no doubt that further decoration can make the living environment more comfortable and naturally improve the rest for mercenaries. Even weapons need to be maintained and repaired, not to mention the mercenaries.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 78,
    "name": "Tavern",
    "editor_name": "教学-0003-旅店",
    "manifest_content": "The hotel in the small town is open to guests all day, where you can meet many hidden masters. Many mercenaries would wait for bosses of true wit and sign a contract while they are pleasantly tipsy, which is a mysterious and inevitable fate.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 79,
    "name": "Papal States",
    "editor_name": "势力-0003-罗迪尼亚法皇国",
    "manifest_content": "The Papal States of Rodinia is one of the oldest political forces on the continent and a theocracy believing in the Light of Sanctuary. It is composed of Radiant City under the jurisdiction of the Hierophant and surrounding states loyal to him.\nThe \"Light of Sanctuary\", the largest religion on the continent, has had countless devout followers all over the world for the past thousand years. Many countries regard the Light of Sanctuary as their national religion, and the Papal States is their metropolitan state, making it the most powerful country in millennia.",
    "bg_texture": "event_papal",
    "idintelligence_group": 11,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 80,
    "name": "Forge",
    "editor_name": "教学-0004-铁匠铺",
    "manifest_content": "It is the forge in the Town of Convallaria, where you can place orders for forging weapons and trinkets Blacksmiths can forge general or customized gear per the design blueprint Witness the sparks by the collision between the burning furnace and the blueprint here!",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 81,
    "name": "Vlderians",
    "editor_name": "人文-0002-薇尔德人",
    "manifest_content": "They are an ancient race inhabiting the Vltar Mountain. The Vlderians have some canine appearance characteristics and are brave warriors regardless of gender, especially on mountainous battlefields. Female Vlderians are renowned for their ability to sing and dance, and the Clan Leader of Vlderians is usually a woman.",
    "bg_texture": "event_vilder",
    "idintelligence_group": 10,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 82,
    "name": "Sorceress",
    "editor_name": "人文-0003-魔女",
    "manifest_content": "Sorceresses are considered by the Papal States to be \"women who are bewitched by chaos and spread heretical evil in the world\", so they are often hunted down with a reward. It is said that they are extremely evil and possess terrifying power. Another rumor has it that sorceresses study Luxite in secret but are stigmatized because they threaten the monopoly of the Papal States on Luxite research.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 10,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 83,
    "name": "Luxite",
    "editor_name": "人文-0004-晶石",
    "manifest_content": "It is a mysterious mineral containing great energy, usually in the form of crystals. More than ten years ago, the Luxite lobes were first discovered underground in Radiant City after an earthquake. The Hierophant immediately declared that Luxite was a gift from the light and put the mining and research of Luxite under the management of the Light of Sanctuary by force. Each Luxite contains the energy of different intensities and properties. In addition to specific physical means, some people with strong spiritual power can also activate Luxite and release the energy by using spiritual wave resonance. Moreover, Luxite energy has various magical effects on living organisms and matter, making it one of the strategic resources in the world. At present, almost all known Luxite lobes are controlled by the Papal States, but those discovered in Iria have broken the monopoly of the Papal States.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 10,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 84,
    "name": "Luxite Workshop",
    "editor_name": "教学-0005-晶石工坊",
    "manifest_content": "Its full name is \"Luxite Workshop of Gifted Beryl\", which is filled with unnamed experimental materials. Beryl specializes in refining various strange and mysterious experimental products from Luxite that may have magical effects on the battlefield. If you want some of these, Beryl will ask you to do the chores or use these experimental products more often to inspire her for new inventions.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 85,
    "name": "The Union",
    "editor_name": "势力-0004-骑士同盟",
    "manifest_content": "Its full name is \"the Union of the Knights' States\", which is a national alliance composed of 13 Knight State with great military power. It handles major political affairs of the alliance through an evaluation and consultation system.\nIn consideration of geographical politics, as well as the desire to obtain Luxite, the Union has been actively engaged in trade with Iria and has a strong influence there, especially in Waverun City.",
    "bg_texture": "event_knights",
    "idintelligence_group": 11,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 86,
    "name": "The Advance Order",
    "editor_name": "势力-0005-先遣骑士团",
    "manifest_content": "It is the advance troop sent by the Union to Iria, which is led by Auguste, a knight in the Council of Knights, and composed of elites from the various Knights' States. After the war began, the Advance Order quickly arrived and stationed in Waverun City, and took control of the vast area nearby. The well-equipped and well-trained knights are enough to influence the fate of a small country.",
    "bg_texture": "event_knights",
    "idintelligence_group": 11,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 87,
    "name": "Paladin",
    "editor_name": "人文-0005-圣骑士",
    "manifest_content": "After a series of strict examinations, assessments, and tests within the Union, select elite knights with a noble virtue are awarded the title of \"Paladin.\" Paladins are regarded as the model of knighthood and perfect chivalry.\nHowever, as the Union has grown increasingly stronger and prosperous, many knights began to overindulge in pleasure. The spirit of knighthood itself has become a point of contention. Even the lofty title of \"Paladin\" has lost much of its weight.",
    "bg_texture": "event_knights",
    "idintelligence_group": 10,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 88,
    "name": "Light of Sanctuary",
    "editor_name": "人文-0006-庇护之光",
    "manifest_content": "The Light of Sanctuary is the largest religion in Rodinia, with countless devout followers and supreme glory for thousands of years. Followers of the Light of Sanctuary believe in the light and uphold the doctrine of protecting the world with the light. As the sole spokesperson of the belief, the Hierophant is the leader of all states believing in the Light of Sanctuary.\nDue to the subsequent impact of the previous Radiant War, the Papal States has lost most of his power, though he remains the most influential figure in the world. In this situation, followers of the Light of Sanctuary have gradually thought differently about the future.",
    "bg_texture": "event_papal",
    "idintelligence_group": 10,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 89,
    "name": "Vlderian Dancer",
    "editor_name": "人文-0007-薇尔德舞娘",
    "manifest_content": "They are dancers from Vlder who often appear outside Vlder in the form of professional dance regiment. Their dance is gentle, relaxed, and graceful. The slow moves are calm as water flows, and the fast paces are swift as the fierce wind. The Irians love it, but few people know that the dance is not just a show but a battle tactic of the Vlderians.\nIn addition, the Vlderians are oppressed in Iria and Elaman, and some local aristocrats even can buy Vlder dancers at high prices from slave traders to perform for them.",
    "bg_texture": "event_vilder",
    "idintelligence_group": 10,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 90,
    "name": "Iria Bridge",
    "editor_name": "地理-0002-伊利亚大桥",
    "manifest_content": "The Iria River flows from east to west through Iria and is the main source of agricultural and domestic water in Iria. However, the turbulent Iria River also divides Iria into north and south, causing transportation inconvenience. The Iria Bridge was established to connect the north and south. A few troops can block the road from the south bank to Mornrays Castle, the only way to cross the river.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 12,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 91,
    "name": "Darklight",
    "editor_name": "势力-0006-黑暗之光",
    "manifest_content": "It is a cult organization entrenched in the Mine Pit. Believers of Darklight hate everything in the world. They believe that they have been assigned a mission to let darkness devour everything in the world and usher in the pure salvation light. To complete this mission, they will do anything without hesitating to sacrifice their lives. As the situation in Iria was getting worse, more and more people who were desperate for life were tempted to join Darklight, so it grew rapidly and spread outward like a plague.",
    "bg_texture": "event_darklight",
    "idintelligence_group": 11,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 92,
    "name": "Mine Pit",
    "editor_name": "地理-0003-矿坑城",
    "manifest_content": "It is a vast slum centered around the low-quality Luxite mines located to the south of the Iria River on the Central Tableland. Since the state period, countless peasants have been forced to gather in this area for mining and related industries to make a living. Over the years, the Mine Pit has become a massive slum. The area is a mix of different groups, sheltering a great many refugees and homeless peoples. The headquarters of Darklight is located in the complex network of mines and slums in the Mine Pit.",
    "bg_texture": "event_minecity",
    "idintelligence_group": 12,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 93,
    "name": "The Hanged Men",
    "editor_name": "势力-0007-倒吊人",
    "manifest_content": "It is a secret police force of the Kingdom of Iria called the Hanged Men whose highest commander is Safiyyah. It is created by Prince Dantalion, which uses illegal means to handle difficult problems for the kingdom. Many people hold hostility towards it and call it the \"Bat\" for its terrible image showed over the years.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 11,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 94,
    "name": "Waverun Legion",
    "editor_name": "势力-0008-浪涌军",
    "manifest_content": "It is a paramilitary organization established under the covert support of the Union after the Waverun City incident. It is mostly composed of opportunists and rioters who take advantage of prevailing chaos as well as the rebellious King's Army. The Waverun Legion denounces Dantalion's corrupt and brutal rule while pursuing their so-called \"justice and freedom\" by looting, burning, and killing.",
    "bg_texture": "event_port",
    "idintelligence_group": 11,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 95,
    "name": "Convallaria Festival",
    "editor_name": "人文-0008-铃兰节",
    "manifest_content": "It is an annual major festival in the Town of Convallaria. During the blooming season of convallaria, local residents will prepare abundant food to entertain guests. On the day of the Convallaria Festival, people will make small cookies with a convellaria pattern to share with others. Convallaria symbolizes happiness and hope. People believe that those having convallaria cookies on this day will be blessed with long-lasting good luck and happiness. (Maitha: There is no convallaria in convallaria cookies!)",
    "bg_texture": "event_citylive",
    "idintelligence_group": 10,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 96,
    "name": "Crossroads Keep",
    "editor_name": "地理-0004-十字路要塞",
    "manifest_content": "The Crossroads Keep is an important military fortress in Iria. It is located at the crossroads of two significant trade routes in the kingdom and has long been garrisoned by elite troops of the King's Army. It controls Iria's significant trade routes, logistical supplies, and the Iria Bridge. The materials stocked up in the Crossroads Keep are enough to keep the defenders under siege alive for several years. Besides, it is also the absolute barrier of the Mornrays Castle to prevent Iria from invasion by any force.",
    "bg_texture": "event_fort",
    "idintelligence_group": 12,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 97,
    "name": "Spear of Iria",
    "editor_name": "势力-0009-先锋营",
    "manifest_content": "It is a battalion composed of elite warriors within the King's Army and led by General Xavier. Most of the soldiers are radical Irian patriots who have made a pledge to fight fiercely for Iria until death. The Spear of Iria is superior to the ordinary King's Army in combat will and training level.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 11,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 98,
    "name": "The Judge",
    "editor_name": "势力-0010-审判者",
    "manifest_content": "It is a special organization directly under the Hierophant. The members have mysterious identities. Only devout believers who have accepted and passed special ceremonies are eligible to become a member of the Judge. The Judge, as the agent of the Hierophant, supervises the piety and purity of the Light of Sanctuary internally and punishes heretics and enemies who intimidate the Papal States externally.",
    "bg_texture": "event_papal",
    "idintelligence_group": 11,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 99,
    "name": "Mornrays Castle",
    "editor_name": "地理-0005-晨曦堡",
    "manifest_content": "The Mornrays Castle is the capital of the Kingdom of Iria built on the dangerous hilly area at the northern end of the Crossroads, formerly a large garrison built during the period of the State of Iria. The population of the Mornrays Castle is about 30,000, far less than that of Waverun City. The population of the Mornrays Castle is mainly composed of garrisons, powerful families, and civilians who serve the first two groups, so its function as a city is not complete. The Mornrays Castle is the political and military center of the Kingdom of Iria, with underdeveloped business, industry, and agriculture, heavily reliant on supplies transported by the Crossroads.",
    "bg_texture": "event_kingcity",
    "idintelligence_group": 12,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 100,
    "name": "Waverun City",
    "editor_name": "地理-0006-浪涌城",
    "manifest_content": "It is a seaport located on the west coast of Iria and at the estuary of the Iria River. It is also the wealthiest and most populous city in Iria. Waverun City is the foreign trading hub of Iria, connecting the Crossroads' transport line with the Union's marine trade route. It has developed rapidly due to the Luxite trade in recent ten years. Waverun City is a gathering place for merchants from various countries and holds a remarkable strategic position in the Union. In recent years, the Union has continuously expanded its influence in Waverun City by all means.",
    "bg_texture": "event_port",
    "idintelligence_group": 12,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 101,
    "name": "Elaman",
    "editor_name": "势力-0011-埃拉曼",
    "manifest_content": "Elaman is an ancient empire established by nomadic people. It conquered vast territories by force in history. Now, it has turned into a commerce-dominated empire. Elaman relies on soft diplomatic means and trade advantages to maneuver major powers and seize maximum benefits. Elaman's armed caravans travel throughout the world, and their merchants believe that everything, even real people, has value.",
    "bg_texture": "event_solomon",
    "idintelligence_group": 11,
    "group_priority": 11,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 102,
    "name": "Silver Wolf Mercenary Group",
    "editor_name": "势力-0012-银狼佣兵团",
    "manifest_content": "It is a mercenary group belonging to the Empire of Luccia, which was founded and directly led by Agata The Silverwolf. Most of its members are strong warriors honed from the icy wind of Luccia Tundra. The Silver Wolf Mercenary Group is favored by the commercial giant Elamanians due to its good military literacy and organizational discipline, so they have established a long-term and stable cooperative relationship.",
    "bg_texture": "event_war",
    "idintelligence_group": 11,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 103,
    "name": "Miguel Mercenary Group",
    "editor_name": "势力-0013-米格尔佣兵团",
    "manifest_content": "It is a mercenary group employed by the Papal States of Rodinia and directly led by Miguel. The predecessor of the Miguel Mercenary Group was a bandit group wandering in Rodinia. Under Miguel's efficient, ruthless, and flexible style of grasping the situation, the Miguel Mercenary Group has developed into a force that cannot be overlooked.",
    "bg_texture": "event_war",
    "idintelligence_group": 11,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 104,
    "name": "Members of Iria's Royal Family",
    "editor_name": "人文-0009-伊利亚王室成员",
    "manifest_content": "Iria's royal family is composed of the King of Iria and his relatives. The dominating figures are King Faris, Prince Dantalion, Prince Lutfi, and Princess Inanna.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 105,
    "name": "Grand Sanctuary",
    "editor_name": "人文-0010-国葬仪式",
    "manifest_content": "It is one of the supreme ceremonies in the Kingdom of Iria. It is the funeral for dominating figures of the royal family and meritorious individuals, which gathers attention from the Irians and the international community.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 106,
    "name": "Mutant",
    "editor_name": "人文-0011-魔人",
    "manifest_content": "They are actually humans attacked by Darklight, but they seem to be cursed because their wounds cannot heal. If they do not receive timely and sufficient treatment, they are highly likely to mutate into terrifying monsters like the walking dead.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 10,
    "group_priority": 11,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 107,
    "name": "Grand Sanctuary",
    "editor_name": "地理-0007-大庇护所",
    "manifest_content": "It is the Divine City in the Papal States of Rodinia. The Grand Sanctuary plays the role of preaching, studying, nurturing followers, and emergency care. Many homeless orphans have been adopted here.",
    "bg_texture": "event_papal",
    "idintelligence_group": 12,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 108,
    "name": "Luxite Firelock",
    "editor_name": "人文-0012-晶石火枪",
    "manifest_content": "It is the new weapon first presented by Lutfi at the peace negotiation. The Luxite firelock was invented by Menia, which uses Luxite energy to drive projectiles to shoot targets. The Menians have improved the utilization of Luxite energy with special techniques, allowing repeated firing of the Luxite device inside and thus ensuring long-term fighting for users simply by reloading. The Luxite firelock is a product that integrates advanced technologies, such as Luxite, casting, and assembly. Menia gave the Luxite firelock to Lutfi as a gift, which only had limited power for now, but Lutfi predicted that the world was about to endure a major change for the new weapon.",
    "bg_texture": "event_money",
    "idintelligence_group": 10,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 109,
    "name": "Bishop",
    "editor_name": "人文-0013-枢机卿",
    "manifest_content": "The Bishop is the senior manager of the Papal States. Responsible for undertaking the administrative duties and presiding over the Light of Sanctuary ceremony of the Papal States and various jurisdictions, the Bishop is appointed by the Hierophant. They have authority second only to that of the Hierophant themselves. The authority of the Bishop varies depending on the influence of the Hierophant in the local area. They have a decisive say in government management in those states that have been subordinate to the Papal States for years.",
    "bg_texture": "event_papal",
    "idintelligence_group": 10,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 110,
    "name": "State of Iria",
    "editor_name": "人文-0014-伊利亚邦国",
    "manifest_content": "After the Radiant War II, the Elaman Empire, which had ruled Iria for hundreds of years, was defeated. Iria was ceded as a vassal state to the Papal States of Rodinia, and set the Light of Sanctuary to oversee the state's religion. Later, under the uprising led by Faris, the rule of the State of Iria was overthrown, and the independent Kingdom of Iria was established.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 14,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 111,
    "name": "Old Aristocracies",
    "editor_name": "人文-0015-旧贵族",
    "manifest_content": "They are the privileged aristocratic group existing during the period of the State of Iria when most old aristocracies accumulated a great fortune through their privileges. They are protected by the Papal States. Since the independence of the Kingdom of Iria, the most authority of the old aristocracies was ceded to the Faris family. Even though the old aristocracies declared their support for the rule of the Faris family, they still attempted to restore the state and regain the power and position they owned back then.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 15,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 112,
    "name": "Mutant",
    "editor_name": "人文-0016-异变者",
    "manifest_content": "For an extended period of time, the Darklight has been secretly using Luxites to conduct outrageous human experiments in the Mine Pit. These experiments can lead to various mutations of the human body based on different stone types, research approaches, and subject characteristics. They have an extremely high failure rate, where Luxites in failed experiments invariably backfire on the subjects and cause miserable deaths. On the other hand, the survivors will merge with the stones and gain extraordinary powers. However, as the Luxite invades the flesh and central nervous system, the subject will ultimately lose all their senses, rationality, and linguistic capabilities, thus reduced to a living corpse.\nIn addition, creatures contaminated by the human experiments also undergo mutations. As their skeletal structure gradually dissolves from the exacerbating contamination, they will eventually devolve into mud-like monsters. People in the Mine Pit have named these mutant creatures \"Purupuru\" after the burbling noises they make when dragging their squishy torsos to move around. The ominous sound cautions against death drawing near.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 10,
    "group_priority": 16,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 113,
    "name": "Miguel's List",
    "editor_name": "人文-0017-米格尔的清单",
    "manifest_content": "A to-do list issued by the Papal States, secretly handed to a mercenary called Miguel. One could see the \"Radiant\" stamp signifying the authorities at the end of the list.\nIts content reveals what truly happened at the Waverun City Tragedy. Miguel was assigned the following tasks by the Papal States:\n1. Infiltrate the Union undercover and gain their trust.\n2. On the day of the Princess' speech, help the Union incite a riot in Waverun City by blending in with and instigating the civilians.\n3. Ensure the Princess dies in the riot to start an armed conflict between the civilians and the King's Army. Escalate the situation beyond the control of the Union and the King's Army to engage the two parties off guard in a battle that wears them out.\n4. Gather evidence that the Union is behind the Waverun City Tragedy, which the Papal States may leverage to overthrow the Union and gain control over Iria.",
    "bg_texture": "event_letter",
    "idintelligence_group": 10,
    "group_priority": 17,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 114,
    "name": "Rawiyah's Diary",
    "editor_name": "人文-0018-拉维耶的日记",
    "manifest_content": "You received the diary from Miguel, its cover still stained with Rawiyah's blood. Rawiyah recorded her investigation in Waverun City in bits and pieces:\n\n\"According to the informant, the Hanged Men had already made preparation for full-scale battle prior to the Waverun City Tragedy. Had Dantalion known what was coming? I need more evidence to prove my speculation.\"\n\n\"After following several mercenaries who instigated the crowd on the day of the incident, I've become certain that they all had something to do with the Union. If only I could find solid evidence of the Union's involvement in the Tragedy... Perhaps the truth will come out.\"\n\n\"It was the Union that incited the riot in Waverun City! Who'd have thought they'd resort to such despicable means? The people must know!\"\n\n\"That figure... It rings a bell... Could it be...\"",
    "bg_texture": "event_letter",
    "idintelligence_group": 10,
    "group_priority": 18,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 115,
    "name": "Lightgloam City",
    "editor_name": "地理-0008-暮光城",
    "manifest_content": "Located in the south of Iria, Lightgloam City was once the capital of the State of Iria. During the Irian Civil War, the Papal States occupied Lightgloam City under the excuse of supporting the royal descendants and later sent Bishops to rule the city. Since then, Lightgloam City has become the political center of the Papal States in Iria.",
    "bg_texture": "event_papal",
    "idintelligence_group": 12,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 116,
    "name": "Divine Punishment",
    "editor_name": "人文-0019-神罚",
    "manifest_content": "The Judge of the Papal States channels their distinct innate power to induce tremendous Luxite energy fluctuations that shatter the crystal. The resulting energy blast continuously assaults its surroundings with an appalling magnitude of destruction comparable to divine punishments delivered in heaven's wrath. The \"Divine Punishment\" is often used to execute the heinous sinners that desecrate the Radiant.",
    "bg_texture": "event_papal",
    "idintelligence_group": 10,
    "group_priority": 19,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 117,
    "name": "Crown of Convallaria",
    "editor_name": "人文-0020-铃兰花冠",
    "manifest_content": "The exquisite crown woven from May lilies and their vines appears more adorable with the little kitten sketched on the yawning vines. A celestial glow emanates from the Luxite at the center, lending a touch of serenity and holiness to the crown.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 10,
    "group_priority": 20,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 118,
    "name": "Convallaria Trading Post",
    "editor_name": "人文-0021-铃兰商会",
    "manifest_content": "Established in the Town of Convallaria, it's an organization that unites merchants from various industries. Its aim is to strengthen the guarantee of livelihood resources, promote production and commercial development, maintain trade order, and handle trade disputes.",
    "bg_texture": "event_money",
    "idintelligence_group": 10,
    "group_priority": 21,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 119,
    "name": "Fox and Squirrel Crystal Mining Syndicate",
    "editor_name": "人文-0022-狐与松鼠晶石采矿联合体",
    "manifest_content": "Known as \"Fox and Squirrel,\" it is a benefit alliance established through joint consultations by representatives from Mine Pit and Vlder. Its purpose is to allow the oppressed people of Mine Pit and Vlder to have their own Luxite production capabilities, join forces in market competition, and use the profits from the industry to nurture the construction of livelihood. Its office is set up in Convallaria Trading Post.",
    "bg_texture": "event_shakehands",
    "idintelligence_group": 10,
    "group_priority": 22,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 120,
    "name": "Uprising by Miners",
    "editor_name": "人文-0023-矿工起义",
    "manifest_content": "During the era of the State of Iria, a large-scale uprising movement initiated by Irian miners to resist the exploitation of the Papal States. However, during the uprising, a small number of traitors emerged within the labor group, allowing the Papal States to grasp the situation of the movement, leading to its eventual failure.",
    "bg_texture": "event_rebellion",
    "idintelligence_group": 10,
    "group_priority": 23,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 121,
    "name": "Rodinia Trade Organization",
    "editor_name": "人文-0024-罗迪尼亚贸易组织",
    "manifest_content": "An organization formed based on the \"Rodinia Trade Agreement\". It aims to mediate conflicts of interest between members through trade, stop wars, and coordinate trade relations between the signatories after the war.",
    "bg_texture": "event_trade",
    "idintelligence_group": 10,
    "group_priority": 24,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 122,
    "name": "Rabi'a Oasis",
    "editor_name": "地理-0009-拉比亚绿洲",
    "manifest_content": "The trade station in Iria closest to the territory of Elaman, where Elamanian merchants have a stronger influence than those from Iria. It's a mixed bag, but there are many business opportunities.",
    "bg_texture": "event_solomon",
    "idintelligence_group": 12,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 123,
    "name": "Great Sand Sea",
    "editor_name": "地理-0010-大沙海",
    "manifest_content": "The largest desert on Rodinia. Caravans entering and leaving the Rabi'a Oasis need to traverse this harsh environment. Strong winds prevail in the Great Sand Sea, often forming sandstorms, causing great trouble to passersby.",
    "bg_texture": "event_smalloasis",
    "idintelligence_group": 12,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 124,
    "name": "Great Hashah",
    "editor_name": "人文-0025-大哈沙",
    "manifest_content": "The emperor title of the Elaman Empire, the owner of everything within the territory of Elaman. After the new Great Hashah took the throne, through the \"National Merchant\" system, Elaman entered a new era of prosperity. It is rumored that he has a peculiar and unpredictable personality, often associated with water.",
    "bg_texture": "event_solomon",
    "idintelligence_group": 10,
    "group_priority": 25,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  }
]