[
  {
    "id": 4,
    "name": "沙漠中的秘宝",
    "editor_name": "沙漠宝藏",
    "manifest_content": "传言可能并不真实，但越来越多的证据让人无法忽视，不如去试试看？沙漠深处的宝藏，谁会不喜欢呢？",
    "bg_texture": "",
    "idintelligence_group": 1,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 1
  },
  {
    "id": 13,
    "name": "The Kingdom of Iria",
    "editor_name": "0001-百科-伊利亚王国",
    "manifest_content": "The Kingdom of Iria has a long history. Located on the western part of the continent, it borders several large countries to the south and to the east and is bounded by the sea on its northern and western sides. This makes Iria a valuable transportation hub, serving many destinations. Several years ago, the king fell ill and withdrew to convalesce. Since then, Prince Dantalion has been the acting ruler. Due to the discovery of large Luxite deposits, various other countries attempted to interfere with Iria's internal affairs, turning it into the center of a maelstrom.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 20,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 14,
    "name": "Iria's History",
    "editor_name": "0002.百科-伊利亚的历史",
    "manifest_content": "Iria's history is divided into three periods. Ancient Iria was once a prosperous kingdom ruled by a system called the \"Thirteen Sages\", however it was destroyed by the conquests of the Elaman Empire. After Radiant War II, Iria gained independence from the Elaman Empire and became a vassal state of the Papal States of Rodinia, known as the \"State of Iria\". After the discovery of rich Luxite deposits, the current King Faris overthrew the ruthless rulers of the State of Iria and established the present-day Kingdom of Iria.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 19,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 15,
    "name": "Rawiyah",
    "editor_name": "0003.百科-拉维耶",
    "manifest_content": "The Leader and Chief Instructor of the Mercenary Group in the town of Convallaria. She appears to be quite carefree with a deep passion for drinking. However, she is actually a very honorable and warm-hearted person. She is not a native of the town of Convallaria. Many years ago, she settled in the town and formed a mercenary group to protect it. She is beloved and supported by both the townspeople and the mercenaries alike. She is a powerful warrior skilled with various weapons and squad tactics. With a broad range of knowledge, she is no ordinary wanderer. However, she remains very tight-lipped about her past experiences.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 3,
    "group_priority": 18,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 16,
    "name": "The Town of Convallaria",
    "editor_name": "0004.百科-铃兰小镇",
    "manifest_content": "A crucial transportation hub of the kingdom. Located to the west of the Crossroads, the town was built upon flat land that served as a stop for caravans. With the development of trade, it gradually evolved and began to establish various amenities. Its name refers to the Convallaria flower, which blooms on the hill located south of the town. Over the years, it has attracted masses of traveling merchants, making it increasingly prosperous. However, after the king fell ill and Prince Dantalion took over the kingdom, the town saw its fortunes turn as Iria gradually lost its stability. Before the outbreak of the civil war, the town had a population of around a thousand, as well as its own mercenary group. Named the \"Sword of Convallaria,\" its members strive to defend their home from beasts and bandits.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 3,
    "group_priority": 17,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 17,
    "name": "The Hill of Convallaria",
    "editor_name": "0005.百科-铃兰之丘",
    "manifest_content": "A small hill to the south of the town that overlooks the entire area. It is covered with Convallaria, earning it the name of the \"Hill of Convallaria.\" As the hill provides a panoramic view of the surrounding area, people can see their loved ones departing or returning along the trade route. Thus, the townspeople have formed a tradition of \"praying for the safety of their loved ones on the Hill of Convallaria whenever they depart on a journey.\" There is also an abandoned sanctuary, the Light of Sanctuary, on the hill that has been unused for years.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 3,
    "group_priority": 16,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 18,
    "name": "Sword of Convallaria Mercenary Group",
    "editor_name": "0006.百科-铃兰之剑佣兵团",
    "manifest_content": "A mercenary group formed under the leadership of Rawiyah. The group was given the name \"Sword of Convallaria\" by the townspeople, grateful for the protection that Rawiyah and her group offers the town. \nIn earlier times, the trade route through the area was prosperous, and the passing caravan escorts ensured the security of the town. However, as the trade route gradually diminished and bandits proliferated, the defense of the town became an urgent concern. Therefore, the \"Sword of Convallaria\" became the single greatest element for the continued peace and stability of the town.",
    "bg_texture": "event_letter",
    "idintelligence_group": 3,
    "group_priority": 15,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 19,
    "name": "Waverun City",
    "editor_name": "0007.百科-港都",
    "manifest_content": "An important seaport located in the northwest of the Kingdom of Iria and at the estuary of the Iria River. Its maritime trade routes, which transport Luxite, have made it the realm's wealthiest city over the past decade. The Luxite trade has created scores of merchants, leading many to attain a higher social class. However, rising fortunes have also resulted in a significant wealth gap within society.",
    "bg_texture": "event_vendor",
    "idintelligence_group": 3,
    "group_priority": 14,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 20,
    "name": "The Waverun City Tragedy",
    "editor_name": "0008.事件-港都惨案",
    "manifest_content": "A riot that began at a parade in Waverun City and resulted in thousands of casualties, including women and children. This disaster became known throughout the world as the \"Waverun City Tragedy.\" Different parties held different views on the cause of the incident, usually blaming each other. The Papal States of Rodinia and the Union of Knight States were suspected to be involved, but there were also voices claiming that the King's Army staged the entire incident themselves. During the conflict, Princess Inanna, who had gone to mediate, was imprisoned and subjected to a cruel execution. However, there were also rumors claiming that the one who was sacrificed was actually a body double.",
    "bg_texture": "event_ruins",
    "idintelligence_group": 4,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 21,
    "name": "Sanctuary Day",
    "editor_name": "0009.百科-圣祈日",
    "manifest_content": "A traditional festival of the \"Light of Sanctuary\" which was brought to Iria during the reign of the Papal States of Rodinia. It has gone on to become the biggest festival celebration in Iria. During the festival, the townspeople take to the streets to sing and dance, while intricately decorated floats are paraded through the town. Many folk customs, snacks, and goods are only available during the festival itself. However, this year, due to the tense situation, the atmosphere of Sanctuary Day has become delicate and decidedly somber. ",
    "bg_texture": "event_portcity",
    "idintelligence_group": 3,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 22,
    "name": "Wave of Refugees",
    "editor_name": "0010.事件-难民潮",
    "manifest_content": "With the conflict escalating in scale, many civilians have become refugees fleeing their homes in search of safety. Most of them are now heading towards Mornrays Castle for refuge.",
    "bg_texture": "event_refugees",
    "idintelligence_group": 4,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 24,
    "name": "Faycal",
    "editor_name": "0012.伊利亚王国-法卡尔",
    "manifest_content": "A mercenary boy with a gloomy and stubborn temperament, he lacks a sense of security in himself. \nHe is an orphan who fled his home but has since received help from the townspeople and from Rawiyah. However, the experience of fleeing has left an indelible pain in his heart, making him full of mistrust towards people and unable to easily rely on others. He is willing to pay any price as long as he can survive and protect those he cares about. He has a somewhat difficult personality and is not very talkative.",
    "bg_texture": "event_letter",
    "idintelligence_group": 5,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 25,
    "name": "Maitha",
    "editor_name": "0013.伊利亚王国-麦莎",
    "manifest_content": "A kind and lively mercenary girl with a carefree and easygoing attitude. \nShe is an orphan who fled from another area but grew up healthily thanks to the kindness of the townspeople and Rawiyah. \nShe is optimistic, strong-willed, and never gives up. \nWith a strong sense of justice and compassion, she desires to protect her family, the town, and everyone around her.",
    "bg_texture": "event_letter",
    "idintelligence_group": 5,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 26,
    "name": "Outbreak of the Civil War",
    "editor_name": "0014.百科-内战的爆发",
    "manifest_content": "After the Waverun City tragedy in March of 999 in the Radiant Calendar, some merchants and nobles declared that they no longer recognized the legitimacy of the royal family of the Kingdom of Iria and formed the \"Waverun Legion\" with the intention of overthrowing the ruling authority. A few weeks after the Waverun City incident, the acting ruler of Iria, Prince Dantalion, delivered a public speech at the funeral of Princess Inanna. He stated that Iria's royal family would never compromise with the cruel rebels and would send troops to quell the rebellion. He vowed revenge for the Princess and all the victims of the incident. From that moment, the civil war in Iria fully broke out.",
    "bg_texture": "event_war",
    "idintelligence_group": 3,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 27,
    "name": "Conflicts in Iria",
    "editor_name": "0015.伊利亚王国-伊利亚的矛盾",
    "manifest_content": "Iria is home to different cultures, ethnicities, and races. Its long history has given birth to a multitude of conflicts based on these different backgrounds, classes, and cultures. In recent years, the main conflicts have focused on the distribution of Luxite resources and cultural clashes. The Luxite trade has generated a vast amount of wealth, creating new aristocrats and merchants. However, due to unequal distribution, the lives of the common people have not improved. In addition, there is also a significant conflict between the lower-class citizens who embrace the orthodox Light of Sanctuary and the believers of the Light of Protection brought in by the Luxite trade.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 5,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 28,
    "name": "Safe Zone Established by the Order",
    "editor_name": "0016.事件-骑士团建立安全区",
    "manifest_content": "Recently, the Union of Knight States, a mighty foreign force, intervened as a mediator in the situation in Iria. The Union dispatched the Advance Order to uphold the interests of the Council of Knights in Iria. The Council of Knights called for a ceasefire and established a non-combat zone in the north to protect the gathering refugees. A group of powerful knights also became active in Iria under the pretext of investigating the truth behind the Waverun City incident. The northern King's Army had to halt their effort to suppress the rebellion because the safe zone created a barrier that would not let them pass.",
    "bg_texture": "event_knights",
    "idintelligence_group": 4,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 29,
    "name": "Interference of the Papal States of Rodinia",
    "editor_name": "0017.事件-教皇国的干涉",
    "manifest_content": "Previously, Iria was a vassal state of the Papal States of Rodinia before gaining its autonomy. Faris, the current King of Iria, overthrew the \"State of Iria\" controlled by the Papal States of Rodinia and won independence for Iria. However, the Papal States of Rodinia has always held a grudge over this liberation and provided refuge for the former puppet royal family. Apparently, their current invasion of Lightgloam City is a retaliation against the Kingdom of Iria, and their retaliation is unlikely to end there.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 4,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 30,
    "name": "Counterattack of the King's Army",
    "editor_name": "0018.事件-政府军反攻",
    "manifest_content": "Under the leadership of Prince Dantalion, the King's Army is marching towards Waverun City from multiple directions. The hastily organized Waverun Legion seems to be no match for the King's Army, neither in morale nor in equipment. However, the long supply lines of the King's Army may be a vulnerability. If their supply is frequently disrupted, it may constitute a considerable setback.",
    "bg_texture": "event_war",
    "idintelligence_group": 4,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 31,
    "name": "King's Army in Trouble",
    "editor_name": "0019.事件-泥潭中的政府军",
    "manifest_content": "Due to the frequent and devastating attacks on their supply lines, the King's Army has run out of food and is now stuck in a quagmire. This was precisely the strategy of the Order. Some witnesses reported that the well-trained and powerful Advance Order broke through the camp and destroyed the entire supply station with ease. It appears that the Order have not been as \"neutral\" as they claimed, they have now semi-publicly intervened in the civil war. At the same time, the Restoration Army organized by the Papal States of Rodinia in Lightgloam City also poses a serious threat to the flank of the King's Army. The King's Army is in such disarray that it is unable to make any meaningful progress.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 4,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 32,
    "name": "Mercenary Guild",
    "editor_name": "0020.百科-佣兵行会",
    "manifest_content": "Its full name is the \"Council of Mercenary Groups Industrial Alliance,\" and it provides well-respected evaluation rankings for mercenary groups across all continents. Essentially, it functions as a platform for mercenary quests and operates by taking a commission. However, there are rumors that valuable information about various mercenary groups can be obtained from the Mercenary Guild by paying large sums of money, but these claims have been consistently denied. It has a strong intelligence-gathering arm, and even slightly prominent mercenary groups are invited to be evaluated, ranked, and included in the platform.",
    "bg_texture": "event_letter",
    "idintelligence_group": 3,
    "group_priority": 11,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 33,
    "name": "Crossroads",
    "editor_name": "0021.百科-十字路口",
    "manifest_content": "There are two important main roads in the Kingdom of Iria that run from north to south and from east to west respectively across the entire country. The intersection of these two roads in the central region of Iria is known as the \"Crossroads\" and it is a vital transportation hub. The first of the main roads connects the desert trade route leading to the Elaman Empire in the east and the port city of Waverun City in the west. The other road leads south through Lightgloam City to the Papal States of Rodinia and north to Mornrays Castle. The Crossroads also houses important military fortresses that ensure the smooth flow of the trade routes, and it has been a contested area during numerous regional conflicts in Iria.",
    "bg_texture": "event_fort",
    "idintelligence_group": 3,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 34,
    "name": "Union of Knight States",
    "editor_name": "0022.百科-骑士评议会",
    "manifest_content": "The history of the Union of Knight States can be traced back to Radiant War I, where the Order, who contributed greatly to the Papal States of Rodinia, formed many states on the occupied lands. These states eventually had a dispute with the Papal States of Rodinia after Radiant War II, leading to a complete separation and the formation of an independent political entity, which is now known as the Union of Knight States. In consideration of geographical politics, as well as the desire to obtain Luxite, the Council of Knights has been actively engaging in trade with Iria. As a result, many new aristocrats and merchants have benefited greatly. The Light of Protection is a new movement founded by the Union and based on the orthodox Light of Sanctuary.",
    "bg_texture": "event_knights",
    "idintelligence_group": 3,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 35,
    "name": "Papal States of Rodinia",
    "editor_name": "0023.百科-教皇国",
    "manifest_content": "The Papal States of Rodinia is one of the oldest political powers on the continent and is a vassal state based on the Light of Sanctuary. Through Radiant War I, the Papal States of Rodinia acquired vast territories and resources. Despite setbacks in Radiant War II and the subsequent independence of the Union of Knight States, the Papal States of Rodinia remains one of the foremost powers on the continent. The Papal States of Rodinia claims that it is the sole owner of all Luxite, leading to strained relations with Iria, which has a wealth of Luxite deposits. Previously, the Papal States of Rodinia resorted to puppet rule and then signed the Treaty of Iria to force Iria into ceding one-third of its territory, including the Luxite lodes.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 3,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 36,
    "name": "Lightgloam City",
    "editor_name": "0024.百科-旧都",
    "manifest_content": "Located in the southern region of Iria, Lightgloam City was the capital of the Papal States of Rodinia during its reign. It was largely destroyed during Iria's War of Independence. The trade route leading to the Papal States of Rodinia passes through this city, but due to trade sanctions imposed by the Papal States of Rodinia after Iria's independence, the trade route has become largely abandoned. Despite this, many pro-Papal States residents still reside in this city, making it a major hub for the Papal States's espionage activities against Iria.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 37,
    "name": "The Darklight",
    "editor_name": "0025.黑暗之光-黑暗之光",
    "manifest_content": "The Darklight is an extremist organization entrenched in Iria that uses devious tactics, such as manipulation, deception, and kidnapping, to expand its power. The organization advocates a twisted philosophy that \"only destruction can give birth to new life.\" In the past, the Darklight has faced severe crackdowns from Iria's royal family. However, due to the outbreak of the civil war, large groups of refugees were deceived into joining the organization, leading to unprecedented expansion and further plundering of resources.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 8,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 8
  },
  {
    "id": 38,
    "name": "Mine Pit",
    "editor_name": "0026.百科-矿坑市",
    "manifest_content": "A vast slum centered around the dilapidated Luxite mines located to the south of the Iria River on the Central Tableland. Since the statehood period, countless peasants have been forced to gather in this area for mining and related industries to make a living. Over the years, the Mine Pit has become a massive slum. The area is a mix of different groups, sheltering a great many refugees and homeless people. The headquarters of the Darklight is located in the complex network of mines and slums in the Mine Pit.",
    "bg_texture": "event_minecity",
    "idintelligence_group": 3,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 39,
    "name": "The Three Heirs",
    "editor_name": "0027.伊利亚王国-三位继承人",
    "manifest_content": "Iria's King Faris has three heirs: Prince Dantalion, Prince Lutfi, and Princess Inanna. Currently, the affairs of Iria are solely managed by Prince Dantalion. The secretive organization, the Hanged Men, is also under his control. However, his radical enforcement of centralized power has led to discontent among the moderates within the kingdom, as well as among the new aristocrats and merchants. By contrast, Prince Lutfi, as a representative of the new aristocrats and merchants, advocates for a more moderate, inclusive, and open Iria. Princess Inanna, although lacking any significant royal authority, is widely beloved by the people and has garnered support for her ascension to the throne among the common folk.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 5,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 40,
    "name": "Mornrays Castle",
    "editor_name": "0028.百科-王都",
    "manifest_content": "Mornrays Castle was formerly a large garrison fortress built during the State of Iria period. It is located at the northern end of the Crossroads on mountainous terrain where Vltar Mountain and the Central Tableland meet. Mornrays Castle has a population of around 30,000 people, much smaller than that of Waverun City. The population is mainly composed of garrisons, powerful families, and civilians who serve the former two groups, so it lacks some of the functions of a normal city. Mornrays Castle is the political and military center of the Kingdom of Iria, but with underdeveloped business, industry, and agriculture, it is heavily reliant on the supplies transported on the Crossroads.",
    "bg_texture": "event_fort",
    "idintelligence_group": 3,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 41,
    "name": "Expansion of the Darklight",
    "editor_name": "0029.黑暗之光-黑暗之光的扩张",
    "manifest_content": "Recent intelligence reports that the Darklight is rapidly expanding at a terrifying pace. This is because the King's Army is preoccupied with the front lines and has little time to focus on local governance, allowing the Darklight to gain access to a large amount of land and resources. Furthermore, a large number of homeless and desperate refugees have fallen under the influence of the Darklight, becoming a continuous source of troops for the organization. If not contained, the Darklight will inevitably pose a threat to the town sooner or later.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 8,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 8
  },
  {
    "id": 42,
    "name": "Prince Lutfi",
    "editor_name": "0030.伊利亚王国-二皇子鲁特菲",
    "manifest_content": "The second prince of the Kingdom of Iria, known for being approachable and down-to-earth. Prince Lutfi often disguises himself and mingles with people from all walks of life. He has a remarkable eloquence and unique vision for the future of Iria, which he strives to achieve. He greatly admires the capabilities and aspirations of the Mercenary Group and often provides assistance to it. Furthermore, he also seems to have a thing for Convallaria.",
    "bg_texture": "event_news",
    "idintelligence_group": 5,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 43,
    "name": "Long-Term Mercenary Contract",
    "editor_name": "0031.其他-佣兵长期契约",
    "manifest_content": "A mercenary group can sign long-term contracts with political entities, organizations or individuals, transforming their simple employment relationship into a more enduring one. Although a mercenary group cannot \"join\" a faction through a long-term contract, the issuing of such a contract is itself an expression of trust towards the mercenary group by the faction. These long-term contracts can be terminated at any time, but the party initiating the termination will bear a penalty fee and face the anger of betrayal from the other party.",
    "bg_texture": "event_letter",
    "idintelligence_group": 9,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 9
  },
  {
    "id": 44,
    "name": "Crossroads Keep",
    "editor_name": "0032.百科-十字路口堡",
    "manifest_content": "Crossroads Keep is one of the three major fortresses in Iria. It is an important military stronghold on par with Mornrays Castle and the former capital, Lightgloam City before its destruction. It has long been garrisoned by the elite troops of the King's Army. It oversees two major trade routes as well as the Iria River. As such, Crossroads Keep has a continuous supply of water and is sufficiently stockpiled with supplies to allow defenders to resist a siege for several years. In addition, it is strategically positioned to complement the defenses of Mornrays Castle, supporting each other to fend off threats. Any hastily planned attack on Crossroads Keep would be futile.",
    "bg_texture": "event_fort",
    "idintelligence_group": 3,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 45,
    "name": "The Advance Order",
    "editor_name": "0033.骑士评议会-先遣骑士团",
    "manifest_content": "When the Union of Knight States needs to intervene in a region quickly, it will deploy an elite force called the \"Advance Order,\" which possesses strong combat and guerrilla capabilities. The knights of the Advance Order are capable of determining the outcome of a medium-sized battle in the field, but they are even more adept at destroying supply lines through sabotage, ambushes, and raids, thereby achieving greater military success.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 46,
    "name": "Waverun Legion",
    "editor_name": "0034.伊利亚王国-自由军",
    "manifest_content": "An army organized by the new aristocrats and merchants of Waverun City, with the aim of overthrowing the rulers of the Kingdom of Iria. Members of the Waverun Legion are mostly people dissatisfied with the royal family of Iria and victims of the secretive organization \"the Hanged Men,\" as well as some opportunistic individuals and conscripts. Due to its diverse membership, lack of training, and inadequate equipment, the Waverun Legion's raw military power is significantly lower than that of the King's Army. However, they are skilled at the tactic of using overwhelming numbers and cunning tricks to destroy the King's Army's defenses. Additionally, they could rapidly expand their military successes with the leadership of a few elite warriors.",
    "bg_texture": "event_war",
    "idintelligence_group": 5,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 47,
    "name": "Gloria",
    "editor_name": "0035.骑士评议会-歌洛莉亚",
    "manifest_content": "A Special Knight within the Advance Order of the Union of Knight States. Gloria is a noble and beautiful knight, known for her integrity, strength, and compassion. She has a strong commitment to fairness and vows to destroy all evil and punish all wrongdoings and injustices. Although she is a member of the Advance Order, she seems to have significant autonomy, and her goals may differ from those of other knights.\n",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 48,
    "name": "Battles at the West of the Crossroads",
    "editor_name": "0036.事件-十字路口西端的战斗",
    "manifest_content": "Due to the destruction of its supply lines, the King's Army, who planned to suppress the rebellion within three months, was completely foiled. After paying a series of increasing costs, the King's Army successfully retreated to the east of Crossroads Keep. As the large area of land to the west was already occupied by the Waverun Legion, both parties were temporarily deadlocked with Crossroads Keep between them. The leader of the Waverun Legion publicly announced their intention to attack Crossroads Keep, and the preparations for an assault began.",
    "bg_texture": "event_news",
    "idintelligence_group": 4,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 4
  },
  {
    "id": 51,
    "name": "The Papal States of Rodinia and the Union of Knight States",
    "editor_name": "0039.百科-教皇国与骑士团",
    "manifest_content": "In Radiant War I, the Order played a crucial role in assisting the Papal States of Rodinia. However, in response to the growing power of the newly established states founded by the Order, the Papal States of Rodinia began to incite wars between the Knights' States. Multiple Knight States were destroyed and countless knights, including one of the four Knight Kings, died in these wars. This prompted the knights to assemble and formally establish the Union of Knight States. After Radiant War II, the Papal States of Rodinia had secured only a Pyrrhic victory and was unable to control the Union, the latter successfully gained independence. Over the next few decades, due to geographical, trade, and cultural differences, the relationship between the two parties worsened, and now they are on the brink of open conflict.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 3,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 52,
    "name": "A Mixed Bag",
    "editor_name": "0040.其他-鱼龙混杂",
    "manifest_content": "As the war intensifies, the situation in Iria is deteriorating rapidly. At this time, the Town of Convallaria, as a rare haven of peace, has attracted many people with different purposes, including refugees, merchants, and intelligence personnel from various factions. Fortunately, it seems that no one intends to disrupt the town, and instead, they are happy to have a relatively stable place to gather intelligence.",
    "bg_texture": "event_vendor",
    "idintelligence_group": 9,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 9
  },
  {
    "id": 53,
    "name": "Safiyyah",
    "editor_name": "0041.伊利亚王国-索菲亚",
    "manifest_content": "The supreme commander of the \"Hanged Men,\" a secretive organization within the Kingdom of Iria. Safiyyah is elegant, cold-hearted, and deadly. With an unknown background and a blank resume, she seems more like a machine determined to uphold the will of the kingdom than an actual person. She never compromises, never gives up, and never shows mercy.",
    "bg_texture": "event_fort",
    "idintelligence_group": 5,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 54,
    "name": "The Hanged Men",
    "editor_name": "0042.伊利亚王国-倒吊人",
    "manifest_content": "The secret police force of the Kingdom of Iria was created by Prince Dantalion. The Hanged Men often use illegal methods to handle difficult problems on behalf of the kingdom. Many people hold hostility towards the group and among the public it has earned the name the \"Bat\" for the terrible reputation it has gained over the years.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 55,
    "name": "Beloved Princess",
    "editor_name": "0043.伊利亚王国-受人爱戴的三王女",
    "manifest_content": "Among the three heirs of Iria, the most beloved is Princess Inanna. Although she lacks favorable political allies in the court, she often proposes moderate political programs that benefit the lower class, which has earned her a significant amount of support from the people at the grassroots level. Some of her programs may seem like wishful thinking, but they are not without merit Perhaps all she lacks is a powerful ally that can help her to implement her vision.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 5,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 56,
    "name": "Oath of Knights",
    "editor_name": "0044.骑士评议会-骑士誓言",
    "manifest_content": "The pure and irrevocable oath taken by knights. From this point on, the knight will spare no effort to fulfill the oath with their life and honor. Any aspersion cast on the oath is considered a grave insult to all knights, and any who abandon the promises made under the oath will permanently lose the honor of ever having been a knight.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 58,
    "name": "Confrontation of Two Hegemonies",
    "editor_name": "0046.百科-两个霸权的对抗",
    "manifest_content": "The tensions between the Papal States of Rodinia and the Union of Knight States have existed for a long time, dating back to Radiant War I. After the Radiant War, in order to better control the Knights' States, the Papal States of Rodinia incited wars within the Order. Multiple Knight States were destroyed and countless knights, including one of the four Knight Kings, died in these wars. This prompted the knights to assemble and formally establish the Union of Knight States. After Radiant War II, the Union, realizing the depleted power of the Papal States of Rodinia, sought and gained political independence. Since then, the hidden conflicts between the two sides have been endless. With espionage, spying, and subversion, reaching their peak and started a proxy war in the land of Iria.",
    "bg_texture": "event_war",
    "idintelligence_group": 3,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 59,
    "name": "Auguste",
    "editor_name": "0047.骑士评议会-奥古斯特",
    "manifest_content": "The Leader of the Advance Order of the Union of Knight States. Auguste is a powerful knight who is serious, aloof, and arrogant. On the surface, he is just a military man who follows orders, but his battle-worn greatsword and missing eye imply that he may have had quite a different past. He is tasked with leading the entire Order to carry out a mission in Iria, but it seems that he has another purpose.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 60,
    "name": "Restoration Army",
    "editor_name": "0048.教皇国-护教军",
    "manifest_content": "Taking Lightgloam City as a base, the Papal States of Rodinia has paid a mass of mercenaries, civilians, and even bandits, to create an army. The mercenary group consists of devout and capable local believers as the backbone of the army. They continuously carry out operations in the land of Iria, seeking to gain benefits for the Papal States of Rodinia. This is a common tactic used by the Papal States of Rodinia. They rarely send troops to intervene directly, but instead send Radiant Servants to organize local mercenaries on the spot. The strength of the mercenary group is greater than that of the Waverun Legion, but its personnel composition is more complicated, leading to a huge disparity in combat effectiveness among the different mercenary units.",
    "bg_texture": "event_news",
    "idintelligence_group": 7,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 7
  },
  {
    "id": 61,
    "name": "Iria's Power Factions",
    "editor_name": "0049.伊利亚王国-伊利亚的政府派系",
    "manifest_content": "Iria is mainly controlled by three factions: Irian aristocrats, merchants, and the military. Irian aristocrats refer to pre-revolutionary nobles. In order to avoid further conflicts, King Faris retained these nobles in the royal council when the new country was formed. For historical reasons, they generally have a pro-Papal States of Rodinia stance and are most dissatisfied with the policies of Prince Dantalion. Merchants are the new aristocrats who have risen with the emergence of the Luxite trade. They are the main supporters of the doves, advocating for openness and opposing any form of war. The military is the faction consisting of the old King Faris's loyalists and are currently the most supportive of Prince Dantalion's unifying actions.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 62,
    "name": "Fall of the Knights",
    "editor_name": "0050.骑士评议会-骑士们的堕落",
    "manifest_content": "Like in any other country, the prolonged peace after Radiant War II, along with the rise of the Union of Knight States, has made the knights more arrogant, stubborn, and out of touch with reality. Many knights now only pay lip service to the virtues they uphold, and they value dueling over practical combat. They also tend to look down on other countries. Additionally, the accumulation of wealth has led the knights to pursue a luxurious and decadent noble lifestyle, with increasingly frequent banquets, armor that looks more like works of art, and an endless pursuit of art collections. Even the title of Paladin, the highest honor, has become a commodity that can bought and sold.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 63,
    "name": "Gloria and Auguste",
    "editor_name": "0051.骑士评议会-歌洛莉亚与奥古斯特",
    "manifest_content": "Recently, a rumor is spreading within the Order that the Advance Order did not originally include Gloria. She appeared in Iria in pursuit of justice and out of indignation towards the massacre in Waverun City. For this reason, she forcibly joined the Advance Order, seeking the truth behind the tragic event. But what about Leader Auguste? Is he really trying to bring peace to Iria as he claims?",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 6,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 65,
    "name": "Iria Bridge",
    "editor_name": "0052.百科-伊利亚大桥",
    "manifest_content": "The Iria River flows from east to west through Iria and is the main source of agricultural and domestic water in Iria. However, the turbulent Iria River also divides Iria into north and south, creating a natural obstacle to travel. To solve this problem, the people of Iria have been trying to build bridges over the Iria River for hundreds of years. The most frequently used bridge was built during the period of the Republic of Iria. It seems that when the bridge was designed, the Iria River was taken into consideration as a strategic barrier, and so only a few troops are required to blockade the bridge and cut off passage to Mornrays Castle.",
    "bg_texture": "event_iriamap",
    "idintelligence_group": 3,
    "group_priority": 22,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 66,
    "name": "Luxite",
    "editor_name": "0053.百科-晶石",
    "manifest_content": "Luxite is a mysterious mineral that contains powerful energy and typically exists in crystal form. Each Luxite crystal contains energy of different intensities and properties. Currently, Luxite usage mainly focuses on using mental power to stimulate the energy within the Luxite crystal, releasing various Luxite Blessings. However, Luxite can also stimulate human potential. Furthermore, Luxite also has various industrial, material, and military applications. With many functions still remaining unclear, Luxite has become a strategic resource that is being fought over worldwide.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 3,
    "group_priority": 21,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 3
  },
  {
    "id": 67,
    "name": "Teadon",
    "editor_name": "0054.骑士团评议会-泰登",
    "manifest_content": "A retired knight of the Union of Knight States and the adjutant of Gloria's division of the Advance Order. The Teadon family has been serving the Roland Family for generations. Teadon and Gloria's father have known each other since they were young. After Gloria's father passed away, Teadon took care of her and raised her as a favor to his close friend. Teadon is kind and dignified, and compared to Gloria's strictness, Teadon's approach is more diplomatic. He often assists Gloria in handling difficult affairs.",
    "bg_texture": "event_knights",
    "idintelligence_group": 6,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 6
  },
  {
    "id": 68,
    "name": "Xavier",
    "editor_name": "0055.伊利亚王国-泽维尔",
    "manifest_content": "A young commander in the King's Army of Iria. Coming from a poor background, Xavier caught the eye of Marshal Magnus with his outstanding performance and proactive attitude after joining the army and was subsequently given an important position. Xavier idolizes Prince Dantalion and sees him as the last hope of the Kingdom of Iria. In his mind, Dantalion is someone worth following for the remainder of his life.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 69,
    "name": "Aid Work of the Order",
    "editor_name": "0056.骑士团评议会-骑士团的援助工作",
    "manifest_content": "The Order has been providing various forms of aid in Iria. At first, the knights from the Council of Knights mobilized a large amount of supplies, providing vital food and daily necessities for the refugees in Iria. But over time, there were rumors claiming that the knights were demanding that the refugees \"cooperate with their propaganda campaign,\" as a result of which, many journalists came to the war zone and wrote articles criticizing the actions of the Kingdom of Iria.",
    "bg_texture": "event_news",
    "idintelligence_group": 5,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 70,
    "name": "Magnus",
    "editor_name": "0057.伊利亚王国-马格努斯",
    "manifest_content": "A calm and hard-line soldier who acts swiftly and decisively. Over his 30-year military career, Magnus honed his excellent military skills and made great contributions during Iria's War of Independence. After the Kingdom of Iria gained independence, Magnus became the supreme commander of the King's Army, enjoying great popularity among the people. Magnus is a loyal follower and defender of King Faris. After King Faris retired, Magnus became the representative of King Faris's will, holding military power and observing the developing situation. He currently supports Prince Dantalion as an important pillar of the kingdom.",
    "bg_texture": "event_conspiracy",
    "idintelligence_group": 5,
    "group_priority": 14,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 5
  },
  {
    "id": 71,
    "name": "Waverun City Incident",
    "editor_name": "人文-0001-浪涌城事件",
    "manifest_content": "On Sanctuary Day in 999 of the Radiant Calendar, a riot occurred in Waverun City, a seaport of Iria. Rioters burned, killed, and pillaged while shouting ferociously to dethrone the royal family. Finally they initiated a bloody conflict with the King's Army. Many innocent civilian causalities ensued.",
    "bg_texture": "event_ruins",
    "idintelligence_group": 10,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 72,
    "name": "Kingdom of Iria",
    "editor_name": "势力-0001-伊利亚王国",
    "manifest_content": "The Kingdom of Iria is a small kingdom with a long history coveted by the great powers because of its rich Luxite resources. Currently, its actual ruler is the eldest son of King Faris, Prince Dantalion.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 11,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 73,
    "name": "The Town of Convallaria",
    "editor_name": "地理-0001-铃兰小镇",
    "manifest_content": "A small town located in the central part of the Kingdom of Iria and named after the blooming convallaria nearby. The Town of Convallaria, adjacent to the Crossroads, is the main layover for caravans. However, as the situation in Iria has gradually become more unstable with rampant banditry and hindered trade, the Town of Convallaria has also become increasingly demoralized. The Sword of Convallaria Mercenary Group is stationed there to protect the town in these turbulent days.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 12,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 74,
    "name": "Sword of Convallaria Mercenary Group",
    "editor_name": "势力-0002-铃兰之剑佣兵团",
    "manifest_content": "A mercenary group established by Rawiyah several years ago and named the \"Sword of Convallaria.\" Its members are mainly residents of the town because they must protect their homeland themselves in this increasingly chaotic situation. The Sword of Convallaria Mercenary Group completes quests like real mercenaries when they have the time, gradually gaining a considerable reputation in nearby villages and towns.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 11,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 75,
    "name": "Training Ground",
    "editor_name": "教学-0002-训练场",
    "manifest_content": "It is a place for the mercenaries of the Sword of Convallaria to train and improve themselves. Mercenaries can practice with others to gain some battle experience or make breakthroughs and learn new tactics here. Special programs can be undertaken to provide targeted tailored training to mercenaries. In any case, it is a place for the finest mercenaries to surpass themselves and become stronger.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 77,
    "name": "Haven",
    "editor_name": "教学-0001-佣兵之家",
    "manifest_content": "A warm and comfortable house for mercenaries who have been fighting for days to rest and refresh. There is no doubt that further decoration could make the living environment more comfortable and naturally improve the rest for mercenaries. Weapons also need to be maintained and repaired, not just the mercenaries.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 1,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 78,
    "name": "Tavern",
    "editor_name": "教学-0003-旅店",
    "manifest_content": "The hotel in the small town is open to guests all day and clients with very deep pockets can frequently be seen checking in. Many mercenaries wait here for clients to become pleasantly tipsy and then negotiate a favorable contract.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 79,
    "name": "Papal States",
    "editor_name": "势力-0003-罗迪尼亚法皇国",
    "manifest_content": "The Papal States of Rodinia is one of the oldest political forces on the continent with a philosophical belief in the Light of Sanctuary. It is composed of Radiant City under the jurisdiction of the Hierophant and surrounding states loyal to him.\nThe \"Light of Sanctuary,\" the largest philosophical movement on the continent and has had countless devout followers all over the world for the past thousand years. Many countries regard the Light of Sanctuary as their national worldview, and the Papal States as their metropolitan state, making it the most powerful movement in millennia.",
    "bg_texture": "event_papal",
    "idintelligence_group": 11,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 80,
    "name": "Forge",
    "editor_name": "教学-0004-铁匠铺",
    "manifest_content": "It is the forge in the Town of Convallaria, where you can place orders for forging weapons and trinkets Blacksmiths can forge general or customized gear per the design blueprint Witness the sparks by the collision between the burning furnace and the blueprint here!",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 81,
    "name": "Vlderians",
    "editor_name": "人文-0002-薇尔德人",
    "manifest_content": "They are an ancient race inhabiting Vltar Mountain. In appearance, the Vlderians have some canine characteristics and are very brave warriors regardless of gender, especially on mountainous battlefields. Female Vlderians are renowned for their ability to sing and dance, and the chieftain of the Vlderians is usually a woman.",
    "bg_texture": "event_vilder",
    "idintelligence_group": 10,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 82,
    "name": "Sorceresses ",
    "editor_name": "人文-0003-魔女",
    "manifest_content": "Sorceresses are considered by the Papal States to be \"women who are bewitched by chaos and spread heretical evil in the world,\" so they are often hunted down for a bounty. It is said that they are extremely evil and possess terrifying power. However, another rumor has it that sorceresses actually study Luxite in secret but are stigmatized because they threaten the monopoly of the Papal States on Luxite research.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 10,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 83,
    "name": "Luxite",
    "editor_name": "人文-0004-晶石",
    "manifest_content": "A mysterious mineral containing great energy, usually in the form of crystals. More than ten years ago, Luxite deposits were first discovered underground in Radiant City after an earthquake. The Hierophant immediately declared that Luxite was a gift from the light and put the mining and research of Luxite under the sole management of the Light of Sanctuary. Each Luxite crystal contains energy of different intensities and properties. In addition to specific physical means, some people with strong mystical power can also activate Luxite and release the energy by using spiritual wave resonance. Moreover, Luxite energy has various magical effects on living organisms and matter, making it one of the most important strategic resources in the world. At present, almost all known Luxite lodes are controlled by the Papal States, but those discovered in Iria have broken this monopoly.",
    "bg_texture": "event_crystal",
    "idintelligence_group": 10,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 84,
    "name": "Luxite Workshop",
    "editor_name": "教学-0005-晶石工坊",
    "manifest_content": "Its full name is \"Luxite Workshop of Gifted Beryl,\" which is filled with unnamed experimental materials. Beryl specializes in refining various strange and mysterious experimental products from Luxite that may have magical effects on the battlefield. If you want some of these, Beryl will ask you to do some chores or test these experimental products to help inspire her to develop new inventions.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 13,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 13
  },
  {
    "id": 85,
    "name": "The Union",
    "editor_name": "势力-0004-骑士同盟",
    "manifest_content": "Its full name is \"The Union of Knight States,\" which is a national alliance composed of 13 Knights' States, each with great military power. It handles the major political affairs of the alliance through an evaluation and consultation system.\nIn consideration of geographical politics, as well as the desire to obtain Luxite, the Union has been actively engaged in trade with Iria and has a strong influence there, ",
    "bg_texture": "event_knights",
    "idintelligence_group": 11,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 86,
    "name": "The Advance Order",
    "editor_name": "势力-0005-先遣骑士团",
    "manifest_content": "The advance troop sent by the Union to Iria, led by Auguste, a knight in the Council of Knights, and composed of the elites from the various Knights' States. After the war began, the Advance Order quickly arrived and stationed itself in Waverun City. It also took control of the vast area of land nearby and set up strategic posts. The well-equipped and well-trained knights are enough to influence the fate of a small country.",
    "bg_texture": "event_knights",
    "idintelligence_group": 11,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 87,
    "name": "Paladin",
    "editor_name": "人文-0005-圣骑士",
    "manifest_content": "After a series of strict examinations, assessments, and tests administered by the Union, select elite knights with a noble virtue are awarded the title of \"Paladin.\" Paladins are regarded as the model of knighthood and perfect chivalry. However, as the Union has grown increasingly strong and prosperous, many knights have begun to overindulge in pleasure. The spirit of knighthood itself has become a point of contention. Even the lofty title of \"Paladin\" has lost much of its weight.",
    "bg_texture": "event_knights",
    "idintelligence_group": 10,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 88,
    "name": "Light of Sanctuary",
    "editor_name": "人文-0006-庇护之光",
    "manifest_content": "The Light of Sanctuary is the largest philosophical movement in Rodinia, with countless devout followers and supreme glory for thousands of years. Followers of the Light of Sanctuary believe in the light and uphold the doctrine of protecting the world with the light. As the sole spokesperson of the movement, the Hierophant is the leader of all states believing in the Light of Sanctuary.\nDue to the impact of the Radiant War, while the Papal States lost much of their former power, the Hierophant remains the most influential figure in the world. Due to this divergent situation, followers of the Light of Sanctuary have gradually begun to think differently about the future.",
    "bg_texture": "event_papal",
    "idintelligence_group": 10,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 89,
    "name": "Vlderian Dancers",
    "editor_name": "人文-0007-薇尔德舞娘",
    "manifest_content": "Dancers from Vlder often make appearances outside of Vlder in the form of professional dance regiments. Their dance is gentle, relaxed, and graceful. Their slow movements are as calm as flowing water, but their fast choreography is as swift as the fiercest wind. The Irians love it, but few people know that the dance is not just a show but also a martial art.\nSadly, the Vlderians are frequently oppressed in Iria and in Elaman, and some local aristocrats even buy Vlderian dancers at high prices from slave traders to perform for them.",
    "bg_texture": "event_vilder",
    "idintelligence_group": 10,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 90,
    "name": "Iria Bridge",
    "editor_name": "地理-0002-伊利亚大桥",
    "manifest_content": "The Iria River flows from east to west through Iria and is the main source of agricultural and domestic water in Iria. However, the turbulent Iria River also divides Iria into north and south, creating a natural obstacle to travel. To solve this problem, the Iria Bridge was built across the river connecting the northern and southern sides. It seems that when the bridge was designed, it was done so that only a few troops were required to blockade the entire bridge and cut off passage to Mornrays Castle.",
    "bg_texture": "event_iriariver",
    "idintelligence_group": 12,
    "group_priority": 2,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 91,
    "name": "The Darklight",
    "editor_name": "势力-0006-黑暗之光",
    "manifest_content": "A malicious organization entrenched deep in the Mine Pit. Followers of the Darklight hate everything in the world. They believe that they have been assigned a mission to let darkness devour everything in order to usher in final salvation. They will do anything to complete this mission, even sacrifice their lives. As the situation in Iria was devolving, more and more people who were desperate for any type of salvation were tempted into joining the Darklight. So, it grew rapidly and spread outward like a deadly plague.",
    "bg_texture": "event_darklight",
    "idintelligence_group": 11,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 92,
    "name": "Mine Pit",
    "editor_name": "地理-0003-矿坑城",
    "manifest_content": "A vast slum centered around the dilapidated Luxite mines located to the south of the Iria River on the Central Tableland. Since the statehood period, countless peasants have been forced to gather in this area for mining and related industries to make a living. Over the years, the Mine Pit has become a massive slum. The area is a mix of different groups, sheltering a great many refugees and homeless people. The headquarters of the Darklight is located in the complex network of mines and slums in the Mine Pit.",
    "bg_texture": "event_minecity",
    "idintelligence_group": 12,
    "group_priority": 3,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 93,
    "name": "The Hanged Men",
    "editor_name": "势力-0007-倒吊人",
    "manifest_content": "A secret police force of the Kingdom of Iria, called the Hanged Men whose highest commander is Safiyyah. Created by Prince Dantalion, he uses them to handle difficult problems for the kingdom by illegal means. Many people hold hostility towards them, calling them \"Bats\" for their notorious reputation over the years.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 11,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 94,
    "name": "Waverun Legion",
    "editor_name": "势力-0008-浪涌军",
    "manifest_content": "A paramilitary organization established under the covert support of the Union after the Waverun City incident. It is mostly composed of opportunists and rioters who take advantage of the prevailing chaos as well as the rebellious King's Army. The Waverun Legion denounces Dantalion's corrupt and brutal rule while pursuing their so-called \"justice and freedom\" by looting, pillaging and laying waste to Waverun City.",
    "bg_texture": "event_port",
    "idintelligence_group": 11,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 95,
    "name": "Convallaria Festival",
    "editor_name": "人文-0008-铃兰节",
    "manifest_content": "A major annual festival in the Town of Convallaria. During the blooming season of convallaria, local residents will prepare abundant food to entertain guests. On the day of the Convallaria Festival, people will make small cookies with a convellaria pattern to share with others. Convallaria symbolizes happiness and hope. People believe that those who consume convallaria cookies on this day will be blessed with long-lasting good luck and happiness. (Maitha: There is no convallaria in convallaria cookies!)",
    "bg_texture": "event_citylive",
    "idintelligence_group": 10,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 96,
    "name": "Crossroads Keep",
    "editor_name": "地理-0004-十字路要塞",
    "manifest_content": "Crossroads Keep is an important military fortress in Iria. It is located at the crossroads of two significant trade routes in the kingdom and has long been garrisoned by elite troops of the King's Army. It controls Iria's significant trade routes, logistical supplies, and the Iria Bridge. The supplies in Crossroads Keep are plentiful enough to keep the defenders under siege alive for several years. Besides, it is also the absolute barrier of Mornrays Castle to prevent Iria from invasion by any force.",
    "bg_texture": "event_fort",
    "idintelligence_group": 12,
    "group_priority": 4,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 97,
    "name": "Spear of Iria",
    "editor_name": "势力-0009-先锋营",
    "manifest_content": "A battalion composed of elite warriors within the King's Army and led by General Xavier. Most of the soldiers are radical Irian patriots who have made a pledge to fight fiercely for Iria until death. The Spear of Iria is superior to the regular forces of the King's Army in combat, will, and training.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 11,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 98,
    "name": "The Judge",
    "editor_name": "势力-0010-审判者",
    "manifest_content": "A position that works directly under the Hierophant. Members have mysterious identities. Only devout believers who have accepted and completed special ceremonies are eligible to become members. The Judge, as the agent of the Hierophant, supervises the piety and purity of the Light of Sanctuary internally and punishes heretics and enemies who try to intimidate the Papal States externally.",
    "bg_texture": "event_papal",
    "idintelligence_group": 11,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 99,
    "name": "Mornrays Castle",
    "editor_name": "地理-0005-晨曦堡",
    "manifest_content": "Mornrays Castle was formerly a large garrison fortress built during the State of Iria period. It is located at the northern end of the Crossroads on mountainous terrain where Vltar Mountain and the Central Tableland meet. Mornrays Castle has a population of around 30,000 people, much smaller than that of Waverun City. The population is mainly composed of garrisons, powerful families, and civilians who serve the former two groups, so it lacks some of the functions of a normal city. Mornrays Castle is the political and military center of the Kingdom of Iria, but with underdeveloped business, industry, and agriculture, it is heavily reliant on the supplies transported on the Crossroads.",
    "bg_texture": "event_kingcity",
    "idintelligence_group": 12,
    "group_priority": 5,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 100,
    "name": "Waverun City",
    "editor_name": "地理-0006-浪涌城",
    "manifest_content": "A seaport located on the west coast of Iria and at the estuary of the Iria River. It is also the wealthiest and most populous city in Iria. Waverun City is the foreign trading hub of Iria, connecting the Crossroads' transport line with the Union's marine trade route. It has developed rapidly due to the Luxite trade in the last ten years. Waverun City is a gathering place for merchants from various countries and holds a remarkable strategic position in the Union. In recent years, the Union has continuously expanded its influence in Waverun City through various means.",
    "bg_texture": "event_port",
    "idintelligence_group": 12,
    "group_priority": 6,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 101,
    "name": "Elaman",
    "editor_name": "势力-0011-埃拉曼",
    "manifest_content": "The Elaman are nomadic people who established an ancient empire, which conquered vast territories throughout history. Nowadays, it has become an empire of trade and commerce from top to bottom. Elaman relies on soft diplomatic means and trade advantages to maneuver major powers and seize maximum benefits. Elaman's armed caravans travel throughout the world, and their merchants believe that everything has a price, including real people.",
    "bg_texture": "event_solomon",
    "idintelligence_group": 11,
    "group_priority": 11,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 102,
    "name": "Silver Wolf Mercenary Group",
    "editor_name": "势力-0012-银狼佣兵团",
    "manifest_content": "A mercenary group belonging to the Empire of Luccia, which was founded and directly led by Agata the Silverwolf. Most of its members are strong warriors honed from the icy wind of Luccia Tundra. The Silver Wolf Mercenary Group is favored by the commercial giant Elamanians due to its good military literacy and organizational discipline, so they have established a long-term and stable cooperative relationship.",
    "bg_texture": "event_war",
    "idintelligence_group": 11,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 103,
    "name": "Miguel Mercenary Group",
    "editor_name": "势力-0013-米格尔佣兵团",
    "manifest_content": "A mercenary group employed by the Papal States of Rodinia and directly led by Miguel. The predecessor of the Miguel Mercenary Group was a bandit group wandering in Rodinia. Under Miguel's efficient, ruthless, and flexible style of grasping the situation, the Miguel Mercenary Group has developed into a force to be reckoned with.",
    "bg_texture": "event_war",
    "idintelligence_group": 11,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 11
  },
  {
    "id": 104,
    "name": "Members of Iria's Royal Family",
    "editor_name": "人文-0009-伊利亚王室成员",
    "manifest_content": "Iria's royal family is composed of the King of Iria and his relatives. The dominating figures are King Faris, Prince Dantalion, Prince Lutfi, and Princess Inanna.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 105,
    "name": "State Funeral",
    "editor_name": "人文-0010-国葬仪式",
    "manifest_content": "It is one of the supreme ceremonies in the Kingdom of Iria. It is the funeral for dominating figures of the royal family and meritorious individuals, which gathers attention from the Irians and the international community.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 106,
    "name": "Mutant",
    "editor_name": "人文-0011-魔人",
    "manifest_content": "They are actually humans attacked by the Darklight, but have been cursed because their wounds cannot heal. If they do not receive timely and sufficient treatment, they are highly likely to mutate into terrifying monsters like walking corpses.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 10,
    "group_priority": 11,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 107,
    "name": "Grand Sanctuary",
    "editor_name": "地理-0007-大庇护所",
    "manifest_content": "The divine city in the Papal States of Rodinia. The Grand Sanctuary plays the role of preaching, studying, nurturing followers, and emergency care. Many homeless orphans have been adopted here.",
    "bg_texture": "event_papal",
    "idintelligence_group": 12,
    "group_priority": 7,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 108,
    "name": "Luxite Firelock",
    "editor_name": "人文-0012-晶石火枪",
    "manifest_content": "The new weapon first presented by Lutfi at the peace negotiation. The Luxite firelock was invented by Menia, which uses Luxite energy to drive projectiles to shoot targets. The Menians have improved the utilization of Luxite energy through a special process, allowing repeated firing of the Luxite device inside and thus ensuring long-term fighting for users simply by reloading. The Luxite firelock is a product that integrates advanced technologies, such as Luxite, casting, and assembly. Menia gave the Luxite firelock to Lutfi as a gift, which only had limited power for now, but Lutfi predicted that the world was about to undergo a major change thanks to the new weapon.",
    "bg_texture": "event_money",
    "idintelligence_group": 10,
    "group_priority": 12,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 109,
    "name": "Bishop",
    "editor_name": "人文-0013-枢机卿",
    "manifest_content": "The Bishop is the senior manager of the Papal States. Appointed by the Hierophant, the Bishop is responsible for undertaking the administrative duties and presiding over the Light of Sanctuary ceremony of the Papal States and their various jurisdictions. They have authority second only to that of the Hierophant themselves. The authority of the Bishop varies depending on the power of the Hierophant in the local area. They have a great deal of influence over those states that have been subordinate to the Papal States for years.",
    "bg_texture": "event_papal",
    "idintelligence_group": 10,
    "group_priority": 13,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 110,
    "name": "State of Iria",
    "editor_name": "人文-0014-伊利亚邦国",
    "manifest_content": "After the Radiant War II, the Elaman Empire, which had ruled Iria for hundreds of years, was defeated. Iria was ceded as a vassal state to the Papal States of Rodinia, and set the Light of Sanctuary to oversee the state's religion. Later, under the uprising led by Faris, the rule of the State of Iria was overthrown, and the independent Kingdom of Iria was established.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 14,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 111,
    "name": "Old Aristocracies",
    "editor_name": "人文-0015-旧贵族",
    "manifest_content": "They are the privileged aristocratic group that existed during the State of Iria period when most old aristocrats accumulated fortune through their status. They are protected by the Papal States. Since the independence of the Kingdom of Iria, most authority of the old aristocracy was ceded to the Faris family. Even though they declared their support for the rule of the Faris family, they still attempted to restore the state and regain the power and position that they once had.",
    "bg_texture": "event_iriakingdom",
    "idintelligence_group": 10,
    "group_priority": 15,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 112,
    "name": "Mutant",
    "editor_name": "人文-0016-异变者",
    "manifest_content": "For an extended period of time, the Darklight has been secretly using Luxites to conduct outrageous human experiments in the Mine Pit. These experiments can lead to various mutations of the human body based on different stone types, research approaches, and subject characteristics. They have an extremely high failure rate, where Luxites in failed experiments invariably backfire on the subjects and cause miserable deaths. On the other hand, the survivors will merge with the stones and gain extraordinary powers. However, as the Luxite invades the flesh and central nervous system, the subject will ultimately lose all their senses, rationality, and linguistic capabilities, thus reduced to a living corpse.\nIn addition, creatures contaminated by the human experiments also undergo mutations. As their skeletal structure gradually dissolves from the exacerbating contamination, they will eventually devolve into mud-like monsters. People in the Mine Pit have named these mutant creatures \"Purupuru\" after the burbling noises they make when dragging their squishy torsos to move around. The ominous sound cautions against death drawing near.",
    "bg_texture": "event_darkritual",
    "idintelligence_group": 10,
    "group_priority": 16,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 113,
    "name": "Miguel's List",
    "editor_name": "人文-0017-米格尔的清单",
    "manifest_content": "A to-do list issued by the Papal States, secretly handed to a mercenary called Miguel. One could see the \"Radiant\" stamp signifying the authorities at the end of the list.\nIts content reveals what truly happened at the Waverun City Tragedy. Miguel was assigned the following tasks by the Papal States:\n1. Infiltrate the Union undercover and gain their trust.\n2. On the day of the Princess' speech, help the Union incite a riot in Waverun City by blending in with and instigating the civilians.\n3. Ensure the Princess dies in the riot to start an armed conflict between the civilians and the King's Army. Escalate the situation beyond the control of the Union and the King's Army so that both parties become dragged into combat, wearing both sides down.\n4. Gather evidence that the Union is behind the Waverun City Tragedy, which the Papal States may leverage to overthrow the Union and gain control over Iria.",
    "bg_texture": "event_letter",
    "idintelligence_group": 10,
    "group_priority": 17,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 114,
    "name": "Rawiyah's Diary",
    "editor_name": "人文-0018-拉维耶的日记",
    "manifest_content": "You received the diary from Miguel, its cover still stained with Rawiyah's blood. Rawiyah recorded her investigation in Waverun City in bits and pieces:\n\n\"According to the informant, the Hanged Men had already made preparation for full-scale battle prior to the Waverun City Tragedy. Had Dantalion known what was coming? I need more evidence to prove my speculation.\"\n\n\"After following several mercenaries who instigated the crowd on the day of the incident, I've become certain that they all had something to do with the Union. If only I could find solid evidence of the Union's involvement in the Tragedy... Perhaps the truth will come out.\"\n\n\"It was the Union that incited the riot in Waverun City! Who'd have thought they'd resort to such despicable means? The people must know!\"\n\n\"That figure... It rings a bell... Could it be...\"",
    "bg_texture": "event_letter",
    "idintelligence_group": 10,
    "group_priority": 18,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 115,
    "name": "Lightgloam City",
    "editor_name": "地理-0008-暮光城",
    "manifest_content": "Located in the south of Iria, Lightgloam City was once the capital of the State of Iria. During the Irian Civil War, the Papal States occupied Lightgloam City under the excuse of supporting the royal descendants and later sent Bishops to rule the city. Since then, Lightgloam City has become the political center of the Papal States in Iria.",
    "bg_texture": "event_papal",
    "idintelligence_group": 12,
    "group_priority": 8,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 116,
    "name": "Divine Punishment",
    "editor_name": "人文-0019-神罚",
    "manifest_content": "The Judge of the Papal States channels their distinct innate power to induce tremendous Luxite energy fluctuations that can shatter a crystal. The resulting energy blast continuously assaults its surroundings with an appalling magnitude of destruction as if delivered at a celestial level. The \"Divine Punishment\" is often used to execute the heinous sinners that desecrate the Radiant.",
    "bg_texture": "event_papal",
    "idintelligence_group": 10,
    "group_priority": 19,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 117,
    "name": "Crown of Convallaria",
    "editor_name": "人文-0020-铃兰花冠",
    "manifest_content": "The exquisite crown woven from May lilies and their vines appears more adorable with the little kitten sketched on the yawning vines. A celestial glow emanates from the Luxite at the center, lending a touch of serenity and holiness to the crown.",
    "bg_texture": "event_linglanhome",
    "idintelligence_group": 10,
    "group_priority": 20,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 118,
    "name": "Convallaria Trading Post",
    "editor_name": "人文-0021-铃兰商会",
    "manifest_content": "Established in the Town of Convallaria, it's an organization that unites merchants from various industries. Its aim is safeguard resources for the common people, promote production and commercial development, maintain trade order, and handle trade disputes.",
    "bg_texture": "event_money",
    "idintelligence_group": 10,
    "group_priority": 21,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 119,
    "name": "Fox and Squirrel Crystal Mining Syndicate",
    "editor_name": "人文-0022-狐与松鼠晶石采矿联合体",
    "manifest_content": "Known as \"Fox and Squirrel,\" it is an alliance of interests established through joint consultations by representatives from the Mine Pit and Vlder. Its purpose is to allow the oppressed people of the Mine Pit and Vlder to have their own Luxite production capabilities, join forces in market competition, and use the profits from the industry to improve public welfare and infrastructure. Its office is set up in Convallaria Trading Post.",
    "bg_texture": "event_shakehands",
    "idintelligence_group": 10,
    "group_priority": 22,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 120,
    "name": "Uprising by Miners",
    "editor_name": "人文-0023-矿工起义",
    "manifest_content": "During the era of the State of Iria, a large-scale uprising movement was initiated by Irian miners to resist the exploitation of the Papal States. However, during the uprising, a small number of defectors emerged within the labor group, allowing the Papal States to grasp the situation of the movement, leading to its eventual failure.",
    "bg_texture": "event_rebellion",
    "idintelligence_group": 10,
    "group_priority": 23,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 121,
    "name": "Rodinia Trade Organization",
    "editor_name": "人文-0024-罗迪尼亚贸易组织",
    "manifest_content": "An organization formed based on the \"Rodinia Trade Agreement.\" It aims to mediate conflicts of interest between members through trade, stop wars, and coordinate trade relations between the signatories after the war.",
    "bg_texture": "event_trade",
    "idintelligence_group": 10,
    "group_priority": 24,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  },
  {
    "id": 122,
    "name": "Rabi'a Oasis",
    "editor_name": "地理-0009-拉比亚绿洲",
    "manifest_content": "The trade station in Iria is the closest to the territory of Elaman, where Elamanian merchants have a stronger influence than those from Iria. It's a mixed bag, but there are many business opportunities.",
    "bg_texture": "event_solomon",
    "idintelligence_group": 12,
    "group_priority": 9,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 123,
    "name": "Great Sea of Sand",
    "editor_name": "地理-0010-大沙海",
    "manifest_content": "The largest desert in Rodinia. Caravans entering and leaving the Rabi'a Oasis need to traverse this harsh environment. Strong winds prevail in the Great Sea of Sand, often forming sandstorms, causing great trouble to travelers.",
    "bg_texture": "event_smalloasis",
    "idintelligence_group": 12,
    "group_priority": 10,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 12
  },
  {
    "id": 124,
    "name": "Great Hashah",
    "editor_name": "人文-0025-大哈沙",
    "manifest_content": "The emperor title of the Elaman Empire, the owner of everything within the territory of the Elaman. After the new Great Hashah took the throne, through the \"National Merchant\" system, the Elaman entered a new era of prosperity. It is rumored that he has an eccentric and unpredictable personality, often associated with water.",
    "bg_texture": "event_solomon",
    "idintelligence_group": 10,
    "group_priority": 25,
    "sort_id": 0,
    "has_group": true,
    "idgroup": 10
  }
]