[
  {
    "id": 2,
    "name": "退款提示",
    "title": "Notice of Resource Deduction for Refund Behavior",
    "content": "Dear Voyager:\n\nDue to your voluntary refund behavior, the corresponding Astral Gem/Blessing of Hope and other resources will be deducted.\n\nIf the number of Astral Gems in the account is less than the refund portion at the time of deduction, the number of Astral Gems in the account will be deducted to a negative value. You can purchase additional Astral Gems to make up for the difference.\nIf dishonest refund behavior occurs, an account ban is risky after the deduction reaches a particular condition.\n\nMaintaining a fair and orderly gaming environment requires your joint efforts. Thank you for your support and cooperation. If you have objections to this handling result, please provide feedback through in-game customer service."
  },
  {
    "id": 3,
    "name": "充值返利",
    "title": "Purchase Benefits",
    "content": "Dear Grandmaster,\nWe have sent you your purchase benefits in the [Paid Wipe Test]. \nThis mail will expire in 90 days after the official release. Please collect the items in time. \nThank you for your love and support."
  },
  {
    "id": 4,
    "name": "问卷填写",
    "title": "Survey Reward",
    "content": "Dear Voyager: \nThank you for participating in the questionnaire, please collect your rewards. \nMay your choices bring peace to Iria."
  },
  {
    "id": 5,
    "name": "活动奖励发放",
    "title": "Event Reward",
    "content": "Please collect the event benefits you have earned. \nMay your choices bring peace to Iria."
  },
  {
    "id": 6,
    "name": "事前预约奖励发放",
    "title": "Pre-registration Rewards",
    "content": "Dear Voyager, \nSword of Convallaria has received more than 500,000 pre-registrations! We have sent you the pre-registration rewards. Remember to check them out! \nWe thank you for your support and wish you much achievement on the journey. May you bring peace and happiness to Iria! \nTeam Sword of Convallaria"
  },
  {
    "id": 7,
    "name": "丰饶之角奖励",
    "title": "Cornucopia Reward",
    "content": "Human, you forgot to claim your Cornucopia reward. \nLuckily, I went to the Sea of Chaos to retrieve your reward. Gratefully accept it!"
  },
  {
    "id": 9,
    "name": "公测预约奖励发放",
    "title": "Pre-registration Rewards",
    "content": "Dear Voyager,\nSword of Convallaria has received more than 3,000,000 pre-registrations! We have sent you the pre-registration rewards. Remember to check them out!\nWe thank you for your support and wish you a fruitful journey. May you bring peace and happiness to Iria!"
  },
  {
    "id": 10,
    "name": "《铃兰之剑》公测见面礼   ",
    "title": "Sword of Convallaria Official Release Gift",
    "content": "Dear Voyager,\nWe are excited to officially meet you in \"Sword of Convallaria\"! Here is the additional benefit promised in \"Dev Diary III\": Secret Fate ×10. \"Sword of Convallaria\" would not have been possible without your love and recognition. Your support is the driving force behind our continuous progress."
  },
  {
    "id": 11,
    "name": "公测预下载奖励发放",
    "title": "Open Beta Pre-Download Rewards",
    "content": "Dear Leader,\nWe have sent you the pre-downloading rewards. Remember to check them out!\nWe thank you for your support and wish you much achievement on the journey. May you bring peace and happiness to Iria!"
  },
  {
    "id": 12,
    "name": "充值返利",
    "title": "[Polar Heart Test] Purchase Rebate",
    "content": "Dear Leader,\nThe purchase rebate for your payment in the open beta [Polar Heart Test] has been issued, please check!\nThis mail will expire 90 days after character creation, please claim it in time. \nThank you for your love and support."
  },
  {
    "id": 13,
    "name": "卡池规则改变返利",
    "title": "Sincere Thanks and Blessings in Return",
    "content": "Dear Leader,\nHere are the rewards corresponding to the accumulated account deposits of [Sincere Thanks and Blessings in Return]. We extend our heartfelt gratitude for your tremendous support and wish you a delightful gaming experience!"
  },
  {
    "id": 14,
    "name": "逆境之塔奖励发放",
    "title": "Tower of Adversity Reward",
    "content": "Human, you forgot to claim your Tower of Adversity reward. \nLuckily, I went to the Sea of Chaos to retrieve your reward. Gratefully accept it!"
  },
  {
    "id": 15,
    "name": "圣杯大秘宝分享奖励",
    "title": "[Voyagers' Conundrum] Sharing Reward",
    "content": "Dear Voyager,\nThank you for your active participation. Please collect the following event rewards."
  },
  {
    "id": 16,
    "name": "拼图分享奖励",
    "title": "[Decoding Heartscape Vista] Sharing Reward",
    "content": "Dear Leader:\nYou have unraveled the mystery of the Crimson Storm,\nPlease claim the sharing reward for [Decoding Heartscape Vista] below."
  },
  {
    "id": 17,
    "name": "频道变更通知",
    "title": "Guild Change Notification",
    "content": "Dear Leader, you have been removed from the list of Guild members by the administrator."
  },
  {
    "id": 18,
    "name": "预热拼图_tw_查看前瞻内容",
    "title": "[Night Crimson] Preview Reward",
    "content": "Dear Leader:\nThank you for your interest in the [Night Crimson] preview content.\nThe new version of Sword of Convallaria [Night Crimson] will be launched on June 14.\nFirst-time preview viewers will receive a reward. Please claim the event reward below."
  },
  {
    "id": 19,
    "name": "预热拼图_cn_查看前瞻内容",
    "title": "[Night Crimson] Preview Reward",
    "content": "Dear Leader:\nThank you for your interest in the [Night Crimson] preview content.\nThe new version of Sword of Convallaria [Night Crimson] will be launched on June 29.\nFirst-time preview viewers will receive a reward. Please claim the event reward below."
  },
  {
    "id": 22,
    "name": "「科尔的午后」过期未领奖励",
    "title": "[Col's Afternoon] Rewards",
    "content": "Dear Voyager,\nHere are your unclaimed rewards from the [Col's Afternoon] event."
  },
  {
    "id": 23,
    "name": "海外OBT-公测预约奖励发放",
    "title": "Open Beta Reservation Reward",
    "content": "Dear Voyager,\nSword of Convallaria has achieved the global pre-registration milestone of over 2 million participants! We would like to express our heartfelt gratitude to all of you for your continuous care and support.\nThe pre-registration rewards have been distributed.\nMay your journey be fruitful and may you bring peace and happiness to Iria.\nSword of Convallaria Dev Team"
  }
]