[
  {
    "id": 7,
    "idonline_role": 45,
    "sort_id": 1,
    "title": "",
    "content": "The founder and leader of the Sword of Convallaria who acts as the protector of the Town of Convallaria with her Mercenary Group. \nRawiyah is kind and straightforward, affecting those around her by her sense of justice and warm heart. When facing a crisis, she never backs down from her duty to protect those in need. As a resident, she is always concerned about the situation in Iria. \nHer skills and insights, which far surpass those of ordinary mercenaries, seem to suggest that she has an unusual past.",
    "require_story_id": 0
  },
  {
    "id": 8,
    "idonline_role": 61,
    "sort_id": 1,
    "title": "",
    "content": "A supporter and initial member of the Sword of Convallaria.\nAlthough orphaned from a young age, Maitha found a home when Rawiyah adopted her and settled in town. Despite her tragic childhood, she never lost her smile and quickly won everyone's love with her kindness and trust in others. In order to protect the people she loves, she volunteered to join the mercenary group established by Rawiyah. \nMaitha firmly believes that as long as one doesn't lose hope, everything will eventually turn out alright.",
    "require_story_id": 0
  },
  {
    "id": 9,
    "idonline_role": 60,
    "sort_id": 1,
    "title": "",
    "content": "A young man with a troubled past and one of the initial members of the Sword of Convallaria. As a child, Faycal witnessed the destruction of his home. Despite his supportive relationship with Maitha and Rawiyah, he could not completely eliminate the darkness in his heart. For this reason, Faycal cherishes everything he has now while also being wary of outsiders. He vows to grow up and protect his family, even if it means sacrificing everything.",
    "require_story_id": 0
  },
  {
    "id": 10,
    "idonline_role": 42,
    "sort_id": 1,
    "title": "",
    "content": "A talented, little Sorceress who is talkative as much as she is quirky and is very passionate about researching Luxite. \nFrom an early age, Beryl underwent human Luxite experiments, which stunted her physical and mental growth, thus making her appear far younger than her actual age. After escaping due to an accident, she became a wandering Sorceress, sought after by the Papal States for her strong affinity to Luxite research. \nBeing fond of the Town of Convallaria, she settled down, opened a Luxite Workshop to continue her research, pursuing her desire to solve the mysteries of the world.",
    "require_story_id": 0
  },
  {
    "id": 11,
    "idonline_role": 43,
    "sort_id": 1,
    "title": "",
    "content": "The eldest prince and de facto ruler of the Kingdom of Iria. \nDantalion has inherited the gloomy visage of his father and keeps his own counsel without much regard for others' opinions of him. He founded the Hanged Men whom he used to maintain iron-fisted order in Iria. \nDantalion is willing to sacrifice whatever he needs to in order to ensure Iria's future, even his own soul.",
    "require_story_id": 0
  },
  {
    "id": 12,
    "idonline_role": 53,
    "sort_id": 1,
    "title": "",
    "content": "The second-born prince of the Kingdom of Iria whose appearance favors his mother as much as his brother resembles their father. Knowledgeable and eloquent, Lutfi is fiercely invested in finding a solution to Iria's current problems. \nDespite his active interest in his country's future, the lack of recognition from his father and elder brother has been a constant source of frustration, further igniting his desire to prove himself. \nLutfi believes that he is the one who must guide Iria towards a brighter future, and is determined to find his own path to do so.",
    "require_story_id": 0
  },
  {
    "id": 13,
    "idonline_role": 51,
    "sort_id": 1,
    "title": "",
    "content": "The third child of Iria's royal family, who, kindhearted and gentle by nature, strives to become a competent princess in order to contribute to her country. \nInanna has inherited her deceased mother's beauty and is deeply loved by everyone, with high popularity among the citizens. Some even believe that Iria's throne should be passed down to her. \nIn the midst of the tense situation in Waverun City, Inanna voluntarily proposed to appease the people to avoid bloodshed. However, during her speech, the situation spiraled out of control and ultimately led to a violent conflict…",
    "require_story_id": 0
  },
  {
    "id": 14,
    "idonline_role": 48,
    "sort_id": 1,
    "title": "",
    "content": "The cunning and swift commander of the Hanged Men who is willing to put everything on the line for her country without regard for her own life or reputation. \nAs Dantalion's right hand, she stands by his side as they steer Iria towards the future. Her dangerous beauty belies a kind heart that never wavers no matter how far she ventures into the darkness.",
    "require_story_id": 0
  },
  {
    "id": 15,
    "idonline_role": 120,
    "sort_id": 1,
    "title": "",
    "content": "A strategically-minded member of the Hanged Men. Nergal depends heavily on the support of his sister, Nungal. \nHe was born to a noble family but made an orphan when political enemies had his parents assassinated. The siblings were taken in and raised by Safiyyah who ensured that they received elite education. After completing their education, the siblings chose to join the Hanged Men to serve their country. \nIn Nergal's mind, his sole purpose is protecting Iria and his sister.",
    "require_story_id": 0
  },
  {
    "id": 16,
    "idonline_role": 119,
    "sort_id": 1,
    "title": "",
    "content": "A shy and curious member of the Hanged Men, and Nergal's younger sister. \nNungal was born into a noble family but became an orphan after her family was massacred by political enemies. The siblings were taken in and raised by Safiyyah, and after receiving elite education for several years, they chose to join the Hanged Men to serve their country. \nUnlike her brother, Nungal has a strong curiosity about life outside the organization.",
    "require_story_id": 0
  },
  {
    "id": 17,
    "idonline_role": 114,
    "sort_id": 1,
    "title": "",
    "content": "The fiercely loyal Marshal of the King's Army of Iria. Magnus is a veteran commander with a bold and strategic style of warfare and is said to embody the \"military soul\" of Iria. \nAs the right hand to the king, he made great contributions during the War of Independence, and instructed the two princes in military strategy. \nEven after the King's retirement, he continued to defend the peace of Iria as a representative of the King's will and supporter of Prince Dantalion.",
    "require_story_id": 0
  },
  {
    "id": 18,
    "idonline_role": 58,
    "sort_id": 1,
    "title": "",
    "content": "A young military leader in the King's Army of Iria, and an earnest soldier who serves Dantalion and Iria with his outstanding combat skills. \nAfter losing his parents in war, Xavier became a ward of the kingdom and received the support and training needed to become a top-notch soldier. This upbringing has ingrained a fierce loyalty to Iria in him, and he considers defending its peace to be his top priority. \nXavier is ready and willing to lay his life down for his country.",
    "require_story_id": 0
  },
  {
    "id": 19,
    "idonline_role": 117,
    "sort_id": 1,
    "title": "",
    "content": "A cold and ruthless one-eyed knight who serves the Council of Knights and wields the fragmented Gramm (the Sword of Wrath) with an imposing countenance. \nAuguste hails from a prestigious family of knights and was once considered a prodigy with the potential to become a Paladin. However, a failed mission stole that chance along with his eye and left him with a broken blade and a frozen heart. No one knows what caused those injuries, and he has never spoken of it. \nAfter the tragedy in Waverun City, he led the vanguard to Iria and declared the city a protectorate of the Union.",
    "require_story_id": 0
  },
  {
    "id": 20,
    "idonline_role": 47,
    "sort_id": 1,
    "title": "",
    "content": "Wielder of the Lance of Longinus and one of the youngest knights to hold the title of Paladin. \nGloria possesses a noble character, befitting the scion of a family of knights, a heart filled with courage, and a dedication to justice. These qualities have made her a Union banner-bearer and the epitome of knighthood that young knights aspire to. \nAfter the tragedy in Waverun City, she was sent by the Council to Iria. She has sworn to fulfil her mission and eradicate evil so that justice may prevail.",
    "require_story_id": 0
  },
  {
    "id": 21,
    "idonline_role": 52,
    "sort_id": 1,
    "title": "",
    "content": "A senior knight whose easy-going nature never betrays his dignity. Teadon serves the Roland family and was once a trusted comrade of Gloria's father until he passed away. Following that, Teadon resigned from his post and became Gloria's guardian, teaching her and protecting her from harm. \nNow serving as her adjutant, Teadon has joined Gloria in her investigation of the Waverun City incident. His pride in her growth is that of a father as is his fear for her safety.",
    "require_story_id": 0
  },
  {
    "id": 22,
    "idonline_role": 62,
    "sort_id": 1,
    "title": "",
    "content": "Simona hails from the distinguished noble family of knights, the Yngling, and is a powerful Ice Knight. She is ambitious, decisive, and aloof, firmly believing in elitism. Ostracized within her family and disdainful of the Union's increasing decadence, Simona willingly joined the Advance Order on an expedition to Iria after becoming a knight directly under the Council of Knights.\nSimona's ambition has never wavered. To her, conquering Iria would not only silence the old but also lay a solider foundation for the path she has chosen.",
    "require_story_id": 0
  },
  {
    "id": 23,
    "idonline_role": 56,
    "sort_id": 1,
    "title": "",
    "content": "A kind woman and devout maidservant of Radiant. Samantha had worked tirelessly in the town of Convallaria during the war, helping to heal the sick and wounded. This led to her becoming a beloved figure to the local children. \nAdopted by the Sanctuary as an orphan, her outstanding talent quickly set her apart from her peers and caught the eye of the Hierophant himself who adopted her and made sure she received the best education. \nAs an adult, Samantha has proven him right to have done so, becoming an Adjudactor who carries out his missions. However, Samantha's time in Iria has led to a conflict between her heart and her faith.",
    "require_story_id": 0
  },
  {
    "id": 24,
    "idonline_role": 44,
    "sort_id": 1,
    "title": "",
    "content": "A rebellious young woman who serves as an Adjudactor in the Papal State of Rodinia. Like Samantha, she was an orphan who grew up in the halls of the head church and was handpicked to join their elite forces after demonstrating remarkable ability. Since then, she has served in her role with a ruthless efficiency in dispatching the Sanctuary's enemies. \nHowever, her accomplishments mean little compared to her craving for Samantha's attention. Her obsessive love for her senior has led her astray as a Judge as she pursues a different idol.",
    "require_story_id": 0
  },
  {
    "id": 25,
    "idonline_role": 123,
    "sort_id": 1,
    "title": "",
    "content": "One of the cardinals of the Papal States of Rodinia who has jurisdiction over the affairs of Iria. Gentle and devout, Caris is an exemplary member of the clergy. \nBefore becoming a cardinal, Caris was in charge of the Grand Sanctuary and served as a mother figure to Samantha, whom she trained as a potential candidate to be Hierophant. As a devout believer in both Radiant and the Hierophant, Caris has devoted her life to revitalizing the Light of Sanctuary and would give up anything to achieve that goal. \nHowever, her devotion may be the thing holding her back from her true potential…",
    "require_story_id": 0
  },
  {
    "id": 26,
    "idonline_role": 116,
    "sort_id": 1,
    "title": "",
    "content": "A high-ranking Radiant guard, and the sergeant guard of Bishop Caris. Stoic and loyal, he is everything a knight should be. \nLeonide has been guarding Caris for years, and although she trusts him, he never oversteps his station, only giving her advice when they are alone. \nLeonide is fiercely loyal to Caris and will stand by her side regardless of what dangers they may face.",
    "require_story_id": 0
  },
  {
    "id": 27,
    "idonline_role": 57,
    "sort_id": 1,
    "title": "",
    "content": "Ruthless and cunning leader of the Miguel Mercenary Group.\nBorn on the battlefield, the only thing he has been taught to worship is money while good and evil are little more than words. In Miguel's eyes, money begets survival, and he will take any job as long as the pay is good, even if it means viewing human life as just another business expense.\nDuring one of his jobs, he came across the orphaned Col. He would come to rationalize adopting her as an investment in her potential as a mercenary, while secretly hoping that a better life is waiting for her.",
    "require_story_id": 0
  },
  {
    "id": 28,
    "idonline_role": 49,
    "sort_id": 1,
    "title": "",
    "content": "A mysterious assassin belonging to the Miguel Mercenary Group who glides around the battlefield in a mask. Col strikes swiftly and lethally, making her a frightening opponent for anyone unlucky enough to be targeted by her. Despite her strange visage, beneath the mask is the face of an innocent child.\nCol was adopted by Miguel when he found her on the verge of death, and she grew up to be a terrifying weapon for his mercenary group due to her extraordinary abilities. Because death is all she knows, Col lacks any sense of how the world works. Her personality is that of a child and she depends entirely on Miguel for direction.\nWhile humans are little more than targets, she loves small animals, especially cats.",
    "require_story_id": 0
  },
  {
    "id": 29,
    "idonline_role": 54,
    "sort_id": 1,
    "title": "",
    "content": "A leading figure in the Vlder, and younger sister to the chieftain, LilyWill. NonoWill is a quiet, but brave reformer.\nFor too long, she watched her fellow Vlderians being oppressed and humiliated by their conquerors and vowed to find a way to save her people. She has a beautiful singing voice, but rarely shares it with others.\nAfter the war in Iria broke out, Nono Will saw an opportunity to bring reform to her people and left the Vltar Mountain to find a better future for everyone.",
    "require_story_id": 0
  },
  {
    "id": 30,
    "idonline_role": 46,
    "sort_id": 1,
    "title": "",
    "content": "The chieftain of the Vlderians as well as the elder sister to NonoWill. LilyWill is a determined warrior and reliable sister. She guards the Vltar mountain with her bow and arrows earning the trust of her people as their protector.\nAs head of the clan, it is her job to ensure that her people survive and understands all too well that reform is necessary for that goal.\nIt was LilyWill who encouraged NonoWill to leave their home and find ways to bring reform to their people. In the meantime, she guards the clan with her life.",
    "require_story_id": 0
  },
  {
    "id": 31,
    "idonline_role": 63,
    "sort_id": 1,
    "title": "",
    "content": "A scout and guard for the Vlder Dance Troupe.\nIggy's friendly disposition and messy silver hair evokes the image of an affectionate puppy in those who meet him. He serves his troupe as a gifted scout skilled in hunting large animals. His spear is said to be a gift from an Irian friend which has led to him being far friendlier to the Irians than most Vlderians. \nIggy's family and the Dance troupe are his whole world.",
    "require_story_id": 0
  },
  {
    "id": 32,
    "idonline_role": 64,
    "sort_id": 1,
    "title": "",
    "content": "The capable and unyielding leader of the Resistance.\nBeneath her gentle demeanor, Edda possesses an iron-will that refuses to be intimidated by power. Born to a craftsman's family in Waverun City, she was present when the incident occurred. In the midst of the chaos, Edda and many of her fellow citizens ended up in danger. At that moment, she stepped up and led her fellows to refuge outside of the city.\nEdda firmly believes that it is up to each individual to pick up a weapon and protect themselves rather than wasting time waiting for a savior.",
    "require_story_id": 0
  },
  {
    "id": 33,
    "idonline_role": 118,
    "sort_id": 1,
    "title": "",
    "content": "The legendary hero during the Unified War of Luccia, the leader of the Silver Wolf Mercenary Group, powerful, calm, wise, decisive, filled with strength and wild charisma. The Silver Wolf Queen can maintain her powerful Silver Wolf form for an extended period in battle. Agata, one of the first Luccians to foresee the impact of Luxite technology on the world, thinks differently about Luccia's future. To this end, she leads some young people out of the ice fields to learn about and understand the world, exploring possibilities for cooperation and mutual development for Luccia.",
    "require_story_id": 0
  },
  {
    "id": 34,
    "idonline_role": 50,
    "sort_id": 1,
    "title": "",
    "content": "As the deputy leader of the Silver Wolf Mercenary Group and a disciple of Agata, Alexei is a Brutebear warrior who embodies both fiery passion and innate talent.\nAlexei forged his path as a Luccian warrior amidst harsh climates and relentless training. Bold and valorous, he cherishes loyalty and holds deep admiration for strength, aspiring to learn from the mighty. Upon assuming command of the Silver Wolf Mercenary Group, he rose to the challenge, showcasing remarkable leadership skills and acquiring invaluable growth experience. Despite his ability to unleash a formidable Brutebear form in battle, he grapples with feelings of inadequacy, unable to sustain it as long as Agata can.\nBeneath his striking and imposing exterior lies a bashful young man.",
    "require_story_id": 0
  },
  {
    "id": 35,
    "idonline_role": 55,
    "sort_id": 1,
    "title": "",
    "content": "The greatest weapon of Darklight, a frightening monster clad in obsidian armor.\nOne of Tranquillo's test subjects for Luxite transformation, Guzman follows the will of Darklight without question. Despite his lifeless eyes, his dull passivity will often give way to violent rages. The only flicker of humanity left is his daughter's name which he repeats endlessly.\nWhether she returns or not, Guzman is doomed to remain little more than a beast howling in despair.",
    "require_story_id": 0
  },
  {
    "id": 36,
    "idonline_role": 124,
    "sort_id": 1,
    "title": "",
    "content": "A mysterious creature with the looks and habits of a cat. No one knows how long it has been in Elysium, but it will guide your way there.\nLike all cats, it is endearingly enigmatic, impenetrable, elegant, arrogant, and partial to midday naps and octopus cans. Meanwhile, it is also a trustworthy companion that will guide your adventure in the Sea of Chaos, always appearing by your side when you need help.\nThe same as depicted on that tarot card - the Fool.",
    "require_story_id": 0
  },
  {
    "id": 41,
    "idonline_role": 115,
    "sort_id": 0,
    "title": "",
    "content": "A vagrant Vlderian girl, a product of Tranquillo's Luxite transformation experiments.\nThe inhumane experiments left horrible scars on her body. After escaping from the Darklight, the frail Momo started wandering the streets in rags, seemingly oblivious to her past or current circumstances. She is often slow in response, wearing a dazed expression. Whether due to side effects from the experiment or some other reason, Momo seems to exude an unusual sense of detachment. The truth is, she is quite content with her present life. She roams freely, exploring the world with a newfound friend—that darkness residing in her heart.",
    "require_story_id": 0
  },
  {
    "id": 43,
    "idonline_role": 131,
    "sort_id": 1,
    "title": "",
    "content": "Cocoa, a whimsical adventurer of mixed Vlderian and Irian heritage, wanders with an eclectic array of gear.\nKnown for her odd tales and playful antics, she's easily recognized by her beast-like ears but lack of tail—a mark of her Vlderian ancestry. Unfazed by curious onlookers, she hides not her peculiarities. Underneath her cheerful demeanor is a grim past: she left her mountain home young, seeking the truth about her parents.\nCocoa is a beacon of mirth wherever her quest leads her.",
    "require_story_id": 0
  },
  {
    "id": 44,
    "idonline_role": 129,
    "sort_id": 1,
    "title": "",
    "content": "Acambe, a national merchant from Elaman, was raised in a quintessential Elaman trading family. A romantic entanglement with a Vlderian slave woman during his youth led to deep reflection on the institution of slavery.\nAcambe, a shrewd businessman, excels in spotting lucrative opportunities and invests with a decisive, bold approach, often taking calculated risks as if second nature. His pursuit of wealth is driven not only by extraordinary ambition but also by a mysterious and complicated contract.\nHis dealings in Iria are a critical step in not only freeing himself from this contract but also advancing his grand schemes. The Sword of Convallaria plays a pivotal role in this step—regrettably, this group is notoriously resistant to manipulation.",
    "require_story_id": 0
  },
  {
    "id": 45,
    "idonline_role": 132,
    "sort_id": 1,
    "title": "",
    "content": "An Elaman merchant known for her three parrots, she deftly navigates danger using her remarkable street smarts—or is it luck? Engaging with her often reveals her genuine warmth and approachability, yet her mysteries casually recede into the background.\nHomar ostensibly engages in mundane goods trade between Elaman and Iria, but beneath the surface, she's involved in risky underground trading for reasons undisclosed. The backbone of her operations appears to be a well-established network of relationships she has cultivated.\nShe claims to share a symbiotic partnership with her parrots, a relationship that hints at an interesting backstory.",
    "require_story_id": 0
  },
  {
    "id": 46,
    "idonline_role": 133,
    "sort_id": 1,
    "title": "",
    "content": "A mysterious blind woman from Elaman, she first emerged near a spring in the desert bordering Iria, often seen in the company of another enigmatic figure. In combat, her hand-held censer releases a deadly incense, and her movements are both spectral and graceful, a stark departure from the understated demeanor she typically maintains.",
    "require_story_id": 0
  }
]