[
  {
    "id": 7,
    "idonline_role": 45,
    "sort_id": 1,
    "title": "",
    "content": "铃兰之剑的创始人和现任团长，带领佣兵团守护着小镇的和平。\n拉维耶为人豪爽不拘小节，身边的人都会不自觉地被她的正义感与热心肠感染。面对危局，她总是第一个挺身而出，担负起保护弱小的责任。身居铃兰小镇的拉维耶时刻心系着伊利亚的局势。\n拉维耶那远超一般佣兵的身手和眼光似乎暗示着她拥有一段不同寻常的过去。",
    "require_story_id": 0
  },
  {
    "id": 8,
    "idonline_role": 61,
    "sort_id": 1,
    "title": "",
    "content": "善良活泼乐观坚强的少女，铃兰之剑的初期成员，最初的伙伴与支持者。\n因战乱成为孤儿，直到被拉维耶收养定居小镇才有了自己的家。悲惨的童年并未抹去她的笑容，对所有人报以善意和信任的少女很快赢得了大家的喜爱。为了保护大家，主动加入了拉维耶创建的佣兵团。\n麦莎坚信，只要不放弃希望，一切总会好起来的。",
    "require_story_id": 0
  },
  {
    "id": 9,
    "idonline_role": 60,
    "sort_id": 1,
    "title": "",
    "content": "性格别扭缺乏安全感的少年，铃兰之剑的初期成员，最初的伙伴之一。\n幼年法卡尔亲眼目睹了家园被毁，即使遇到麦莎和拉维耶之后，也无法彻底消除心中的阴影。也因此法卡尔特别珍视自己现在拥有的一切，对外来者总是抱着警惕。\n少年许下誓言，要快快成长起来，保护好自己的家人，哪怕为此付出一切。",
    "require_story_id": 0
  },
  {
    "id": 10,
    "idonline_role": 42,
    "sort_id": 1,
    "title": "",
    "content": "天才小魔女，好奇心旺盛自说自话缺乏一般社会常识的话痨小可爱，热衷于晶石研究。\n幼年在人体晶石实验中度过，也因此心智和外观都远低于实际年龄，某次事故中逃离后开始流浪生涯，因为对晶石研究的强大天赋和兴趣成为魔女被法皇国通缉。非常中意铃兰小镇，自说自话地住下来开了个晶石工坊继续她的晶石研究。\n贝拉对这个世界的奥秘充满了好奇。",
    "require_story_id": 0
  },
  {
    "id": 11,
    "idonline_role": 43,
    "sort_id": 1,
    "title": "",
    "content": "伊利亚王国的第一王子与实际掌权者，阴郁冷峻不怒自威的统治者。\n迪塔利奥继承了父亲法里斯王的阴郁和容貌，因为比两个弟妹年长不少而有疏离感。迪塔利奥不会轻易表露自己的情绪，行事不在乎他人的评价。他一手组建了倒吊人组织，在法里斯王隐退之后，依靠自己的强硬手腕维持着伊利亚的稳定。\n迪塔利奥坚信，为了伊利亚的未来，没有什么不能被牺牲的，他愿意为此背负一切。",
    "require_story_id": 0
  },
  {
    "id": 12,
    "idonline_role": 53,
    "sort_id": 1,
    "title": "",
    "content": "伊利亚王国第二王子，富有学识、能言善辩，对时势有自己独到的见解。\n鲁特菲继承了亡母的美貌，与妹妹伊南娜年龄相近，关系融洽，小时候经常一起调皮。长大后的鲁特菲心忧伊利亚，在各方势力涌动的局势中，他也想为国家的未来贡献自己的力量。但因自己不被父兄重视而心存愤懑，渴望能得到证明自己的机会。\n鲁特菲深信他才是能引领伊利亚走向光明未来的领导者，而在此之前他会用自己的方式去向所有人证明自己的价值。",
    "require_story_id": 0
  },
  {
    "id": 13,
    "idonline_role": 51,
    "sort_id": 1,
    "title": "",
    "content": "伊利亚王室三兄妹中的三妹，生性善良温柔，为了能为国分忧而努力学习如何成为一名合格的王女。\n伊南娜继承了亡母的美貌，深受大家宠爱，在国民中有着极高的人气，甚至有舆论认为应该由她继承伊利亚王位。浪涌城局势紧张之际，为了避免流血冲突，伊南娜主动提出去浪涌城安抚民众。然而在她的演讲过程中，场面失控，最终爆发了流血冲突……",
    "require_story_id": 0
  },
  {
    "id": 14,
    "idonline_role": 48,
    "sort_id": 1,
    "title": "",
    "content": "心思缜密、杀伐果决的倒吊人最高指挥官，为守护伊利亚可以不惜一切，无论生命还是名誉。\n作为迪塔利奥最信任的人，在改变伊利亚的曲折道路上，索菲亚始终与他并肩而行，给了他倚靠与安慰。她坚韧的理智和温柔，总是藏匿在美艳而危险的面具之下，正如她内心的善良，从未因为身处黑暗而动摇丝毫。",
    "require_story_id": 0
  },
  {
    "id": 15,
    "idonline_role": 120,
    "sort_id": 1,
    "title": "",
    "content": "倒吊人成员，谨慎寡言、沉默果断的少年，与妹妹伦伽勒相依为命。\n内尔伽勒出生于贵族家庭，因家族被政敌血洗成为孤儿。兄妹二人受索菲亚抚养，经过数年的精英教育之后，选择加入倒吊人为国效力。\n对内尔伽勒来说，保护伊利亚、保护妹妹伦伽勒就是他人生意义的全部了。",
    "require_story_id": 0
  },
  {
    "id": 16,
    "idonline_role": 119,
    "sort_id": 1,
    "title": "",
    "content": "倒吊人成员，内尔伽勒的妹妹，害羞内向、好奇心旺盛的少女。\n伦伽勒出生于贵族家庭，因家族被政敌血洗成为孤儿。兄妹二人受索菲亚抚养，经过数年的精英教育之后，伦伽勒和哥哥一起选择加入倒吊人为国效力。\n和哥哥不同，少女对倒吊人之外的生活也有着强烈的好奇心。",
    "require_story_id": 0
  },
  {
    "id": 17,
    "idonline_role": 114,
    "sort_id": 1,
    "title": "",
    "content": "伊利亚王国军元帅，忠诚坚韧的铁血军人，作战风格勇猛精通战略的宿将，是伊利亚“军魂”般的人物。\n马格努斯曾作为法里斯王的挚友和副手，为伊利亚的独立战争立下了汗马功劳，伊利亚建国后成为王国军统帅，并成为两位王子的军略战技老师。\n在法里斯王隐退后，马格努斯代表着法里斯王的意志辅佐迪塔利奥，继续保卫着伊利亚的和平。",
    "require_story_id": 0
  },
  {
    "id": 18,
    "idonline_role": 58,
    "sort_id": 1,
    "title": "",
    "content": "伊利亚王国军青年将领，迪塔利奥的忠心追随者，热血赤诚的军人。\n泽维尔忠诚爱国，拥有出众的武艺，身为战争的遗孤，他痛恨战乱，也十分感激国家对自己扶持与培养，为此他将保卫伊利亚的和平作为自己的第一使命。\n泽维尔坚守着自己的信念，愿将自己的全部都奉献给这个国家。",
    "require_story_id": 0
  },
  {
    "id": 19,
    "idonline_role": 117,
    "sort_id": 1,
    "title": "",
    "content": "骑士评议会直属骑士，冷漠无情强大，充满压迫感的独眼骑士，掌握着残缺的神怒剑格拉姆。\n奥古斯特出身骑士名门的支系，凭着自己的努力，一度是有望成为圣骑士的青年才俊，然而在一次任务失败后却断送了前途。无人知晓他手中剑刃残缺、瞎了一只眼的真正原因，只知道他早已变得麻木、冷酷无情。\n浪涌城事件后，他受命带领先遣骑士团来到伊利亚，宣布将浪涌城置于骑士同盟的保护之下。",
    "require_story_id": 0
  },
  {
    "id": 20,
    "idonline_role": 47,
    "sort_id": 1,
    "title": "",
    "content": "骑士评议会直属骑士，骑士同盟最年轻的圣骑士封号持有者之一，圣枪朗基努斯的持有者。\n歌洛莉亚出身骑士世家，她一往无前的英姿、高洁的品性、对正义的执着，使她成为骑士同盟的一面旗帜，堪称骑士精神的楷模，也是年轻骑士们憧憬的偶像。\n浪涌城事件后，歌洛莉亚作为评议会特派骑士来到伊利亚调查真相，她誓要找出真凶铲除邪恶执行正义。",
    "require_story_id": 0
  },
  {
    "id": 21,
    "idonline_role": 52,
    "sort_id": 1,
    "title": "",
    "content": "儒雅随和、温厚持重的资深骑士，歌洛莉亚的老师和副官。\n泰登是侍奉罗兰家族的从属骑士，曾是歌洛莉亚父亲最信任的战友，在歌洛莉亚的父亲死后，泰登辞去军职并承担起照顾教育她的职责，保护着她的安危。\n泰登作为歌洛莉亚的副官参与了浪涌城事件的调查行动，他以父亲的方式守护期待着歌洛莉亚的成长，也担忧着她即将面临的危险。",
    "require_story_id": 0
  },
  {
    "id": 22,
    "idonline_role": 62,
    "sort_id": 1,
    "title": "",
    "content": "席梦娜出身于骑士贵族名门英格林家，同时也是一名强大的冰术骑士。席梦娜锐意进取，果断孤傲，同时信奉精英主义。因在家族内部受到排挤，对骑士同盟日益堕落的风气嗤之以鼻，在成为评议会直属骑士后，席梦娜主动加入先遣骑士团远征伊利亚。\n野心从未从席梦娜心中消退，在她看来，把伊利亚这份胜利果实拿下，正好可以塞住老东西们腐臭的嘴巴，以此为台阶，为自己选择的道路打下更扎实的地基。",
    "require_story_id": 0
  },
  {
    "id": 23,
    "idonline_role": 56,
    "sort_id": 1,
    "title": "",
    "content": "善良温柔虔诚的光辉侍女，在战乱之中来到铃兰小镇，为救死扶伤而尽心尽力，深受孩子们的喜欢。\n萨曼莎是大庇护所收养的孤儿出身，因杰出的天赋和才能很快从孤儿中脱颖而出，被法皇亲自收养并接受了最好的教育。成年后的萨曼莎不负众望成为了代表法皇执行使命的审判者之一。\n来到伊利亚的萨曼莎身负着重要的使命，却也因此陷入了信仰与本心的矛盾与迷茫之中。",
    "require_story_id": 0
  },
  {
    "id": 24,
    "idonline_role": 44,
    "sort_id": 1,
    "title": "",
    "content": "罗迪尼亚法皇国的审判者，个性叛逆我行我素的少女，和萨曼莎一样是大庇护所孤儿出身的精英。\n嘉西娅对庇护之光的信仰淡薄，虽然她总能毫不留情地抹杀一切敌人，出色地完成审判者的任务，但她并不在乎这些，只渴望着能得到自己仰慕的前辈——萨曼莎的关注。\n对前辈病态的爱与占有欲让少女迷失了方向，她追寻着内心构建的那份完美形象，一步步踏上审判者的不归之路。",
    "require_story_id": 0
  },
  {
    "id": 25,
    "idonline_role": 123,
    "sort_id": 1,
    "title": "",
    "content": "罗迪尼亚法皇国的枢机卿之一，掌管伊利亚地区的事务。她本性温柔，信仰虔诚，散发着成熟女性和高阶神职人员的圣洁魅力。\n卡丽丝在成为枢机卿前，是大庇护所的负责人，对萨曼莎的情感亦师亦母，也将她作为下一代法皇的候选人全力培养，严格要求。作为虔诚的信徒和法皇坚定的支持者，卡丽丝将重振庇护之光的荣耀作为自己的使命，为之不惜付出一切。\n或许她的这份虔诚与坚定，早已成为了束缚自我的枷锁……",
    "require_story_id": 0
  },
  {
    "id": 26,
    "idonline_role": 116,
    "sort_id": 1,
    "title": "",
    "content": "高阶光辉卫士，卡丽丝枢机卿的卫士长。忠诚、强大、克制、谦逊的骑士楷模。\n列奥尼德多年守护在卡丽丝身边，虽深受信任，但从不因为这份信任而有任何逾越之举，始终恪守本分，忠实于枢机卿的命令，偶有谏言也只在二人独处之时。\n列奥尼德早已将自己全部的忠心交托给了卡丽丝，无论未来将会面对怎样的危险、遭遇何种危险，他都会一如既往坚定地站在她的身旁。",
    "require_story_id": 0
  },
  {
    "id": 27,
    "idonline_role": 57,
    "sort_id": 1,
    "title": "",
    "content": "米格尔佣兵团的团长，冷酷无情危险狡猾的佣兵。\n对从幼年就混迹佣兵团的米格尔来说没有信仰没有善恶，能赚到钱能活下去就是这个世界的唯一真理。只有钱给够，什么样的委托都接，手段肮脏卑劣，视人命为草芥。\n在某次委托中米格尔偶遇并收养了濒临死亡的科尔，尽管米格尔自认为收养科尔是因为她具有极高的潜质，但他心中却并不希望科尔走上自己的老路。",
    "require_story_id": 0
  },
  {
    "id": 28,
    "idonline_role": 49,
    "sort_id": 1,
    "title": "",
    "content": "米格尔佣兵团所属神秘杀手，常年带着面具，身形诡异出手迅捷致命，是令人胆寒绝望的对手，而面具下其实是一副懵懂纯净的面孔。\n科尔在濒死边缘被米格尔收养，因有着超常的身体机能，成长为了米格尔佣兵团恐怖的杀人工具。由于从未经历过正常生活和教育，没有正常人的价值观和常识，心理状态如同幼儿般天真，对米格尔有着绝对的信任和依赖。\n脱下面具的科尔对世界充满好奇，喜欢小动物，特别喜欢猫。",
    "require_story_id": 0
  },
  {
    "id": 29,
    "idonline_role": 54,
    "sort_id": 1,
    "title": "",
    "content": "薇尔德重要领袖，族长莉莉薇儿的妹妹，沉静隐忍勇敢坚韧的变革者。\n诺诺薇儿亲眼目睹了在外部势力的压迫之下，薇尔德人饱受屈辱却无力反抗的现状，她发誓要为薇尔德人找到一条出路。诺诺薇儿有着天籁般的歌喉，却极少在外人面前展露。\n伊利亚陷入战乱后，诺诺薇儿从中看到了部族的变革机遇，决定离开薇尔塔山，去寻找摆脱压迫与奴役的方法。",
    "require_story_id": 0
  },
  {
    "id": 30,
    "idonline_role": 46,
    "sort_id": 1,
    "title": "",
    "content": "薇尔德现任族长，诺诺薇儿的姐姐，果断坚决的强大战士，也是一名温柔可靠的姐姐。\n身为战士，莉莉薇儿用弓箭守卫着薇尔塔山，是薇尔德人心目中值得依靠的保护神。身为族长，她背负着部族的存亡，也很清楚薇尔德人想要存续就需要打破现状，寻找变革之道。\n莉莉薇儿鼓励妹妹诺诺薇儿离开部落去寻找变革的机遇，并发誓在此之前会用手中的弓箭和自己的生命守护部落。",
    "require_story_id": 0
  },
  {
    "id": 31,
    "idonline_role": 63,
    "sort_id": 1,
    "title": "",
    "content": "薇尔德流浪舞团的斥候和护卫，性格单纯善良耿直。\n有着一头微乱银白色头发的伊奇，总是令人联想到毛茸茸的小狗，只要你报以善意，他就会给你笨拙的回报。伊奇擅长侦察和狩猎大型动物，手中短枪据说是某个伊利亚朋友的礼物，这也使他对伊利亚人有着相对一般薇尔德人更多的好感和信任。\n对伊奇来说，家人和舞团的大家就是他的全部。",
    "require_story_id": 0
  },
  {
    "id": 32,
    "idonline_role": 64,
    "sort_id": 1,
    "title": "",
    "content": "干练可靠、坚韧不屈、善待每一个同伴的反抗军领导者。\n艾达出身浪涌城手工业者家庭，温和文雅的邻家少女形象下，有一颗刚强不屈不畏强权的内心。浪涌城惨剧中，艾达和无数市民同样落入险境，关键时刻她展露出来的责任感、勇气、智慧，让她成功带领着难民队伍逃出浪涌城。\n艾达认为，在这乱世之中每个人都必须学会拿起武器保护自己，而不是仅仅等待救世主的降临。",
    "require_story_id": 0
  },
  {
    "id": 33,
    "idonline_role": 118,
    "sort_id": 1,
    "title": "",
    "content": "雷厉风行、处事不惊的露西亚传奇佣兵，也是银狼佣兵团的首领。她忠心服务于露西亚帝国，能够规划出胆大心细的行军方式，也培养出了不少优秀的佣兵。她立下过赫赫战功，但并不在意自己是否身居高位，且不惜身处险境去寻求国家出路。\n她认为，露西亚的未来，需要大胆探索与寻找。",
    "require_story_id": 0
  },
  {
    "id": 34,
    "idonline_role": 50,
    "sort_id": 1,
    "title": "",
    "content": "银狼佣兵团代理团长，阿加塔的弟子，集热血与天资于一身的蛮熊战士。\n阿列克谢是在恶劣气候及严苛训练中磨砺出的露西亚战士，他果敢勇猛，重情重义，欣赏强者，也希望自己可以向强者学习。在接手银狼佣兵团后，他不负重托，展现了十分优秀的领导能力，并获得了宝贵的成长经验。他能在战斗中使用强大的蛮熊形态，但却无法像阿加塔一样长时间保持，对此阿列克谢颇感自卑。\n俊朗英武颇有压迫力的外表下，却是个腼腆的大男孩。",
    "require_story_id": 0
  },
  {
    "id": 35,
    "idonline_role": 55,
    "sort_id": 1,
    "title": "",
    "content": "黑暗之光的杀戮机器，身披黑色铠甲、狂暴可怕的强大怪物。\n作为特兰奎洛的晶石改造的试验品，古兹曼无条件执行着黑暗之光的命令，他眼神空洞，时而暴戾疯狂，时而安静呆滞，他几乎已经失去了自己的意志，唯一清醒的时刻也只会反复念着自己女儿的姓名。\n古兹曼不知道，他的女儿还会不会归来，但他自己却将被永远困在这副铠甲下，陪伴他的只有绝望与嘶吼……",
    "require_story_id": 0
  },
  {
    "id": 36,
    "idonline_role": 124,
    "sort_id": 1,
    "title": "",
    "content": "不知何时起就居住在乐土的神秘生物，有着猫咪的外观和习性，是指引你到达乐土的重要伙伴。\n它具有一切猫咪的可爱之处，神秘、深邃、优雅、高傲、爱睡午觉和章鱼罐头。但与此同时，它也是可靠的同伴，指引着你在混沌之海中探索，总会在你需要帮助的时候出现在身边。\n就像愚者卡面上绘制的那样。",
    "require_story_id": 0
  },
  {
    "id": 41,
    "idonline_role": 115,
    "sort_id": 0,
    "title": "",
    "content": "流浪的薇尔德少女，特兰奎洛的晶石改造体。\n毫无人性的实验在她身上留下了可怖的痕迹，在逃离黑暗之光的控制后，身形孱弱衣衫褴褛的茉茉四处流浪，对自己身上发生的事情和所处的状况好像毫不在意，一直神情恍惚反应迟钝。不知是实验的后遗症，还是别的什么原因，茉茉总给人一种奇妙的游离感。其实她本人还挺满足现状的，可以到处走走看看，还多了一个朋友——内心中的黑暗力量。",
    "require_story_id": 0
  },
  {
    "id": 43,
    "idonline_role": 131,
    "sort_id": 1,
    "title": "",
    "content": "薇尔德人与伊利亚人的混血少女，背着五花八门的旅行装备的奇怪冒险家。\n蔻蔻娜行事俏皮搞怪，喜欢给人讲无厘头的旅途故事。兽耳无尾的特别样子到哪里都免不了被指指点点，但她并不在意这些目光，也不遮掩自己薇尔德族的特征。在她活泼阳光的外表下有着悲惨的过去，为了追寻父母的身世下落，蔻蔻娜很小就离开薇尔塔山，长年游历于各地追寻关于自己父母的真相。\n无论在哪里，蔻蔻娜的出现总是会带来一抹轻松欢快的亮色。",
    "require_story_id": 0
  },
  {
    "id": 44,
    "idonline_role": 129,
    "sort_id": 1,
    "title": "",
    "content": "埃拉曼的国家商人，阿坎贝成长于最典型的埃拉曼行商家庭。青年时期与一位薇尔德女奴的情感遭遇，使其对奴隶制度有了更加深入的思考。\n经商中的阿坎贝非常善于发现有潜力的商机，投资风格果决而大胆，冒险加注更是如家常便饭。因为，除了追求财富之外，如今迫使着他前进的不仅是一颗非同寻常的野心，还有一个神秘而十分棘手的契约。\n在伊利亚的生意，正是他摆脱契约，推进宏大计划的关键一步，而铃兰之剑则是走出那关键一步的棋子——只可惜，这个团体是出了名的不愿接受摆布。",
    "require_story_id": 0
  },
  {
    "id": 45,
    "idonline_role": 132,
    "sort_id": 1,
    "title": "",
    "content": "带着三只鹦鹉行动的埃拉曼货商，经常凭借奇妙的街头智慧（或运气？）化险为夷。在与她的交往中，时常能够感受到她的真诚与亲和，但同时也时常会让人忽略掉关于她的那些谜团。\n霍玛表面上进行着往来于埃拉曼和伊利亚之间的杂货贸易，实际上则是由于某些原因，不断进行着铤而走险的地下贸易。而支撑着这一切的，似乎是她所经营的一个已然十分成熟的关系网络。\n据本人所说，她与鹦鹉们是相互合作的伙伴关系，这段关系似乎也颇有一段渊源。",
    "require_story_id": 0
  },
  {
    "id": 46,
    "idonline_role": 133,
    "sort_id": 1,
    "title": "",
    "content": "一位来自埃拉曼的神秘盲眼女子，初登场于伊利亚边境沙漠的泉水附近，似乎常与另一位神秘人相伴出现。手中的提线香炉在战斗中会散发出致命的幽香，挥舞起来诡魅优雅，一改她平日里习惯于维持的低调印象。",
    "require_story_id": 0
  }
]