[
  {
    "id": 2,
    "editor_name": "QV3-P1-01-港都惨剧",
    "name": "Waverun City Tragedy",
    "type": 4,
    "desc": "In March of 999 in the Radiant Calendar, the Sanctuary Day parade in Waverun City erupted into armed conflict, leaving many civilians dead.\nPrincess Inanna of Iria, seeking to negotiate with the protesters, tragically lost her life in the chaos.\nSoon after, the protesters formed the \"Waverun Legion,\" demanding accountability from Prince Dantalion for the violence and calling for his resignation and trial.\nDantalion dismissed the accusations as treason, rallying his forces to quell the rebellion.\nTensions escalated rapidly as \"The Union of Knight States,\" a powerful military coalition, declared support for the Irian people's resistance against tyranny, sending the Advance Order to secure Waverun City's outskirts.\nMeanwhile, the Papal States of Rodinia seized its old capital, Lightgloam City, further complicating the situation.\nIn this critical moment, a small nation was once again engulfed in the flames of conflict.",
    "duration": 8
  },
  {
    "id": 3,
    "editor_name": "QV3-P1-18：三王女国葬和伊利亚的反击",
    "name": "Princess Inanna's State Funeral and Iria's Strike Back",
    "type": 4,
    "desc": "It had been a month since the Waverun City incident, and the King's Army's efforts to quell the rebellion are still at a deadlock.\nIn this period of unrest, Prince Dantalion held a state funeral for the murdered Princess Inanna in the Mornrays Castle.\nAt the funeral, Dantalion refuted the rumors about the cause of the incident, accusing the Papal States of Rodinia and the Union of Knight States of orchestrating the tragedy. He called on the people to unite and expel the invaders.\nThe King's Army, whose morale was greatly improved by the state funeral and speech, promptly rejoined the battle.",
    "duration": 8
  },
  {
    "id": 4,
    "editor_name": "QV3-P2-01：战局扩大",
    "name": "Escalated Battle",
    "type": 4,
    "desc": "In just a few weeks, war engulfed Iria like wildfire.\nThe King's Army, the Union, and the Papal States poured troops into the fray.\nOn every front, relentless skirmishes drove countless civilians into desperation.\nIn the desperate turmoil, many desperate souls fled to the southeast's Mine Pit.\nSeizing the chaos, \"Darklight\" expanded openly from its hidden base.",
    "duration": 8
  },
  {
    "id": 5,
    "editor_name": "QV3-P2-11：黑暗之光崛起",
    "name": "Spread of Darklight",
    "type": 4,
    "desc": "As the frontline reached a stalemate, rebellion erupted in the eastern Mine Pit of the Kingdom of Iria.\nThe notorious \"Darklight\" declared Mine Pit's complete independence, swiftly expanding its influence.\nRefugees, swayed by radical doctrines, joined Darklight's ranks.\nAfter defeating some weak King's Army units, Darklight has emerged as a formidable evil force.\nExpanding relentlessly, they ruled with brutality, crushing all resistance mercilessly.\nDarklight scouts have lurked on the town's outskirts…",
    "duration": 8
  },
  {
    "id": 6,
    "editor_name": "QV3-P3-01：契约",
    "name": "Contract",
    "type": 1,
    "desc": "The Sword of Convallaria allied with the Union.\nThe Order would establish a camp nearby and protect the town.\nThe Union aimed to seize Crossroads Keep.\nTo secure the strategic hub, the Order would fortify a camp near the town as a supply center.\nThe Sword of Convallaria joined as a key force in the operation…",
    "duration": 8
  },
  {
    "id": 7,
    "editor_name": "QV3-P4-01：十字路口攻略战开始",
    "name": "Crossroads Conquest Begins",
    "type": 3,
    "desc": "After bloody battles, the Order finally completed the isolation of the Crossroads Keep with the help of the Sword of Convallaria…\nThe Order and the army of the Papal States surrounded the Crossroads Keep from two sides.\nIt seems that the fate of King's Army is on the edge…",
    "duration": 8
  },
  {
    "id": 8,
    "editor_name": "QV3-P5-战云密布",
    "name": "War Clouds Gathering",
    "type": 3,
    "desc": "Despite the Union's initial failure to besiege Crossroads Keep, the beleaguered King's Army was unable to launch a counterattack.\nFor the past few months, both sides have maintained a stalemate along the line of Crossroads Keep, engaging in minor skirmishes.\nThe King's Army's failure to continue their victorious pursuit gave the Union the opportunity to regroup.\nMeanwhile, voices advocating peace talks with the Union were gradually emerging, further undermining the King's Army's will to fight.\nThe Union launched a new large-scale offensive, once again targeting Crossroads Keep.\nTo prevent the Union from quickly defeating the King's Army, the Papal States explicitly stated that they would assist Iria in stopping the Union.",
    "duration": 8
  },
  {
    "id": 9,
    "editor_name": "QV3-P6-01：第二次十字路口会战决战开幕",
    "name": "Beginning of the Final Battle",
    "type": 3,
    "desc": "The Union once again successfully besieged Crossroads Keep after a tough battle with the Papal States and the King's Army.\nThis time, the Union showed unprecedented determination, vowing to conquer Crossroads Keep.\nOn the other hand, seemingly well-prepared, the King's Army significantly enhanced the defense of Crossroads Keep with the help of the Papal States.\nWithout a doubt, the victor of this final battle will determine the fate of Iria.\nMeanwhile, the Sword of Convallaria also took on important offensive tasks…",
    "duration": 4
  },
  {
    "id": 10,
    "editor_name": "QV3-P6-08：骑士团攻占十字路要塞",
    "name": "Union Captures Crossroads Keep",
    "type": 4,
    "desc": "The cruel second Crossroads Keep campaign finally ended with the victory of the Union.\nIt also means that the Union has gained unprecedented decisive advantages in this war.\nThe precarious King's Army abandoned the blockade of the Iria River and retreated to the capital, preparing for a last stand.\nHowever, the influx of refugees only worsened the scarcity of supplies in the Mornrays Castle.\nEveryone knows that the situation is irreversible.\nNow the King's Army must decide whether to fight or surrender…",
    "duration": 4
  },
  {
    "id": 11,
    "editor_name": "QV3-P7-二王子线-01：决战王都",
    "name": "Final Battle in the Mornrays Castle",
    "type": 3,
    "desc": "While some people believe that the Union might negotiate peace after their victory, the Order continued to cross the Iria River, advancing toward the Mornrays Castle.\nNow, the Kingdom of Iria is left with only two options: surrender and await the Union's judgment, or engage in a defense battle with no chance of winning.\nAt this time, Lutfi, a longtime loyal ally of the Union, voluntarily applied for the task of attacking the Mornrays Castle head-on.\nIt seems that this is also part of his plan…",
    "duration": 4
  },
  {
    "id": 12,
    "editor_name": "QV3-P7-二王子线-05：伊利亚内战结束",
    "name": "End of Iria's Internal War",
    "type": 4,
    "desc": "Iria's capital, Mornrays Castle, surrendered.\nThe Second Iria War, lasting for over a year, came to an end with the capture of Prince Dantalion.\nAs the absolute victor of this war, the Union signed a treaty with the interim regent, Prince Lutfi.\nBut for Lutfi, how will he deal with the Union?\nThe behemoth looming over Iria…",
    "duration": 4
  },
  {
    "id": 13,
    "editor_name": "QV3-P7-歌洛莉亚线-02：骑士团的战略",
    "name": "Strategy of the Union",
    "type": 4,
    "desc": "The Union, who have already captured Crossroads Keep, will obviously not be satisfied with the current victory.\nAfter a brief rest, the Order launched an attack on the Mornrays Castle.\nThe King's Army of Iria built multiple lines of defense, trying to delay the Order's attack.\nGuerrilla units were also sent out, in conjunction with the Hanged Men, to disrupt the Order's rear.\nA new round of war has once again ignited.",
    "duration": 3
  },
  {
    "id": 14,
    "editor_name": "QV3-P7-歌洛莉亚线-07：前线情报1",
    "name": "Frontline Intel",
    "type": 1,
    "desc": "Despite the King's Army's best efforts, they were unable to block the Order's advance to the Mornrays Castle in the face of a huge power gap.\nFaced with the victory near at hand, the morale of the Order's members is unprecedentedly high. As for the King's Army, their morale is low and supplies are scarce.\nThe two sides will have their final battle around the Mornrays Castle.\nBut obviously, there is not much suspense about the outcome of this campaign.",
    "duration": 2
  },
  {
    "id": 15,
    "editor_name": "QV3-P7-歌洛莉亚线-11：前线情报2",
    "name": "Frontline Intel 2",
    "type": 1,
    "desc": "After paying a heavy price, the Order finally captured the capital, Mornrays Castle.\nPlenty of nobles who is on Dantalion's side, pro-war officials, and the Hanged Men members were imprisoned or executed.\nThe fall of the Mornrays Castle marked the official end of the Iria civil war.\nIt also means that Auguste can now \ndeal with some internal issues within the Advance Order…",
    "duration": 2
  }
]