[
  {
    "id": 1,
    "m_sandbox_note_selections": [1, 2, 3, 10],
    "name": "测试笔记",
    "editor_name": "测试笔记",
    "text": "→我不能确定这是不是一个正确的选择，但我还是和骑士团签订了契约。\n→拉维耶走后，小镇的情况虽然有所好转，但这个国家的情况却在急速恶化。\n→东面的矿坑市已经成了黑暗之光的据点，各种真真假假的情报和流言都表明那里已经成了可怕的人间炼狱。\n→更糟糕的是，黑暗之光并不满足于控制矿坑市，他们的信徒组成的军队正在不断地向外扩张——更准确的说是吞食这些村镇。\n→铃兰小镇也没有例外，我们不可能凭借自己的力量抵挡黑暗之光，于是我们向骑士团求救了，他们也回应了我们的求援。\n→为首的圣骑士——歌洛莉亚与泰登携带着一只人数不多",
    "first_selection": 1
  },
  {
    "id": 2,
    "m_sandbox_note_selections": [4, 12, 13],
    "name": "另一个测试笔记",
    "editor_name": "测试笔记zhm",
    "text": "这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。",
    "first_selection": 4
  },
  {
    "id": 3,
    "m_sandbox_note_selections": [],
    "name": "第一次的笔记",
    "editor_name": "QV3-P1-第一次的笔记",
    "text": "It's been a week, but my memory hasn't recovered. \nIn case of repeated memory losses, I'd like to write down all the important things I've experienced. \nI've joined \"the Sword of Convallaria\" Mercenary Group. I'm really thankful that they accepted me in such turbulent days. \nThe civil war of Iria has broken out, and the external forces, the Union and the Papal States of Rodinia, have also intervened in it. \nThe war has not yet spread to the town, and the Sword of Convallaria seems to be able to protect itself. \nI'm going to help the Sword of Convallaria and do my best to protect this hard-won shelter.",
    "first_selection": 0
  },
  {
    "id": 4,
    "m_sandbox_note_selections": [],
    "name": "寻求某一势力的帮助",
    "editor_name": "QV3-P2-寻求某一势力的帮助",
    "text": "We successfully resisted the attack of the bandits, which is a stimulating victory. \nBut I'm very worried when I think of the bandits recruited by the Papal States of Rodinia. \nThe situation of Iria is getting worse. If the war spreads to the town, we will not be able to contend against the Union or the King's Army. \nWho will rescue us when we're attacked by these strong forces? \nWhen the nest overturns, no egg remains intact. As long as the war is not over, the town will not be safe. \nWe also have a stake in the winner of the war and the future of Iria. \nEven if we're not strong enough to change the situation, we should make a choice. It's not only for temporary survival, but also for long-term peace.",
    "first_selection": 0
  },
  {
    "id": 5,
    "m_sandbox_note_selections": [5],
    "name": "参与十字路口要塞攻城战前",
    "editor_name": "QV3-P3-参与十字路口要塞攻城战前",
    "text": "Some people in the Mercenary Group and some residents in the town didn't agree with me to form an alliance with the Union. \nBut the former attacks on the town by Darklight have proved that we would not have survived if without the protection of a strong force. \nEven if I have to fight and bleed for them. \nTo protect the town, I must help the Union end the war. \nNext, the Union will attack the Crossroads Keep. \nThe Sword of Convallaria has no choice but to join and pay the price...",
    "first_selection": 5
  },
  {
    "id": 6,
    "m_sandbox_note_selections": [6],
    "name": "十字路口会战后的反思（无信标）",
    "editor_name": "QV3-P4-十字路口会战后的反思（无信物）",
    "text": "The just-concluded siege battle at the Crossroads Keep made me realize what the war is. \nThe King's Army defended to death, and the Papal States of Rodinia betrayed us. We were soundly defeated, and even Maitha was seriously injured. \nFortunately, Gloria and Teadon came back and saved most of the people. \nBut the war is far from over. \nLutfi brought a medal to honor the Sword of Convallaria. \nI didn't appreciate him, but he wasn't angry. \nThe approachable prince indicated something in his words.",
    "first_selection": 6
  },
  {
    "id": 7,
    "m_sandbox_note_selections": [7],
    "name": "十字路口会战后的反思（歌洛莉亚信标）",
    "editor_name": "QV3-P4-十字路口会战后的反思（歌洛莉亚信物）",
    "text": "The just-concluded siege battle at the Crossroads Keep made me realize what the war is. \nThe King's Army defended to death, and the Papal States of Rodinia betrayed us. We were soundly defeated, and even Maitha was seriously injured. \nBut the war is far from over. \nGloria brought a medal and apologized to us on behalf of the Order. \nIt is true that the Order did not arrange their retreat well, but the root cause for the defeat was the betrayal of the Papal States. \nMoreover, if it weren't for Gloria and Teadon's timely rescue, most of the people would not have survived. \nAbout Gloria...",
    "first_selection": 7
  },
  {
    "id": 8,
    "m_sandbox_note_selections": [8],
    "name": "关于二王子的计划",
    "editor_name": "QV3-P4-关于二王子的计划",
    "text": "Rawiyah...\nThe person who took me in, trained me, and made me the Leader of the Sword of Convallaria is gone forever...\nThe Mercenary Group fell into great grief, especially Maitha and Faycal. \nRawiyah, our Big Sister, may you rest in peace in heaven. \n\nGloria came to the town and picked up the Princess. \nAs instructed by Lutfi, I persuaded Gloria to take the Oath of Knights to protect Inanna. \nPrincess Inanna should be fine, but what is Lutfi's plan?",
    "first_selection": 8
  },
  {
    "id": 9,
    "m_sandbox_note_selections": [],
    "name": "调查的结果（二王子线）",
    "editor_name": "QV3-P5-调查的结果（二王子线）",
    "text": "The truth of the Waverun City incident has already been found. \nPrince Dantalion and Auguste, Master of the Advance Order, are the chief culprits. \nLutfi planned to involve the Union and the King's Army into a lose-lose situation and then take care of them one by one. \nAlthough he did not disclose the details, he promised that Iria would usher in independent peace. \nIt also means that I have to betray Gloria. To be honest, I really can't believe her either. \nEven if she is just and righteous, but as Lutfi said, such a huge conspiracy could not be completed by just a few people. \nHow could Gloria fight against the Union by herself? \nOur next action is to help the Union attack the Crossroads Keep again. \nWe will succeed and bring peace to Iria to console Rawiyah and other victims in heaven. \nWe just need a little more time.",
    "first_selection": 0
  },
  {
    "id": 10,
    "m_sandbox_note_selections": [],
    "name": "迫近的真相（歌洛莉亚线）",
    "editor_name": "QV3-P5-迫近的真相（歌洛莉亚线）",
    "text": "The truth of the Waverun City incident has already been found. \nPrince Dantalion and Auguste, Master of the Advance Order, are the chief culprits. \nLutfi planned to involve the Union and the King's Army into a lose-lose situation and then take care of them one by one. \nAlthough he didn't disclose the details, he promised that Iria would usher in an independent peace. \nEverything looks fine, but will it go smoothly as he wants? \nThere is no perfect plan in this world. I'd rather believe the people with a noble virtue. \nAlthough the Union is closely related to the conspiracy, I still believe Gloria. \nAs we agreed, I will help the Union win the Crossroads Battle II and defeat the King's Army, making the executioner, Dantalion, pay the price. \nShe will continue to investigate the degenerates of the Union and bring them to justice. \nAlthough it's difficult, we will succeed. \nWe will bring peace to Iria to console Rawiyah and other victims in heaven.",
    "first_selection": 0
  },
  {
    "id": 11,
    "m_sandbox_note_selections": [],
    "name": "变局（二王子线）",
    "editor_name": "QV3-P6-变局（二王子线）",
    "text": "The reversal is so dramatic. \nAlthough it was tough, we won the Crossroads Battle II. \nBehind the politics, Lutfi also showed that he is respectable to some extent. \nHe recklessly rescued the Sword of Convallaria in the siege battle, and then went deep into the controlled area of the King's Army to win the support of the doves. \nHe sincerely hopes to bring peace to Iria as soon as possible. \nHis effort was rewarded, as Marshal Magnus, the current commander of the King's Army, brought the old King Faris' verbal instructions. \nThey have silently recognized Lutfi's victory. \nWith more efforts, we can solve the problem of the King's Army completely. \nAnd the next target is the Union. \nEven though Lutfi hasn't told me how he would take care of the Union, I'm sure he is prepared. \nEverything is going better. Finally, after surviving so many hardships, I see the dawn of peace...",
    "first_selection": 0
  },
  {
    "id": 12,
    "m_sandbox_note_selections": [],
    "name": "行动开始（歌洛莉亚线）",
    "editor_name": "QV3-P6-行动开始（歌洛莉亚线）",
    "text": "The Crossroads Battle II was too painful for the Sword of Convallaria. \nWe were abandoned on the battlefield as a piece to be sacrificed. \nI don't think Teadon is wrong. Irians have to fight for freedom with their own lives and blood. \nWhat worries me most is that Teadon didn't respond positively to my question. \nAfter all this, will Iria be free and new as promised or controlled by the Union? \nThe only thing that makes me glad is that there are still righteous people like Gloria in the Union. \nWhat I can do now is to help her find the evidence and uncover the degenerates in the Union. \nBut can Gloria bear the great mental pressure of meeting her colleagues with force? \nMaybe I should have a talk with her after this...\nIn the banquet held by Auguste tomorrow, Gloria will take this opportunity to find the decisive evidence. \nWhat I can do is to distract Auguste and buy her more time. \nI hope it's really worth it.",
    "first_selection": 0
  },
  {
    "id": 13,
    "m_sandbox_note_selections": [],
    "name": "黎明之前",
    "editor_name": "QV3-P7-黎明之前（二王子线）",
    "text": "The war is over.\n\nDantalion tried to make a hold for a stand at the Mornrays Castle and sacrifice more people for his ambition. But we shattered his dream with Lutfi and took down the Mornrays Castle at minimal cost.\n\nLutfi has taken over the Mornrays Castle with his men, and he will supervise the country temporarily as the second prince. Although it is too early to say that Iria has begun to recover, at least its situation is no longer getting worse. We have cleaned up the bandits, defeated Darklight, and subdued the rest of the King's army who were loyal to Dantalion. No one wants to continue this war except a few lunatics. We have seen too many people sacrificed.\n\nThe only disturbing thing is that Gloria was officially declared a traitor by the Union. Auguste has launched a manhunt for her. In my opinion, Gloria is so noble that she will never turn her back on her faith. So is it a part of Lutfi's plan? He also told me that the Union would judge Inanna to put an end to the Waverun City tragedy, but he told me not to be nervous because he could keep Inanna alive. The ability he showed has earned my trust, so I won't doubt him and will just wait for him to tell me the whole plan.\n\nI hope everything will go according to his plan. I hope the dawn will come soon, completely.",
    "first_selection": 0
  },
  {
    "id": 14,
    "m_sandbox_note_selections": [],
    "name": "真相与信任",
    "editor_name": "QV3-P7-真相与信任（歌洛莉亚线）",
    "text": "The civil war of Iria is over. \nIn theory, the peace we've been waiting for has come. \nBut it is not real peace, and it's just a dirty deal. \nThe Union launched the civil war in Iria and then overthrew the royal family of Iria. \nI'm sure that the Union will be a new cruel ruler to oppress Iria. \nSuch a peace is meaningless. \nFortunately, not all the members of the Union agreed with and participated in the conspiracy. \nGloria still sticks to her promise and fights for it. \nThe Union is a terrifying hegemony. No matter how powerful it is, I believe Gloria. \nI believe she will never back down, give up or give in. \nHere's to all brave warriors who never give up for truth and justice. \nHere's to all innocent dead in the Waverun City incident and the civil war of Iria.",
    "first_selection": 0
  },
  {
    "id": 15,
    "m_sandbox_note_selections": [],
    "name": "第一次的笔记",
    "editor_name": "QV3-P1-第一次的笔记（二周目）",
    "text": "It's been a week, but my memory hasn't recovered. \nIdentity, past, goals, family and friends... are all without any clues. It is as if I'm not from this world and haven't left any traces in it. \nIn case of repeated memory losses, I'd like to write down all the important things I've experienced. \nIt's been a week since I joined the Sword of Convallaria. For me, who has lost memory, it is the greatest blessing to find such a trust-worthy place to stay. \nThe situation outside the town is getting worse. The civil war between the King's Army and the Waverun Legion has broken out, and the Union and the Papal States of Rodinia have also intervened in this war. \nThe Sword of Convallaria seems to be able to protect itself, but I still feel a little uneasy. \nNext, maybe we should attack more actively to clear all the threats.",
    "first_selection": 0
  },
  {
    "id": 16,
    "m_sandbox_note_selections": [9],
    "name": "二王子的来信",
    "editor_name": "QV3-P5-二王子的来信",
    "text": "As he said before, Lutfi is going to start the plan against the Union \nHe hoped that I would not help Gloria immediately to hinder her investigation \nGloria is a trust-worthy knight, and I believe she is discovering the truth at all costs \nHowever, Lutfi has a bigger plan, the purpose of which is not only to find the truth, but also to wipe out the Union \nIf Gloria asks me for help, should I help her? \nShould I trust Lutfi and his plan?",
    "first_selection": 9
  },
  {
    "id": 17,
    "m_sandbox_note_selections": [],
    "name": "共通线-第一章： 团长的笔记1",
    "editor_name": "共通线-第一章： 团长的笔记1",
    "text": "It has been some time since I woke up in the prison and settled down in the Town of Convallaria. I still can't remember who I am, and the world is also completely strange to me. In case of repeated memory losses, I'd like to write down all the important things I've experienced.\nA lot of things happened recently. The civil war of Iria has broken out, and I escaped from Waverun City with several new friends. I'm really thankful that they accepted me in such turbulent days and let me join the Sword of Convallaria Mercenary Group and become the Vice Leader.\nThe outside world is in turmoil now, and the Sword of Convallaria is just like a small boat swaying in the wind and rain, which will be swallowed by the Bernardows sooner or later. I will try my best to protect this hard-won shelter.",
    "first_selection": 0
  },
  {
    "id": 18,
    "m_sandbox_note_selections": [],
    "name": "共通线-第一章： 团长的笔记2",
    "editor_name": "共通线-第一章：团长的笔记2",
    "text": "The town has become more and more bustling recently. Many new friends have come, including the beautiful and mysterious Vlder Dance Troupe, the kind-hearted Radiant Priest Samantha, and the lively Sorceress Beryl... They make the town full of vigor.\nOf course, there were also many troubles in the town, such as the influx of refugees, the rampant banditry, and attacks by other mercenary groups... Fortunately, we managed to forestall these crises and protect the town.\nThe most important thing is that Rawiyah has gone, leaving me as the Leader. It's a heavy burden that I have to accept. I have always been pushed by the destiny, but now, I'm responsible for the destinies of others. Can I be a competent leader?\nAnd where should I lead the Sword of Convallaria to?",
    "first_selection": 0
  },
  {
    "id": 19,
    "m_sandbox_note_selections": [],
    "name": "共通线-第二章： 黑暗之光后（王国军线）",
    "editor_name": "共通线-第二章： 黑暗之光后（王国军线）",
    "text": "Many townspeople do not understand or approve of the cooperation with the King's army. However, the crisis caused by Darklight has told us that we must rely on other people to survive in such turbulent days. \nThe King's army helped the town and proved that they are not totally unreliable. For the safety of the town, we can only take one step at a time. I will escort Princess Inanna to the Mornrays Castle and meet Prince Dantalion, taking the first step in the cooperation with the King's army.",
    "first_selection": 0
  },
  {
    "id": 20,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第一章： 第一次十字路口会战之前",
    "editor_name": "王国军线-第一章： 第一次十字路口会战之前",
    "text": "After forming an alliance with the King's Army, several things have happened. When Inanna and I arrived in Vlder, we realized that NonoWill is the sister of the chieftain. \nIn addition, at the meeting with Iria's royal family, I learned first-hand that the royal relationships are far more complex than I ever imagined. Fortunately, Vlder had agreed to make a pact with us. Everything is going better than we hoped. Now it's time to head to Crossroads Keep.",
    "first_selection": 0
  },
  {
    "id": 21,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第一章： 第一次十字路口会战结束后",
    "editor_name": "王国军线-第一章： 第一次十字路口会战结束后",
    "text": "The battle of Crossroads Keep had finally come to an end, but that won't be the last of the Union's forces. Once they receive reinforcements, they will surely return. \nSince working with the King's Army, many events have transpired: the meeting with Dantalion, the journey to Vlder, the meeting at the royal manor, all that of which led to here. \nFortunately, thanks to the help of Luccia and the Vlderians, we made it. We must continue recruit more allies. Only then can we finally achieve victory.",
    "first_selection": 0
  },
  {
    "id": 22,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第二章： 第二次十字路口会战前",
    "editor_name": "王国军线-第二章： 第二次十字路口会战前",
    "text": "The Luccia Mercenary Group agreed to join forces with us and settled down in the town, which greatly boosted our morale. Surprisingly, the old aristocracies launched a coup at the time. Fortunately, it was quickly suppressed, with Miguel and his men defeated. The evidence found pointed to the Papal States. No matter what the truth is, we will not cooperate with them. \n The good news is that I saw Rawiyah again, who once took me in and trained me. I believe she will return to the town soon, and I'm looking forward to fighting alongside her.",
    "first_selection": 0
  },
  {
    "id": 23,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第三章：第二次十字路口会战后（不歼灭骑士团）",
    "editor_name": "王国军线-第三章：第二次十字路口会战后（不歼灭骑士团）",
    "text": "Although it was a long and arduous battle, we were able to claim victory at the second battle of Crossroads Keep... but at a great cost. \nThe war was a merciless one with our allies sacrificed. Vlder and Luccia were left to fend for themselves, as our main forces pushed forward for the final victory. \nThe post war negotiations were not going as planned, and unexpected news come one after another. It turned out that Auguste and Prince Lutfi were the instigators of the Waverun City incident. Although I had anticipated it, I couldn't recover for a long time when it was finally revealed. \nIn the end, Auguste was punished accordingly, although The Union were not implicated... Next, we must clean up the aftermath, but... Luckily, I'm starting to see peace on the horizon.",
    "first_selection": 0
  },
  {
    "id": 24,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第三章：第二次十字路口会战后（歼灭骑士团）",
    "editor_name": "王国军线-第三章：第二次十字路口会战后（歼灭骑士团）",
    "text": "Although it was a long and arduous battle, we were able to claim victory at the second battle of Crossroads Keep... but at a great cost. \nThe war was a merciless one with our allies sacrificed. Vlder and Luccia were left to fend for themselves, as our main forces pushed forward for the final victory. \nThe post war negotiations were not going as planned, and unexpected news come one after another. It turned out that Auguste and Prince Lutfi were the instigators of the Waverun City incident. Although I had anticipated it, I couldn't recover for a long time when it was finally revealed. \nIn the end, Auguste and the Union were punished accordingly. I'm worried that we might've gone too far. But I was not left with many options. Next, we must clean up the aftermath, but... Luckily, I'm starting to see peace on the horizon.",
    "first_selection": 0
  },
  {
    "id": 25,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第三章：反思诺诺薇儿事件",
    "editor_name": "王国军线-第三章：反思诺诺薇儿事件",
    "text": "I still remember when the Vlder Dance Troupe first came to the town. They were so beautiful, and NonoWill's singing was so melodious and unforgettable...\nHowever, everything changed in a few months...\nIt feels like watching a bright flowers wither. There wasn't anything I could have done to have intervened. All this was because of the war, the King's Army, and myself. \nThey didn't deserve any of this. The guilt and the mistakes continued to swirl through my head. I could only think of what I could have done...",
    "first_selection": 0
  },
  {
    "id": 26,
    "m_sandbox_note_selections": [],
    "name": "矿坑城事件后笔记",
    "editor_name": "法皇国线-第一章：矿坑城事件后笔记",
    "text": "We eliminated the Darklight in the Mine Pit and liberated many suffering people. People in The Mine Pit and surrounding towns are celebrating our victory, but I know that the dark night isn't over...\nHolding the cold hands of a little girl, I felt the great weight of sorrow in my heart. Too many people have lost everything in this inhumane war. How many people have fled from their homes and were forced to wander, had no way out, or were deceived by the Darklight, only to fall into the endless abyss?\nI will never allow such a tragedy to happen again. Samantha wants to end the war and bring the light back to the world. The road ahead is difficult, but compared to the situation in Iria, which is shrouded in darkness and war, there is true hope.",
    "first_selection": 0
  },
  {
    "id": 27,
    "m_sandbox_note_selections": [],
    "name": "刺杀结束后笔记",
    "editor_name": "法皇国线-第二章：刺杀结束后笔记",
    "text": "I still doubt whether the assassination is correct until now. I don't even know if the doubt comes from my inner weakness or from the concerns about the way we are going. Anyway, my hands have been stained with blood.\nSamantha comforted me. I could feel the guilt in her heart. But I know that she has suffered far more than me along the way. This is her path to the Radiant, disregarding herself and doing all for the better future of others.\nFor the peace of Iria and for all tragedies, I must overcome my inner uncertainty, although this road is winding and long. Fortunately, I have Samantha, and we are comrades who trust each other and can fight side by side.",
    "first_selection": 0
  },
  {
    "id": 28,
    "m_sandbox_note_selections": [14],
    "name": "和谈失败后的笔记",
    "editor_name": "法皇国线-第三章：和谈失败后的笔记",
    "text": "The Papal States and Iria worked together to defeat the Order. Samantha and I were made envoys of the Papal States and sent to negotiate with Iria. Peace finally seemed to be on the horizon. \nTaair warned me about the deep wounds between the two nations, but I still felt hopeful that we might achieve a lasting peace. If there is any meaning to be found in Rawiyah's death or any of those whom we've lost, I must do this.",
    "first_selection": 14
  },
  {
    "id": 29,
    "m_sandbox_note_selections": [],
    "name": "邦国王子死后笔记",
    "editor_name": "法皇国线-第四章-表线：邦国王子死后笔记",
    "text": "The situation has gradually become suffocating. The Papal States has been suppressing the resistance of civilians in Waverun City and the Mine Pit. Countless civilians were killed, but we couldn't stop it.\nWe even had to protect the heinous Fernando. In the end, Edda broke with us, and my friend Taair was implicated and killed...\nSamantha is in pain and helplessness, and what can I do is to comfort her. Sometimes I wonder if the result would change if Samantha and I had made other choices. But it's just my imagination.\nLooking back, this road is covered in mud and blood. Many people wail and curse behind us, while many important people have left us...\nSamantha and I know that our hands are stained with sin. But... this is a decision we made together. For the peace of Iria and for those who have left us, instead of indulging in regret, we must do more to remedy the situation...",
    "first_selection": 0
  },
  {
    "id": 30,
    "m_sandbox_note_selections": [],
    "name": "新计划笔记",
    "editor_name": "法皇国线-第四章-里线：新计划笔记",
    "text": "Every time we make a decision, it feels like we were walking on the edge of a cliff, and any carelessness would lead us to the deep valley. Finally, Samantha made the right choices. This time, we stood by the people who resisted the Papal States. We executed the heinous Fernando, rescued the children who were to be sent to the Grand Sanctuary, and also saw the true face of the Papal States.\nSamantha gradually broke away from the self-inflicted shackles when she made these critical choices. Her eyes are no longer confused, worried and painful, but become much firmer than ever before. The path to the light should not be built by sacrifice. It should be pure and bright, advocating kindness and care for the world. I have known Samantha for a long time, and I believe that this is the path she should take, and it is also her true intention.\nHowever, the path that heralds new hope is full of difficulties. We're too weak to resist the huge Papal States... But we will never give up. Despite the limited conditions, we have finally drawn up a plan and found the allies with a firm will. This plan is not careful and even seems desperate, but I believe in every executor of this plan: Taair, Edda, and Inanna.\nFinally, I can only pray to the Radiant that all will go well with our plan...",
    "first_selection": 0
  },
  {
    "id": 31,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第四章：关于演讲失败的笔记",
    "editor_name": "王国军线-第四章：关于演讲失败的笔记",
    "text": "We failed to gather enough supporters in the Mine Pit...\nLooking back, there were key moments that perhaps we could've handled better. When Dantalion attempted cutting off the Mine Pit's food supply, when we helped fight back the Order, and when we dealt with the ransoms for the Vlderians... Maybe we could've done more. \nWhat's done is done. All we can do is use the support we do have, and keep moving forward.",
    "first_selection": 0
  },
  {
    "id": 32,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第一章：笔记P2",
    "editor_name": "埃拉曼线-第一章：笔记P2",
    "text": "It's been a few months since I woke up in the dungeon and settled in the Town of Convallaria.\nRawiyah entrusted me with the Sword of Convallaria Mercenary Group, and I somehow became the president of the Convallaria Trading Post.\nSince it's all for the Town of Convallaria, I think there should be no problem.\nDuring this time, the girl we met in Waverun City joined us. She revealed to me that she was the princess of Iria, which was surprising but seemed reasonable.\nWhen dealing with the Vlderian Dance Troupe case, I didn't expect to push SchackLulu so hard. Thinking of it, I owe her an apology.\nThe most fulfilling thing during this time was helping Edda and others renovate the abandoned Mine Pit, accommodating more refugees.\nThe Mine Pit is large enough, but the land is barren, and food supplies rely more on the outside world. Perhaps when they have their own core industry and conduct reasonable exchanges with the outside world, the people of the Mine Pit can truly have a new home.\nTo make up for the loss caused by Darklight, I have to go to Rabi'a Oasis.\nAlthough it's a strange and distant place, I'm full of anticipation for what will happen there.",
    "first_selection": 0
  },
  {
    "id": 33,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第二章：笔记P3",
    "editor_name": "埃拉曼线-第二章：笔记P3",
    "text": "I didn't expect the goods I sent to Rabi'a Oasis to be living humans.\nI don't want to be tied up and stuffed into a sealed prison car, so I chose to help them escape.\nAlthough it had some subsequent impacts, not all of them seem bad. Anyway, I don't regret this decision.\nRabi'a Oasis is indeed a novel place, and I feel like I can never finish exploring it. However, according to what Acambe once said, the Grand Bazaar in Hashalaram is much bigger than the market here, which is hard to imagine.\nAfter some turbulence, I finally met Acambe again. What baffles me is that he easily solved the crisis of Darklight with money. What kind of organization is Darklight? How powerful can money be?\nAfter each had dealings with the Advance Order and King's Army, I found that the treatment of the Trading Post and the Mercenary Group was different. Neither side cares about where you stand, which seems to be a default rule.\nNew partners are continuing to increase, and this new friend with magical ears is changing the oppressive atmosphere of our long-term campaign.\nI thought that holding a grand Convallaria Festival and bringing everyone together would be a great idea.\nBut it turns out, this was a very naive thought.",
    "first_selection": 0
  },
  {
    "id": 34,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第三章：笔记P4",
    "editor_name": "埃拉曼线-第三章：笔记P4",
    "text": "Thanks to Homa finding the crucial evidence, The Town of Convallaria was cleared of suspicion.\nI used to have a good impression of Lutfi, but his decision to sacrifice us to save himself greatly disappointed me.\nDuring this time, Acambe and I went our separate ways due to disagreements over weapon trading.\nBut I am certain that no peace can be achieved by supplying plenty of weapons to both sides of a war.\nI've been constantly helping Edda and NonoWill, and eventually, they jointly established a powerful new organization.\nI believe this is an effective path to peace.",
    "first_selection": 0
  },
  {
    "id": 35,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第四章：笔记P5",
    "editor_name": "埃拉曼线-第四章：笔记P5",
    "text": "Finally, our efforts have brought about substantial changes, with the Advance Order and King's Army agreeing to a ceasefire.\nBut this also dealt severe damage to Acambe's weapon business. Just when I started to worry about him, I fell into a trap he had set in the past. Is this lose-lose situation inevitable?\nHoma selflessly stepped forward at this moment, actively taking the blame for me, for which I feel very guilty. Moreover, she was the first to notify me when she heard about Acambe's misfortune, even though she and Acambe didn't seem to get along well.\nWhen we rescued Acambe, we didn't expect that the weapon trade would involve past grievances between Acambe and Cocoa's parents.\nTheir story made me realize the complexity of human relationships. I don't know how Acambe will face Cocoa in the future.\nBut all these grudges have been diluted by the neutrality of the Crossroads Keep, thanks to the efforts of the wise and brave Inanna.\nNow most of the Irians are immersed in the joy of the impending peace, but before that, there are some final difficulties to face.",
    "first_selection": 0
  }
]