[
  {
    "id": 1,
    "idsandbox_ending": 13,
    "text": "You are about to take on another journey, and we are going to part for now. \nI hope you have learned the lessons from the past and at least live longer this time..."
  },
  {
    "id": 2,
    "idsandbox_ending": 21,
    "text": "You are about to take on another journey, and we are going to part for now. \nI hope you have learned the lessons from the past and at least live longer this time..."
  },
  {
    "id": 3,
    "idsandbox_ending": 22,
    "text": "You have brought peace to Iria, although it is not perfect...\nPerhaps you can try other options and see if there is still an unknown path..."
  },
  {
    "id": 4,
    "idsandbox_ending": 23,
    "text": "You stood firmly by Lutfi's side the last time...\nThings must have changed now. Anyway, please be cautious with every choice you make."
  },
  {
    "id": 5,
    "idsandbox_ending": 24,
    "text": "The last time you came to sense at the last moment meant something. \nAnyway, please follow your heart and make the decision you think is right..."
  },
  {
    "id": 6,
    "idsandbox_ending": 25,
    "text": "Are the new buds on Iria destined to rely on the nourishment of the king's love?\nPerhaps this time, there will be a new answer."
  },
  {
    "id": 7,
    "idsandbox_ending": 26,
    "text": "Last time's ending might have been overly desolate, or perhaps just perfectly quiet…\nAnyway, you still have another chance, and every choice you make from now on remains crucial."
  },
  {
    "id": 8,
    "idsandbox_ending": 27,
    "text": "Last time, you and Inanna were at the center of the vortex.\nThis time, it's not just you and Inanna—the destiny of countless people is counting on you…"
  },
  {
    "id": 9,
    "idsandbox_ending": 31,
    "text": "The old journey has come to an end, and another new destiny will be revealed. \\The scenery outside the carriage is constantly changing. Where are you going this time?"
  },
  {
    "id": 10,
    "idsandbox_ending": 4,
    "text": "You are about to take on another journey, and we are going to part for now. \nI hope you have learned the lessons from the past and at least live longer this time..."
  },
  {
    "id": 12,
    "idsandbox_ending": 33,
    "text": "You have brought peace to Iria and the purest faith to the world\nWhere will fate lead you this time?"
  },
  {
    "id": 13,
    "idsandbox_ending": 32,
    "text": "Samantha's sacrifice must weigh heavily on your heart.\nYet, a new path awaits—here's hoping this time, you'll seize your destiny."
  },
  {
    "id": 14,
    "idsandbox_ending": 34,
    "text": "MsgNotFound"
  },
  {
    "id": 15,
    "idsandbox_ending": 35,
    "text": "Last time, you paved the way for lasting peace in Iria through shrewd trade.\nWhat's your move this time?"
  },
  {
    "id": 16,
    "idsandbox_ending": 36,
    "text": "Last time, you brought fleeting peace to Iria through shrewd trade.\nPerhaps you're not satisfied yet. What's your move this time?"
  },
  {
    "id": 17,
    "idsandbox_ending": 37,
    "text": "Last time, trade didn't bring peace to Iria, and only a few escaped unscathed.\nWhat's your move this time?"
  }
]