[
  {
    "id": 1,
    "text": "Mandatory Tutorial start. I will use this space to test tutorial texts."
  },
  {
    "id": 2,
    "text": "If you don't want to watch all compulsory instruments of AT3 version,"
  },
  {
    "id": 3,
    "text": "please click Free Mode on Debugger Interface."
  },
  {
    "id": 4,
    "text": "You will trigger different compulsory instruments if your account data contains main line progress reaching levels far ahead."
  },
  {
    "id": 5,
    "text": "Don't worry, it is normal."
  },
  {
    "id": 11,
    "text": "Select a target to attack"
  },
  {
    "id": 12,
    "text": "Select a target tile to move to"
  },
  {
    "id": 13,
    "text": "Select a target to attack"
  },
  {
    "id": 14,
    "text": "Select and cast a skill"
  },
  {
    "id": 15,
    "text": "Select a target to heal"
  },
  {
    "id": 16,
    "text": "Tap to show alert range"
  },
  {
    "id": 17,
    "text": "Tap to expand Tactical Skills"
  },
  {
    "id": 18,
    "text": "Tap to select a Tactical Skill"
  },
  {
    "id": 19,
    "text": "Long-press a character to drag it to the target location."
  },
  {
    "id": 20,
    "text": "When moving, if you encounter difficult terrain,"
  },
  {
    "id": 21,
    "text": "you can <style=red>hold</style> and <style=red>drag</style> the unit you want to the target location."
  },
  {
    "id": 22,
    "text": "Now, try selecting an explosive barrel using L1!"
  },
  {
    "id": 100,
    "text": "You are finally here, human."
  },
  {
    "id": 451,
    "text": "You seem to have gained [Common Exp] from the battle just now."
  },
  {
    "id": 452,
    "text": "The manifestation of energy in the Sea of Chaos. Can be used to significantly increase your Power."
  },
  {
    "id": 453,
    "text": "Watch how I use them."
  },
  {
    "id": 491,
    "text": "Well... Where did you get these craps..."
  },
  {
    "id": 492,
    "text": "Never mind. Find someone qualified to equip them."
  },
  {
    "id": 493,
    "text": "Don't bother me with such a trifle."
  },
  {
    "id": 531,
    "text": "Lucky, you got a [Medal]."
  },
  {
    "id": 532,
    "text": "Don't dawdle, Upgrade Maitha!"
  },
  {
    "id": 533,
    "text": "And then drive out these troublesome Calamities!"
  },
  {
    "id": 571,
    "text": "Well... I found a new unknown area around you..."
  },
  {
    "id": 572,
    "text": "Let's take a look when you have the time. Maybe we can find some Octopus Cans."
  },
  {
    "id": 573,
    "text": "I mean, maybe there will be some treasures!"
  },
  {
    "id": 601,
    "text": "Oh, is this [Hero's Image]?"
  },
  {
    "id": 602,
    "text": "I didn't expect there could be such good stuff in the Rift."
  },
  {
    "id": 603,
    "text": "Let's apply it to the corresponding character."
  },
  {
    "id": 641,
    "text": "Great. This weapon seems to have the potential to be enhanced..."
  },
  {
    "id": 642,
    "text": "Just like this... and then like that..."
  },
  {
    "id": 643,
    "text": "I only do it once. Watch!"
  },
  {
    "id": 691,
    "text": "Do you feel the weapon strength is insufficient?"
  },
  {
    "id": 692,
    "text": "I knew you would say that."
  },
  {
    "id": 741,
    "text": "It looks like there will be a hard fight..."
  },
  {
    "id": 742,
    "text": "Well, well, it's time to show my special skill."
  },
  {
    "id": 811,
    "text": "Is this [Power of Tarot]? Even I, a knowledgeable cat, rarely see a real one..."
  },
  {
    "id": 812,
    "text": "Take a look at the gear! Is there a feeling of meowing!"
  },
  {
    "id": 821,
    "text": "If you meet the additional conditions, you may gain more rewards."
  },
  {
    "id": 822,
    "text": "Keep in mind the stages will be marked with a hexagram."
  },
  {
    "id": 831,
    "text": "The Spiral of Destinies is revealed to you. Search for your wish and make it a reality."
  },
  {
    "id": 832,
    "text": "Discover new storylines and unlock alternative endings."
  },
  {
    "id": 833,
    "text": "Prepare your characters of Elysium and..."
  },
  {
    "id": 834,
    "text": "Venture forth through the Spiral of Destinies and change the future with you."
  },
  {
    "id": 841,
    "text": "I can tell you're becoming used to moving between Dimensions..."
  },
  {
    "id": 842,
    "text": "Time to discover talents, your inner strength."
  },
  {
    "id": 843,
    "text": "Talents allow you to influence the battlefield directly."
  },
  {
    "id": 844,
    "text": "Let's take a look at the Breaker's Path."
  },
  {
    "id": 845,
    "text": "Use Star Particles to learn Tactical Skills."
  },
  {
    "id": 846,
    "text": "I picked the first Tactical Skill for you! The Thunderstruck!"
  },
  {
    "id": 847,
    "text": "Okay. You need to explore more usages of talents during battle."
  },
  {
    "id": 848,
    "text": "Don't you want to thank me?"
  },
  {
    "id": 851,
    "text": "You made it this time. Is it because you made a different choice?"
  },
  {
    "id": 852,
    "text": "I've been saving a record of your achievements there."
  },
  {
    "id": 853,
    "text": "They've transformed into precious treasures!"
  },
  {
    "id": 854,
    "text": "More experiences, more treasures!"
  },
  {
    "id": 861,
    "text": "Before you enter the Crossing Worlds, I should remind you..."
  },
  {
    "id": 862,
    "text": "There are countless enemies you've never faced before waiting in the Dimension Fragment."
  },
  {
    "id": 863,
    "text": "The most alluring treasures, however, are the ones with the greatest dangers."
  },
  {
    "id": 871,
    "text": "Common Exp stands for your fighting proficiency."
  },
  {
    "id": 872,
    "text": "Level characters up by using Common Exp."
  },
  {
    "id": 873,
    "text": "It's as amazing as it is convenient, isn't it?"
  },
  {
    "id": 881,
    "text": "Equip characters with weapons and trinkets."
  },
  {
    "id": 882,
    "text": "With the right loadout, you can gain the upper hand in battle."
  },
  {
    "id": 883,
    "text": "Moreover, rare gear may grant a character extra effects."
  },
  {
    "id": 884,
    "text": "Choose the right gear based on your character's unique traits."
  },
  {
    "id": 891,
    "text": "Think you've already achieved the stature of a master tactician?"
  },
  {
    "id": 892,
    "text": "You've only just scratched the surface."
  },
  {
    "id": 893,
    "text": "Consume the corresponding medals to rank a character up and unlock new skills."
  },
  {
    "id": 894,
    "text": "Select one of two distinctive skills to create your own character build."
  },
  {
    "id": 895,
    "text": "It's really hard to decide which one to select, right?"
  },
  {
    "id": 896,
    "text": "What? You want both?"
  },
  {
    "id": 897,
    "text": "Well, you can choose both... but it's going to cost you more."
  },
  {
    "id": 901,
    "text": "Retrieve Memory Shards to recover lost power of your characters."
  },
  {
    "id": 902,
    "text": "Use them to increase the Star Level of your character's,"
  },
  {
    "id": 903,
    "text": "and greatly improves the character's trait effect!"
  },
  {
    "id": 904,
    "text": "Summon more characters to bring them to their fullest strength!"
  },
  {
    "id": 911,
    "text": "Radiant Powder can be found throughout the Sea of Chaos."
  },
  {
    "id": 912,
    "text": "Both weapons and trinkets can be improved with Radiant Powder."
  },
  {
    "id": 913,
    "text": "Hmph. I'm no blacksmith. I'll just do it once."
  },
  {
    "id": 921,
    "text": "This is the Level-up Training."
  },
  {
    "id": 922,
    "text": "Well... the taste of knowledge..."
  },
  {
    "id": 923,
    "text": "Come on, Common Exp is waiting for you!"
  },
  {
    "id": 931,
    "text": "Use Radiant Ore on gear that cannot be upgraded any further."
  },
  {
    "id": 932,
    "text": "This breaks the current level limit for greater enhancement."
  },
  {
    "id": 933,
    "text": "\"Treat your gear well, and they will give you the edge in battle..\""
  },
  {
    "id": 934,
    "text": "That's my advice to you. Remember it."
  },
  {
    "id": 941,
    "text": "Humph, welcome to the new beacon — Star Trial!"
  },
  {
    "id": 942,
    "text": "In different trials, Talent Rewards obtained are different as well."
  },
  {
    "id": 943,
    "text": "Courage, justice, or wisdom?"
  },
  {
    "id": 944,
    "text": "It's hard for me to select."
  },
  {
    "id": 951,
    "text": "It is said that everyone who fights in the Memory Retrieval can find his past."
  },
  {
    "id": 952,
    "text": "That is Memory Shard, the power that is invaluable to everyone."
  },
  {
    "id": 953,
    "text": "So, who should be on the battlefield today..."
  },
  {
    "id": 961,
    "text": "Consuming same-name gear to increase the Star Level."
  },
  {
    "id": 962,
    "text": "Star Level Up can awaken the powerful power dormant in the gear, but the price..."
  },
  {
    "id": 963,
    "text": "The consumed gear will be lost forever."
  },
  {
    "id": 964,
    "text": "Think about your reserves before you make a decision."
  },
  {
    "id": 971,
    "text": "Can you feel that? The souls scattered through various Dimensions gather here."
  },
  {
    "id": 972,
    "text": "They train to gain strength so they can fight for glory..."
  },
  {
    "id": 973,
    "text": "Here, I can hear it beckon us to join the endless fight."
  },
  {
    "id": 974,
    "text": "Do you answer the call?"
  },
  {
    "id": 981,
    "text": "Ding dong ding dong..."
  },
  {
    "id": 982,
    "text": "Radiant Forging is definitely the Dimension rich in gear materials. These noises give me a headache."
  },
  {
    "id": 983,
    "text": "Well, there are many materials for gear enhancement."
  },
  {
    "id": 984,
    "text": "You've come to the right place!"
  },
  {
    "id": 991,
    "text": "The Tower of Conquest is a ruin piled up by countless destroyed space-time."
  },
  {
    "id": 992,
    "text": "The deeper you explore, the more likely you are to get the treasure that has long been lost in the Sea of Chaos."
  },
  {
    "id": 993,
    "text": "But enemies guarding the tower also become more distorted and crazy."
  },
  {
    "id": 994,
    "text": "Conquer this endless tower, or be conquered by its mighty power..."
  },
  {
    "id": 995,
    "text": "Don't let me down!"
  },
  {
    "id": 1001,
    "text": "This space-time must have been some kind of extraordinary battlefield."
  },
  {
    "id": 1002,
    "text": "Even though it has been shattered and broken, there are still a lot of weapons and trinkets left behind."
  },
  {
    "id": 1003,
    "text": "Go and explore! Maybe there is an invincible weapon waiting for us!"
  },
  {
    "id": 1011,
    "text": "This Tarot Whisper contains shards with Tarot power."
  },
  {
    "id": 1012,
    "text": "Equip Tarot Whispers to grant characters new skills."
  },
  {
    "id": 1013,
    "text": "Listen! Can you hear the faint whispers from the Tarot?"
  },
  {
    "id": 1021,
    "text": "Hmm, Maitha is a little tacky when it comes to decorating."
  },
  {
    "id": 1022,
    "text": "I'm an expert when it comes to decorating."
  },
  {
    "id": 1023,
    "text": "I'd like to see what you can do, meow!"
  },
  {
    "id": 1031,
    "text": "Do you hear that? In this space-time of the Tarot Residual,"
  },
  {
    "id": 1032,
    "text": "countless Tarot Whispers are calling to us!"
  },
  {
    "id": 1033,
    "text": "Of course, there are the calamities that are attracted to the power..."
  },
  {
    "id": 1034,
    "text": "I believe that you know the next step, don't you?"
  }
]