[
  {
    "id": 1,
    "m_sandbox_note_selections": [1, 2, 3, 10],
    "name": "测试笔记",
    "editor_name": "测试笔记",
    "text": "→我不能确定这是不是一个正确的选择，但我还是和骑士团签订了契约。\n→拉维耶走后，小镇的情况虽然有所好转，但这个国家的情况却在急速恶化。\n→东面的矿坑市已经成了黑暗之光的据点，各种真真假假的情报和流言都表明那里已经成了可怕的人间炼狱。\n→更糟糕的是，黑暗之光并不满足于控制矿坑市，他们的信徒组成的军队正在不断地向外扩张——更准确的说是吞食这些村镇。\n→铃兰小镇也没有例外，我们不可能凭借自己的力量抵挡黑暗之光，于是我们向骑士团求救了，他们也回应了我们的求援。\n→为首的圣骑士——歌洛莉亚与泰登携带着一只人数不多",
    "first_selection": 1
  },
  {
    "id": 2,
    "m_sandbox_note_selections": [4, 12, 13],
    "name": "另一个测试笔记",
    "editor_name": "测试笔记zhm",
    "text": "这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。这是一个由zhm创建的测试笔记。",
    "first_selection": 4
  },
  {
    "id": 3,
    "m_sandbox_note_selections": [],
    "name": "第一次的笔记",
    "editor_name": "QV3-P1-第一次的笔记",
    "text": "已经过去一周了，记忆还是没有恢复。\n为了避免再次失忆，我打算把现在经历的重要事情都写下来。\n我加入了“铃兰之剑”佣兵团，感谢他们能够在这乱世之中接纳来历不明的我。\n伊利亚内战已经全面爆发，外部势力骑士同盟和罗迪尼亚法皇国也干预了这场战争。\n战争暂时还没有波及到小镇，铃兰之剑看起来也有自保能力。\n我打算好好帮助铃兰之剑，尽全力保护这个来之不易的栖身之所。",
    "first_selection": 0
  },
  {
    "id": 4,
    "m_sandbox_note_selections": [],
    "name": "寻求某一势力的帮助",
    "editor_name": "QV3-P2-寻求某一势力的帮助",
    "text": "我们成功地抵御了山贼的袭击，这是令人振奋的胜利。\n但一想到罗迪尼亚法皇国招募的那些匪徒，我就非常担忧。\n伊利亚的局势不断恶化，如果战火烧到小镇，我们肯定无法和骑士同盟或者王国军这样的势力抗衡的。\n在我们被这些强大势力袭击的时候，又会有谁来救我们呢？\n覆巢之下无完卵，只要战争不结束，小镇就不能算是彻底安全。\n况且，谁取得这场战争的胜利，会带领伊利亚走向怎样的未来，和我们也是息息相关的。\n哪怕没有足以改变战局的力量，我们也理应做出选择。不仅仅是为了一时苟延残喘，也是为了长远的和平。",
    "first_selection": 0
  },
  {
    "id": 5,
    "m_sandbox_note_selections": [5],
    "name": "参与十字路口要塞攻城战前",
    "editor_name": "QV3-P3-参与十字路口要塞攻城战前",
    "text": "佣兵团里的一些人和一部分镇上的居民，并不赞同我和骑士同盟缔结契约。\n但之前黑暗之光对小镇的进攻，证明了如果没有强大势力的庇护，我们根本活不到现在。\n哪怕代价是帮他们作战，为他们流血。\n就算只是为了保护小镇，也必须想办法帮助骑士同盟结束这场战争。\n下一步，骑士同盟已经确定将会进攻十字路要塞。\n铃兰之剑只能选择加入，并且承受代价……",
    "first_selection": 5
  },
  {
    "id": 6,
    "m_sandbox_note_selections": [6],
    "name": "十字路口会战后的反思（无信标）",
    "editor_name": "QV3-P4-十字路口会战后的反思（无信物）",
    "text": "刚刚结束的十字路要塞攻城战，让我真正意识到了什么是战争。\n王国军誓死坚守，罗迪尼亚法皇国也出卖了我们，整个战局一败涂地，连麦莎都受了重伤。\n好在歌洛莉亚和泰登回来援救，让大部分人都活了下来。\n而这场战争，还远远没有结束。\n鲁特菲带来了一枚勋章，以表彰铃兰之剑的英勇作战。\n我没有感激他，但他却并不气愤。\n这位一直以来都很平易近人的王子似乎话里有话。",
    "first_selection": 6
  },
  {
    "id": 7,
    "m_sandbox_note_selections": [7],
    "name": "十字路口会战后的反思（歌洛莉亚信标）",
    "editor_name": "QV3-P4-十字路口会战后的反思（歌洛莉亚信物）",
    "text": "刚刚结束的十字路要塞攻城战，让我真正意识到了什么是战争。\n王国军誓死坚守，罗迪尼亚法皇国也出卖了我们，整个战局一败涂地，连麦莎都受了重伤。\n而这场战争，还远远没有结束。\n歌洛莉亚带来了一枚勋章，并且代表骑士团向我们道了歉。\n的确，虽然骑士团没有很好地组织撤退，但战败的根本原因还是因为法皇国背信弃义。\n况且正是因为歌洛莉亚和泰登回来援救，才让大部分人都活了下来。\n关于歌洛莉亚……",
    "first_selection": 7
  },
  {
    "id": 8,
    "m_sandbox_note_selections": [8],
    "name": "关于二王子的计划",
    "editor_name": "QV3-P4-关于二王子的计划",
    "text": "拉维耶……\n收留我、培养我，让我成为铃兰之剑团长的那个人永远地走了……\n佣兵团所有人都陷入了悲痛之中，尤其是麦莎和法卡尔。\n拉维耶，我们的大姐头，愿你在天国安息。\n\n歌洛莉亚来小镇接走了王女。\n我按照鲁特菲的吩咐，成功劝说歌洛莉亚立下了保护伊南娜的骑士誓约。\n伊南娜殿下应该不会有事，但鲁特菲的计划到底是什么呢？",
    "first_selection": 8
  },
  {
    "id": 9,
    "m_sandbox_note_selections": [],
    "name": "调查的结果（二王子线）",
    "editor_name": "QV3-P5-调查的结果（二王子线）",
    "text": "浪涌城事件的调查，已经有结果了。\n第一王子迪塔利奥，和先遣骑士团团长奥古斯特，就是罪魁祸首。\n鲁特菲计划让骑士同盟与王国军两败俱伤，再一一解决。\n尽管他没有透露计划细节，但他保证伊利亚会迎来独立的和平。\n虽然这意味着出卖歌洛莉亚，但我实在没办法相信她。\n哪怕她是正义的，正直的，但就如同鲁特菲所说的，这样一个巨大的阴谋，不可能只由几个人完成。\n歌洛莉亚又凭什么靠一个人与整个骑士同盟对抗呢？\n接下来，我们的行动，就是要先帮助骑士同盟再一次进攻十字路要塞。\n但我们会成功的，我们会为伊利亚迎来和平，来告慰拉维耶和其他遇难者的在天之灵。\n只要再给我们一点点时间。",
    "first_selection": 0
  },
  {
    "id": 10,
    "m_sandbox_note_selections": [],
    "name": "迫近的真相（歌洛莉亚线）",
    "editor_name": "QV3-P5-迫近的真相（歌洛莉亚线）",
    "text": "浪涌城事件的调查，已经有结果了。\n第一王子迪塔利奥，和先遣骑士团团长奥古斯特，就是罪魁祸首。\n鲁特菲计划让骑士同盟与王国军两败俱伤，再一一解决。\n他没有透露计划细节，但他保证伊利亚会迎来独立的和平。\n这一切看上去都很美好，但一切真的会如他所想顺利展开吗？\n这个世界上没有完美的计划，我宁可相信那些有着高尚品德的人。\n尽管骑士同盟和这场阴谋脱不开关系，但我还是相信歌洛莉亚。\n就如同我们约定的那样，我帮助骑士同盟打赢第二次十字路会战，击败王国军，让刽子手迪塔利奥付出代价。\n而她继续调查骑士同盟的堕落者，将他们绳之以法。\n\n尽管这不会是一条很好走的路，但我们会成功的。\n我们会为伊利亚迎来和平，来告慰拉维耶和其他遇难者的在天之灵。",
    "first_selection": 0
  },
  {
    "id": 11,
    "m_sandbox_note_selections": [],
    "name": "变局（二王子线）",
    "editor_name": "QV3-P6-变局（二王子线）",
    "text": "事情的反转实在是太剧烈了。\n尽管很艰苦，但我们还是取得了第二次十字路会战的胜利。\n在权谋背后，鲁特菲也展现出了他值得尊敬的一面。\n在攻城战中，他不计损失地援救铃兰之剑，随后又为了争取主和派的支持深入王国军控制区。\n他是真心希望尽早给伊利亚带来和平的。\n这份努力也得到了回报——王国军的现任指挥官，马格努斯元帅带来了老国王法里斯的口谕。\n他们已经默认了鲁特菲的胜利。\n只要再加把劲，也许就可以彻底解决王国军的问题。\n在那之后，就是骑士同盟了。\n尽管鲁特菲还没有告诉我他该如何解决骑士同盟的问题，但我相信他一定有所准备。\n一切都在往好的方向发展，终于，在经历过这么多困难后，我似乎终于看到和平的曙光了……",
    "first_selection": 0
  },
  {
    "id": 12,
    "m_sandbox_note_selections": [],
    "name": "行动开始（歌洛莉亚线）",
    "editor_name": "QV3-P6-行动开始（歌洛莉亚线）",
    "text": "第二次十字路要塞攻城战，对铃兰之剑来说太惨痛了。\n我们被当成弃子，毫无意义地被抛弃在战场上。\n我并不认为泰登的话错了，伊利亚人的自由需要自己用生命和鲜血去争取。\n但我最大的担心是，泰登没有正面回应我的那个问题。\n在这一切结束后，等待我们的真的是许诺中的自由的新伊利亚吗，还是一个被骑士同盟操控的国家呢？\n唯一能够让我感觉到些许庆幸的是，骑士同盟里还有歌洛莉亚这样正直的人。\n我现在能做的，就是帮助她找到证据，揪出骑士同盟里的堕落者。\n但要对同僚兵戎相向……这样巨大的精神压力，歌洛莉亚真的能够承受得了吗？\n也许在这之后，我可以跟她好好谈一谈……\n明天，奥古斯特会举办一场宴会，歌洛莉亚会趁这个机会找到决定性的证据。\n我能做的，就是牵制好奥古斯特，给她争取更多的时间。\n希望这一切真的值得。",
    "first_selection": 0
  },
  {
    "id": 13,
    "m_sandbox_note_selections": [],
    "name": "黎明之前",
    "editor_name": "QV3-P7-黎明之前（二王子线）",
    "text": "\n\n战争结束了。\n迪塔利奥试图凭借晨曦堡进行最后的坚守，让更多人为他的野心陪葬，我们和鲁特菲则是联手通过一系列的行动化解了他的阴谋，以最小的代价拿下了王都。\n鲁特菲已经带着他的人接管了晨曦堡，他将以第二王子的身份暂时监国，虽然很难说伊利亚已经开始复苏，但至少局势不再恶化了，我们清理了盗匪，击败了黑暗之光的垂死挣扎，收拢了剩下的还效忠于迪塔利奥的王国军……除了少数的疯子，已经没有人想要继续这场战争了。\n大家都已经见到太多牺牲了。\n唯一令人不安的是，歌洛莉亚被骑士同盟正式宣布为叛徒，奥古斯特对歌洛莉亚展开了搜捕。\n在我看来，歌洛莉亚是一个高洁的人，她是绝对不会背弃自己的信仰的。\n所以……难道说……这是鲁特菲的计划的一环？\n此外，他还告诉我，骑士同盟很可能要通过审判伊南娜，彻底解决浪涌城悲剧，不过他让我不要紧张，他自然有办法保住伊南娜的性命。\n他已经表现出了足够让我信任的能力，所以我不会怀疑他，只需要等着他告诉我计划的全貌就好了。\n希望一切都能够按照计划。\n希望黎明能早日到来……彻底到来。",
    "first_selection": 0
  },
  {
    "id": 14,
    "m_sandbox_note_selections": [],
    "name": "真相与信任",
    "editor_name": "QV3-P7-真相与信任（歌洛莉亚线）",
    "text": "伊利亚的内战已经彻底结束了。\n理论上说，我们一直以来所期盼的和平已经到来了。\n但这不是真正的和平，这只是一场肮脏的交易。\n骑士同盟发动了伊利亚的内战，再以解放者的身份推翻伊利亚王室。\n我几乎不会质疑，骑士同盟会成为一个新的骑在伊利亚头上的残暴统治者。\n这样的和平没有任何的意义。\n好在，并不是所有骑士同盟的成员都认同并参与了这场阴谋。\n歌洛莉亚依然坚守着自己的诺言，并且为之奋战着。\n骑士同盟是一个恐怖的霸权，但不论它有多强大，我都相信歌洛莉亚。\n相信她绝对不会退缩，不会放弃，不会屈服。\n敬所有为了真相和正义永不放弃的勇士。\n致所有在浪涌城事件和伊利亚内战中无辜死去的冤魂。",
    "first_selection": 0
  },
  {
    "id": 15,
    "m_sandbox_note_selections": [],
    "name": "第一次的笔记",
    "editor_name": "QV3-P1-第一次的笔记（二周目）",
    "text": "已经过去一周了，记忆还是没有恢复。\n身份，过往，目标，亲友……统统都没有任何线索，我仿佛根本不是这个世界的人，没有在这个世界上留下任何的痕迹。\n为了避免再次失忆的可能，我打算把现在经历的重要事情都写下来。\n加入铃兰之剑也已经过了一周了，对于失忆的我来说，能够找到这么一个可以信赖的栖身之地真是最大的幸运。\n小镇外面的局势越来越糟糕了，王国军和浪涌军的内战已经全面爆发，外部势力骑士同盟和罗迪尼亚法皇国也干预了这场战争。\n铃兰之剑似乎还有自保的能力，但我总觉得有些不安。\n也许接下来，应该更加主动地出击，将威胁消弭于无形吧。",
    "first_selection": 0
  },
  {
    "id": 16,
    "m_sandbox_note_selections": [9],
    "name": "二王子的来信",
    "editor_name": "QV3-P5-二王子的来信",
    "text": "如他早就说过的，鲁特菲准备开始针对骑士同盟的计划了。\n他希望我在关键时候不要第一时间帮助歌洛莉亚，以妨碍她的调查。\n歌洛莉亚是一个值得信赖的骑士，我相信她确实是在不惜一切代价寻找真相。\n但鲁特菲有个更大的计划，他考虑的不仅是真相，还有如何解决骑士同盟。\n如果歌洛莉亚真的向我求援，我应该帮助她吗？\n我应该信任鲁特菲和他的计划吗？",
    "first_selection": 9
  },
  {
    "id": 17,
    "m_sandbox_note_selections": [],
    "name": "共通线-第一章： 团长的笔记1",
    "editor_name": "共通线-第一章： 团长的笔记1",
    "text": "自我在监狱中醒来，到如今铃兰小镇安身立命，已经过去了一段时间。我仍旧没有想起来我是谁，世界也是完全陌生的。为了避免再次失忆，我打算将我所经历的重要的事情都记录下来。\n想来最近真的发生了不少大事，伊利亚的内战已经全面爆发，我与几个新认识的伙伴从浪涌城死里逃生，感谢他们接纳来历不明的我，还让我加入了他们的佣兵团铃兰之剑，成为了助理团长。\n目前外界动荡不安，铃兰之剑好似在风雨中飘摇的小舟，想必迟早会被卷入波涛之中，而我，则会用尽全力，保护好这个来之不易的栖身之所。",
    "first_selection": 0
  },
  {
    "id": 18,
    "m_sandbox_note_selections": [],
    "name": "共通线-第一章： 团长的笔记2",
    "editor_name": "共通线-第一章：团长的笔记2",
    "text": "最近小镇越来越热闹了，来了许多新伙伴，美丽神秘的薇尔德舞团，医者仁心的光辉术师萨曼莎，任性跳脱的魔女贝拉……她们的到来让小镇变得生机勃勃起来。\n当然，最近小镇的麻烦也不少，难民涌入，盗匪猖獗，佣兵团的袭击接踵而至……幸好我们成功地阻挡了这些危机，保护了小镇。\n还有一件最重要的事，拉维耶离开了，将团长之位留给了我。这是一副沉重的担子，我却不得不接受，我似乎一直是被命运推着走的，而此时此刻，我却肩负起了别人的命运，我真的可以胜任团长吗？\n我又应该带领铃兰之剑，走向何方呢？",
    "first_selection": 0
  },
  {
    "id": 19,
    "m_sandbox_note_selections": [],
    "name": "共通线-第二章： 黑暗之光后（王国军线）",
    "editor_name": "共通线-第二章： 黑暗之光后（王国军线）",
    "text": "对于和王国军的合作，许多镇民表示不理解与不赞成。但黑暗之光危机已经充分说明了，我们必须借助他人的力量，才能在乱世中生存。\n王国军会帮助小镇，也证明了他们并不是无药可救，无论如何，为了小镇的安全，现在只能走一步算一步了。接下来我将护送王女伊南娜去晨曦堡，也即将会见伊利亚的第一王子，迈出与王国军合作的第一步。",
    "first_selection": 0
  },
  {
    "id": 20,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第一章： 第一次十字路口会战之前",
    "editor_name": "王国军线-第一章： 第一次十字路口会战之前",
    "text": "与王国军缔结同盟后，又发生了许多事情，我和伊南娜一同远赴薇尔德，才知道诺诺薇儿竟然是薇尔德族长的妹妹，其实很多事情之前已经有所预兆，我应该早些察觉到的。\n除此之外，王室别庄一场会面可以看出，伊利亚三位王室成员之间的关系远比我想象中的复杂许多，不过好在薇尔德已经同意与我们合作，一切都朝着我们所希望的方向发展，接下来，就要迎接十字路会战了。",
    "first_selection": 0
  },
  {
    "id": 21,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第一章： 第一次十字路口会战结束后",
    "editor_name": "王国军线-第一章： 第一次十字路口会战结束后",
    "text": "十字路会战暂时告一段落了，但骑士同盟肯定不会就此善罢甘休，他们只是在等待增援，不久之后便会卷土重来。\n自从铃兰之剑加入王国军后，发生了太多事情，觐见王子，远赴薇尔德，庄园会面，再到这场大战……\n幸好我们是暂时的赢家，这一切也多亏了露西亚和薇尔德人的相助。接下来我们还需要继续招兵买马，邀请更多的盟友加入我们，只有这样，才能赢得最终的胜利。",
    "first_selection": 0
  },
  {
    "id": 22,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第二章： 第二次十字路口会战前",
    "editor_name": "王国军线-第二章： 第二次十字路口会战前",
    "text": "露西亚佣兵团同意与我们合作并且入驻了小镇，这个好消息大大鼓舞了团队的士气。令人意外的是旧贵族居然在此时发动了政变，幸好这场政变很快被镇压下来，米格尔和他的跟班也死在我们的手下。而彻查之后的证据居然直指法皇国，无论此事真相是如何，我们与法皇国是注定无法成为同伴了。\n而近期最令人欣喜的事情，是我再次见到拉维耶了，那个收留我，培养我的大姐头，相信很快她便会重归小镇，期待着我们再次并肩作战的那天。",
    "first_selection": 0
  },
  {
    "id": 23,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第三章：第二次十字路口会战后（不歼灭骑士团）",
    "editor_name": "王国军线-第三章：第二次十字路口会战后（不歼灭骑士团）",
    "text": "事情发展得太出乎意料了，尽管很艰难，但我们还是取得了第二次十字路会战的胜利。只是这胜利的代价，未免太过惨重了……\n薇尔德与露西亚相继被抛弃，曾经的盟友一个一个的牺牲在我们的面前，虽说战争无情，可我们却为了最终的胜利，选择牺牲他们……作为战胜的一方，我没有丝毫胜利的喜悦。\n战争结束后的和谈也十分不顺利，意外的消息接踵而至，原来浪涌城的悲剧，奥古斯特与第二王子鲁特菲就是始作俑者，我虽然早有预料，可当真相揭露的那一刻，还是久久无法回神。\n最终奥古斯特得到了他应有的惩罚，并没有因他牵连到骑士团众多骑士……接下来就是收拾伊利亚的残局了，希望能早日看到和平的曙光……",
    "first_selection": 0
  },
  {
    "id": 24,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第三章：第二次十字路口会战后（歼灭骑士团）",
    "editor_name": "王国军线-第三章：第二次十字路口会战后（歼灭骑士团）",
    "text": "事情发展得太出乎意料了，尽管很艰难，但我们还是取得了第二次十字路会战的胜利。只是这胜利的代价，未免太过惨重了……\n薇尔德与露西亚相继被抛弃，曾经的盟友一个一个的牺牲在我们的面前，虽说战争无情，可我们却为了最终的胜利，选择牺牲他们……作为战胜的一方，我没有丝毫胜利的喜悦。战争结束后的和谈也十分不顺利，意外的消息接踵而至，原来浪涌城的悲剧，奥古斯特与第二王子鲁特菲就是始作俑者，我虽然早有预料，可当真相揭露的那一刻，还是久久无法回神。\n最终我们没有放过那些骑士们，当然也包括罪魁祸首奥古斯特……这样做是否太残忍了？我仍有犹疑，但眼下也只能如此。接下来就是收拾残局了，希望能早日看到和平的曙光……",
    "first_selection": 0
  },
  {
    "id": 25,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第三章：反思诺诺薇儿事件",
    "editor_name": "王国军线-第三章：反思诺诺薇儿事件",
    "text": "我还记得薇尔德舞团初来小镇时的样子，她们是那样美丽动人，而诺诺薇儿的歌声，是那样悠扬动听，令人难忘……\n不过几个月的时间，一切都变了……\n就像是看着鲜艳的花朵枯萎，却无能为力，而造就这一切的，不仅仅是战争，还有王国军，还有……我自己。\n她们不应该有这样的结果，到底是哪里出了问题……我又犯了怎样的错误？",
    "first_selection": 0
  },
  {
    "id": 26,
    "m_sandbox_note_selections": [],
    "name": "矿坑城事件后笔记",
    "editor_name": "法皇国线-第一章：矿坑城事件后笔记",
    "text": "我们彻底拔除了矿坑城的黑暗之光，解放了许多苦难中的人。矿坑城与小镇的人们都在欢庆这场胜利，但我知道，黑夜并没有彻底结束……\n握着小女孩那冰冷的手，我的内心早已被悲痛侵占……有多少人像她一样，在这场毫无人性的战争中失去了所有。有多少人背井离乡，忍受着漂泊之苦，又有多少人无路可走，被黑暗之光欺骗压榨，跌入无尽深渊。\n我绝不能再让这样的悲剧上演。萨曼莎想结束战争，想将光辉重新带回这个世界，这条路十分艰难，但与如今被黑夜与战乱笼罩的伊利亚相比，却是真正的希望。",
    "first_selection": 0
  },
  {
    "id": 27,
    "m_sandbox_note_selections": [],
    "name": "刺杀结束后笔记",
    "editor_name": "法皇国线-第二章：刺杀结束后笔记",
    "text": "直到现在，我依然会怀疑这场刺杀行动是否正确。我甚至也不清楚，这种怀疑究竟是来自我内心的软弱，抑或是来自对我们所行之路的担忧。但无论如何，我的双手已经沾上了鲜血。\n萨曼莎安慰了我，我能看出她心中的愧疚。但我也清楚，她这一路走来所要承受的痛苦远甚于我。这就是她的光辉之道，为了他人美好的未来，全然不顾自己。\n为了伊利亚的和平，为了不再发生那些悲剧，我必须战胜内心的彷徨，这条路曲折而漫长。所幸，我有萨曼莎这样一个彼此信任，可以并肩而行的战友。",
    "first_selection": 0
  },
  {
    "id": 28,
    "m_sandbox_note_selections": [14],
    "name": "和谈失败后的笔记",
    "editor_name": "法皇国线-第三章：和谈失败后的笔记",
    "text": "法皇国与伊利亚联手击溃了骑士团，我与萨曼莎也作为法皇国的使者与伊利亚展开和谈，这是我们离伊利亚的和平最近的时刻。\n尽管塔埃尔提醒过我，伊利亚与法皇国之间构怨颇深，但我却依然不愿错过这个机会，为了我们曾经的努力，为了死去的拉维耶，为了更多战乱中的人民。",
    "first_selection": 14
  },
  {
    "id": 29,
    "m_sandbox_note_selections": [],
    "name": "邦国王子死后笔记",
    "editor_name": "法皇国线-第四章-表线：邦国王子死后笔记",
    "text": "局势逐渐恶化到令人窒息的程度。法皇国一直在镇压浪涌城与矿坑城民众的反抗，无数平民在我们面前流血牺牲，但我们却无法从根源上阻止这一切。\n甚至……我们还不得不去保护费尔南多这个禽兽。最终，艾达也与我们决裂，而我的好友塔埃尔也被牵连遇害……\n萨曼莎内心始终处于痛苦与无奈之中，我只能尽力安慰她。有时我在想，如果当初我与萨曼莎做出另外一些选择，结局会不会有所不同，但这些只是我自己的幻想罢了。\n回头望去，这条路满是泥泞与血污。有太多的哀号与咒骂在我们耳后徘徊，许多重要的人离我们而去……\n我和萨曼莎都清楚，我们的双手早已染满罪孽。但……这都是我和她共同的决定，与其耽溺于懊悔之中，我们必须做更多事情来补救，为了伊利亚的和平，为了那些早已离我们而去的人……",
    "first_selection": 0
  },
  {
    "id": 30,
    "m_sandbox_note_selections": [],
    "name": "新计划笔记",
    "editor_name": "法皇国线-第四章-里线：新计划笔记",
    "text": "我们做的每一个决定就像行走于悬崖之缘，稍有不慎就会滑落深谷。但，萨曼莎最终做了正确的选择。这一次，我们坚定地站在反抗法皇国的民众这边，同时处决了罪大恶极的费尔南多，解救了那些差点被送进大庇护所这座炼狱里的孩子们，也看清了法皇国的真面目。\n在做这一个个关键抉择的过程中，萨曼莎也慢慢挣脱了束缚自身的枷锁，她的眼神不再迷茫、忧虑与痛苦，反而变得前所未有地坚定。光辉之道不该是牺牲铸就的道路，它本来就应当如此纯粹、明亮、推崇善良与关爱世人。与萨曼莎相处这么久，我相信，这才是萨曼莎应当走的路，也是萨曼莎真正的本心。\n但预示着新的希望的道路，前方却有着万重高山般的阻拦。要反抗法皇国这样的庞然大国，我们的力量还是太小了……但我们不会放弃，在有限的条件下，我们最终拟定了一个计划，并且已经找到了坚定的盟友。这个计划谈不上周密，甚至更像是孤注一掷，但我相信着这个计划的每一个执行者：塔埃尔、艾达、伊南娜。\n最后，我只能向光辉祈愿，希望我们的计划一切顺利……",
    "first_selection": 0
  },
  {
    "id": 31,
    "m_sandbox_note_selections": [],
    "name": "王国军线-第四章：关于演讲失败的笔记",
    "editor_name": "王国军线-第四章：关于演讲失败的笔记",
    "text": "在矿坑城，我们最终没能获得足够多的支持者……\n回想过去的种种，对于获得足够多的支持，最为关键的地方应该是——在迪塔利奥试图让矿坑城断粮时，在与骑士团的决战中我们回援同盟时，以及在凑齐赎买薇尔德人的赎金时……我们或许可以处理地更加妥善。\n如今，境况已不可挽回，但我们还可以和仍在支持我们的人一起，努力面对未来。",
    "first_selection": 0
  },
  {
    "id": 32,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第一章：笔记P2",
    "editor_name": "埃拉曼线-第一章：笔记P2",
    "text": "自我在地牢中醒来，到如今在铃兰小镇安身立命，已经过去了几个月。\n拉维耶将铃兰之剑佣兵团托付给我，而我却阴差阳错地当上了铃兰商会的会长。\n既然都是为了铃兰小镇，我想这应该没有什么问题。\n这段时间里，我们在浪涌城碰见的那个女孩加入了我们。她向我披露了她的真实身份是伊利亚的王女，对此我颇感意外，但却似乎在情理之中。\n处理薇尔德舞团的案件之时，我没想到自己会把夏可露露逼得那么紧，现在回想起来我欠她一个道歉。\n这段时间最令我有成就感的，就是协助艾达他们一起将废弃的矿坑城重新翻新，容纳了更多难民人口。\n矿坑城有足够大的地方，但是土地却很贫瘠，粮食补给品更加依赖外界。或许当什么时候他们有了自己的核心产业，与外部进行合理的交换，矿坑城的人们才能算是真正地拥有了新家吧。\n为了弥补黑暗之光造成的损失，我得动身前往拉比亚绿洲了。\n虽然是一个陌生又遥远的地方，但我却对那里会发生的事情充满期待。",
    "first_selection": 0
  },
  {
    "id": 33,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第二章：笔记P3",
    "editor_name": "埃拉曼线-第二章：笔记P3",
    "text": "没想到我送往拉比亚绿洲的货物，居然会是活生生的人类。\n我不希望自己被捆着双手双脚，塞入密不透风的囚车中，所以我选择了帮助他们逃走。\n虽然这一行为造成了一些后续影响，但似乎并不都是坏事。总之，我并不后悔这个决定。\n拉比亚绿洲确实是一个新奇的地方，我感觉自己似乎永远也逛不完，但根据阿坎贝曾经的说法，哈沙拉姆的大巴扎比这里的集市还要大得多得多，实在是难以令人想象。\n经历了一些风波之后，我终于再次见到了阿坎贝，令我感到迷茫的是，他居然使用金钱就轻松解决了黑暗之光的危机。黑暗之光到底是怎样的组织？金钱的作用到底还能有多么强大？\n在各自与先遣骑士团和王国军交往后，我发现了商会与佣兵团的待遇不同，双方皆不会关心你的立场究竟站在哪一边，这似乎是一个默认的规则。\n新的伙伴在继续增加，这个有着神奇耳朵的新朋友，正在为我们的长期征战的压抑气氛带来改变。\n当初我想，举办一次盛大的铃兰节，把大家都撮合到一块，一定是个非常好的想法。\n但事实证明，这是一个非常天真的想法。",
    "first_selection": 0
  },
  {
    "id": 34,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第三章：笔记P4",
    "editor_name": "埃拉曼线-第三章：笔记P4",
    "text": "多亏霍玛找到了关键证据，使得铃兰小镇洗清了嫌疑。\n原本我对鲁特菲有着不错的好感，但是他为了保全自己而牺牲我们的做法，使我非常失望。\n这段时间里，我和阿坎贝因为武器贸易的问题分道扬镳，各自经营。\n但我十分肯定，不会有任何一种和平是通过向战争的双方输送大量武器得到的。\n这段时间里我不停地帮助艾达和诺诺薇儿她们，最终，她们也共同成立了一个有力的新组织。\n我认为，这才是能够通往和平的一条有效路径。",
    "first_selection": 0
  },
  {
    "id": 35,
    "m_sandbox_note_selections": [],
    "name": "埃拉曼线-第四章：笔记P5",
    "editor_name": "埃拉曼线-第四章：笔记P5",
    "text": "终于，我们的付出有了质的变化，先遣骑士团和伊利亚王国军同意停火了。\n但这也让阿坎贝的武器生意遭受了重创，当我刚开始担心他的时候，我却踩中了他过去留下的陷阱，这样两败俱伤的局面难道就这样不可避免吗？\n霍玛在这样的时刻无私地挺身而出，主动替我扛下了罪责，对此我十分愧疚。更甚至，她在得到阿坎贝遭遇不测的消息时，也是第一时间通知我，即便她与阿坎贝似乎相处得不太愉快。\n而当我们救出阿坎贝后，没想到武器贸易的背后，居然还能牵扯出阿坎贝和蔻蔻娜父母之间的过往恩怨。\n他们之间的故事，让我感受到了人们关系的复杂，不知道阿坎贝未来还会怎样面对蔻蔻娜。\n但这一切恩恩怨怨，都被十字路要塞的中立化所冲淡，感谢聪慧勇敢的伊南娜所做出的努力。\n如今大部分伊利亚人都沉浸在和平即将到来的喜悦之中，但在这之前，还有一些最后的困难需要面对。",
    "first_selection": 0
  }
]